#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget
// 0x0198 (0x0198 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_Event_Callback;                             // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bExpanded;                            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FA0[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InIndexInList;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelected;                            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FA1[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionOfferDetailsWidget_C* CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FA2[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_InData;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        K2Node_Event_OwningList;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferInfo*        K2Node_DynamicCast_AsFort_Direct_Acquisition_Offer_Info; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FA3[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FA4[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA5[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0040)(HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue2;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA6[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA7[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00F8(0x0008)(NoDestructor)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA8[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDirectAcquisitionOfferInfo*        CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA9[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0118(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0158(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FAA[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0170(0x0018)()
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate2;             // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget) == 0x000198, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, EntryPoint) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_Callback) == 0x000010, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_Callback' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_bExpanded) == 0x000020, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_bExpanded' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_InIndexInList) == 0x000024, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_InIndexInList' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_bSelected) == 0x000028, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_bSelected' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferInfo_ReturnValue) == 0x000038, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Create_ReturnValue) == 0x000040, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000048, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_CustomEvent_bSuccess) == 0x000050, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_InData) == 0x000058, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_InData' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_OwningList) == 0x000060, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_OwningList' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_DynamicCast_AsFort_Direct_Acquisition_Offer_Info) == 0x000068, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_DynamicCast_AsFort_Direct_Acquisition_Offer_Info' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000078, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000084, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Array_Length_ReturnValue2) == 0x000088, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferInfo_ReturnValue2) == 0x0000D0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Array_Find_ReturnValue) == 0x0000D8, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0000E0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Add_IntInt_ReturnValue) == 0x0000F0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000F8, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Percent_IntInt_ReturnValue) == 0x000100, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Array_Get_Item) == 0x000108, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Add_IntInt_ReturnValue2) == 0x000110, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_MakeStruct_FormatArgumentData2) == 0x000118, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_MakeArray_Array) == 0x000158, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000168, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Format_ReturnValue) == 0x000170, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000188, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.SetData
// 0x0010 (0x0010 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_SetData final
{
public:
	class UObject*                                InData;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        OwningList;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_SetData) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_SetData");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_SetData) == 0x000010, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_SetData");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetData, InData) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetData::InData' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetData, OwningList) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetData::OwningList' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.HandleOfferPurchaseComplete
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete) == 0x000001, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete) == 0x000001, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete, bSuccess) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete::bSuccess' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_SetSelected final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_SetSelected) == 0x000001, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_SetSelected");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_SetSelected) == 0x000001, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_SetSelected");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetSelected, bSelected) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetSelected::bSelected' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.SetIndexInList
// 0x0004 (0x0004 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_SetIndexInList final
{
public:
	int32                                         InIndexInList;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_SetIndexInList) == 0x000004, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_SetIndexInList");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_SetIndexInList) == 0x000004, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_SetIndexInList");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetIndexInList, InIndexInList) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetIndexInList::InIndexInList' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.SetExpanded
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_SetExpanded final
{
public:
	bool                                          bExpanded;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_SetExpanded) == 0x000001, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_SetExpanded");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_SetExpanded) == 0x000001, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_SetExpanded");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetExpanded, bExpanded) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetExpanded::bExpanded' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.RegisterOnClicked
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) AthenaDirectAcquisitionOfferWidget_C_RegisterOnClicked final
{
public:
	TDelegate<void(class UUserWidget* Widget)>    Callback;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_RegisterOnClicked) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_RegisterOnClicked");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_RegisterOnClicked) == 0x000010, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_RegisterOnClicked");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_RegisterOnClicked, Callback) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_RegisterOnClicked::Callback' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.OfferSet
// 0x00C8 (0x00C8 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_OfferSet final
{
public:
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_GetTileImage_ReturnValue;                 // 0x0018(0x0078)()
	class UFortAccountItemDefinition*             CallFunc_GetFirstGrantItemDefinition_ReturnValue;  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetLargePreviewImage_ReturnValue;         // 0x0098(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_HasDisplayAsset_ReturnValue;              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_OfferSet) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_OfferSet");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_OfferSet) == 0x0000C8, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_OfferSet");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OfferSet, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_OfferSet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OfferSet, CallFunc_GetOfferInfo_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferWidget_C_OfferSet::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OfferSet, CallFunc_GetTileImage_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionOfferWidget_C_OfferSet::CallFunc_GetTileImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OfferSet, CallFunc_GetFirstGrantItemDefinition_ReturnValue) == 0x000090, "Member 'AthenaDirectAcquisitionOfferWidget_C_OfferSet::CallFunc_GetFirstGrantItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OfferSet, CallFunc_GetLargePreviewImage_ReturnValue) == 0x000098, "Member 'AthenaDirectAcquisitionOfferWidget_C_OfferSet::CallFunc_GetLargePreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OfferSet, CallFunc_HasDisplayAsset_ReturnValue) == 0x0000C0, "Member 'AthenaDirectAcquisitionOfferWidget_C_OfferSet::CallFunc_HasDisplayAsset_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.UpdateAvailability
// 0x0148 (0x0148 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FAB[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FAC[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable3;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue2;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetOfferId_ReturnValue;                   // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnique_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOwned_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FAD[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetQuantityRemaining_ReturnValue;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FAE[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0068(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0040)(HasGetValueTypeHash)
	int32                                         K2Node_Select2_Default;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FAF[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FB0[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00F8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue2;             // 0x0110(0x0018)()
	bool                                          Temp_bool_Variable3;                               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FB1[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x0130(0x0018)()
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability) == 0x000148, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_bool_Variable) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_int_Variable) == 0x000004, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_int_Variable2) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_bool_Variable2) == 0x00000C, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_int_Variable3) == 0x000010, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_int_Variable4) == 0x000014, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_text_Variable) == 0x000020, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetOfferInfo_ReturnValue) == 0x000038, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetOfferInfo_ReturnValue2) == 0x000040, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetOfferInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetOfferId_ReturnValue) == 0x000048, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetOfferId_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_IsUnique_ReturnValue) == 0x000058, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_IsUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_IsOwned_ReturnValue) == 0x000059, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_IsOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetQuantityRemaining_ReturnValue) == 0x00005C, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetQuantityRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_Select_Default) == 0x000060, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000064, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_Conv_IntToText_ReturnValue) == 0x000068, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_Select2_Default) == 0x0000C0, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_MakeArray_Array) == 0x0000C8, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x0000D8, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_MakeLiteralText_ReturnValue) == 0x0000F8, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_MakeLiteralText_ReturnValue2) == 0x000110, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_MakeLiteralText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_bool_Variable3) == 0x000128, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_Select3_Default) == 0x000130, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_Select3_Default' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.UpdateStyle
// 0x0190 (0x0190 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_UpdateStyle final
{
public:
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0000(0x0078)()
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0078(0x0010)(NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin2;                         // 0x0088(0x0010)(NoDestructor)
	class UBorderSlot*                            K2Node_DynamicCast_AsBorder_Slot;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FB2[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorderSlot*                            K2Node_DynamicCast_AsBorder_Slot2;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FB3[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue2;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnique_ReturnValue;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FB4[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             CallFunc_GetFirstGrantItemDefinition_ReturnValue;  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FB5[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x00E0(0x0080)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue2;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue3;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue4;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_UpdateStyle");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle) == 0x000190, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_UpdateStyle");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, K2Node_MakeStruct_SlateBrush) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, K2Node_MakeStruct_Margin) == 0x000078, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, K2Node_MakeStruct_Margin2) == 0x000088, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::K2Node_MakeStruct_Margin2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, K2Node_DynamicCast_AsBorder_Slot) == 0x000098, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::K2Node_DynamicCast_AsBorder_Slot' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, K2Node_DynamicCast_AsBorder_Slot2) == 0x0000A8, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::K2Node_DynamicCast_AsBorder_Slot2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, K2Node_DynamicCast_bSuccess2) == 0x0000B0, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_GetOfferInfo_ReturnValue) == 0x0000B8, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_GetOfferInfo_ReturnValue2) == 0x0000C0, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_GetOfferInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_IsUnique_ReturnValue) == 0x0000C8, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_IsUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_GetFirstGrantItemDefinition_ReturnValue) == 0x0000D0, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_GetFirstGrantItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_GetRarity_ReturnValue) == 0x0000D8, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_BPGetRarityData_ReturnValue) == 0x0000E0, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000160, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000168, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_GetDynamicMaterial_ReturnValue2) == 0x000170, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_GetDynamicMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_GetDynamicFontMaterial_ReturnValue2) == 0x000178, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_GetDynamicFontMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_GetDynamicMaterial_ReturnValue3) == 0x000180, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_GetDynamicMaterial_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_GetDynamicMaterial_ReturnValue4) == 0x000188, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_GetDynamicMaterial_ReturnValue4' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.SetupPrice
// 0x0030 (0x0030 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_SetupPrice final
{
public:
	int32                                         PriceIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FB6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemCount_C*                           PriceWidget;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPriceItem_RequiredItemCount;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FB7[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             CallFunc_GetPriceItem_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_SetupPrice");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice) == 0x000030, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_SetupPrice");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, PriceIndex) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::PriceIndex' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, PriceWidget) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::PriceWidget' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, CallFunc_GetOfferInfo_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, CallFunc_GetPriceItem_RequiredItemCount) == 0x000018, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::CallFunc_GetPriceItem_RequiredItemCount' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, CallFunc_GetPriceItem_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::CallFunc_GetPriceItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.LargeImageLoaded
// 0x0018 (0x0018 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded final
{
public:
	class UObject*                                LoadedObject;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded) == 0x000018, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded, LoadedObject) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded::LoadedObject' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded, K2Node_DynamicCast_AsTexture_2D) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.UpdateName
// 0x0060 (0x0060 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_UpdateName final
{
public:
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemTypeText_ReturnValue;              // 0x0008(0x0018)()
	class FText                                   CallFunc_GetName_ReturnValue;                      // 0x0020(0x0018)()
	bool                                          CallFunc_IsUnique_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FB8[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0040(0x0018)()
	bool                                          CallFunc_IsLockedByRequirement_ReturnValue;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_UpdateName) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_UpdateName");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_UpdateName) == 0x000060, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_UpdateName");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_GetOfferInfo_ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_GetItemTypeText_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_GetItemTypeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_GetName_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_IsUnique_ReturnValue) == 0x000038, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_IsUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_TextToUpper_ReturnValue) == 0x000040, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_IsLockedByRequirement_ReturnValue) == 0x000058, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_IsLockedByRequirement_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.UpdateShortDescription
// 0x0138 (0x0138 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_UpdateShortDescription final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FB9[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFirstGrantQuantity_ReturnValue;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FBA[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FBB[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue2;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLockedByRequirement_ReturnValue;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FBC[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetName_ReturnValue;                      // 0x0070(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0088(0x0040)(HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
