#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectatorHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.ExecuteUbergraph_AthenaSpectatorHUD
// 0x04A0 (0x04A0 - 0x0000)
struct AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPickerContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259E[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue3;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FFortPlayerDeathReport& DeathReport)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue4;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue5;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue6;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue7;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue8;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	EFortUIState                                  K2Node_Event_PreviousUIState;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259F[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget)> K2Node_CreateDelegate_OutputDelegate6;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bIsTargeting)>            K2Node_CreateDelegate_OutputDelegate7;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bIndicatorsEnabled)>      K2Node_CreateDelegate_OutputDelegate8;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UFortQuestItem*>                 K2Node_CustomEvent_Quests;                         // 0x00D8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A0[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue9;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortPickerMode Mode, int32 InitialOption, bool bIgnoreFirstAccept)> K2Node_CreateDelegate_OutputDelegate9;             // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A1[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_GetItemSmallPreviewImageBrush_ReturnValue; // 0x0128(0x0078)()
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x01A0(0x0018)()
	bool                                          K2Node_CustomEvent_UsingGamepad;                   // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A2[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01C0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0200(0x0010)(ZeroConstructor, ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A3[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0218(0x0018)()
	struct FFortDialogDescription                 K2Node_MakeStruct_FortDialogDescription;           // 0x0230(0x0150)(ContainsInstancedReference)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue10;                 // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_TriggerNotification*   CallFunc_TriggerNotification_ReturnValue;          // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A4[0x7];                                     // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_CustomEvent_FailedReason;                   // 0x0398(0x0020)()
	class FText                                   K2Node_CustomEvent_FailureText;                    // 0x03B8(0x0018)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A5[0x7];                                     // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTagContainer& FailedReason, class FText FailureText)> K2Node_CreateDelegate_OutputDelegate11;            // 0x03D8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A6[0x4];                                     // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPlayerDeathReport                 K2Node_CustomEvent_DeathReport;                    // 0x03F0(0x0050)(ConstParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A7[0x3];                                     // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x0448(0x0010)(ZeroConstructor, NoDestructor)
	class UWidget*                                K2Node_Event_Widget;                               // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContentPushState                      K2Node_Event_State;                                // 0x0460(0x0003)(NoDestructor)
	uint8                                         Pad_25A8[0x5];                                     // 0x0463(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<class UFortQuestItem*>& Quests)> K2Node_CreateDelegate_OutputDelegate13;            // 0x0468(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue11;                 // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue12;                 // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaPlayerViewModel*                 K2Node_Event_ViewModel;                            // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD) == 0x000010, "Wrong alignment on AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD");
static_assert(sizeof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD) == 0x0004A0, "Wrong size on AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, EntryPoint) == 0x000000, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, Temp_bool_Variable) == 0x000010, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, Temp_byte_Variable) == 0x000011, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, Temp_byte_Variable2) == 0x000012, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetContext_ReturnValue3) == 0x000020, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetContext_ReturnValue4) == 0x000038, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CreateDelegate_OutputDelegate2) == 0x000040, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetContext_ReturnValue5) == 0x000050, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetContext_ReturnValue6) == 0x000058, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CreateDelegate_OutputDelegate3) == 0x000060, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetContext_ReturnValue7) == 0x000070, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CreateDelegate_OutputDelegate4) == 0x000078, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetContext_ReturnValue8) == 0x000088, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetContext_ReturnValue8' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CreateDelegate_OutputDelegate5) == 0x000090, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_Event_PreviousUIState) == 0x0000A0, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_Event_PreviousUIState' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CreateDelegate_OutputDelegate6) == 0x0000A8, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CreateDelegate_OutputDelegate7) == 0x0000B8, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CreateDelegate_OutputDelegate8) == 0x0000C8, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CustomEvent_Quests) == 0x0000D8, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CustomEvent_Quests' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetContext_ReturnValue9) == 0x0000F0, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetContext_ReturnValue9' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CreateDelegate_OutputDelegate9) == 0x0000F8, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CreateDelegate_OutputDelegate10) == 0x000108, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, Temp_int_Array_Index_Variable) == 0x000118, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_Array_Get_Item) == 0x000120, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetItemSmallPreviewImageBrush_ReturnValue) == 0x000128, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetItemSmallPreviewImageBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetDisplayName_ReturnValue) == 0x0001A0, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CustomEvent_UsingGamepad) == 0x0001B8, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CustomEvent_UsingGamepad' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_MakeStruct_FormatArgumentData) == 0x0001C0, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_MakeArray_Array) == 0x000200, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_Select_Default) == 0x000210, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_Format_ReturnValue) == 0x000218, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_MakeStruct_FortDialogDescription) == 0x000230, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_MakeStruct_FortDialogDescription' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetContext_ReturnValue10) == 0x000380, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetContext_ReturnValue10' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_TriggerNotification_ReturnValue) == 0x000388, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_TriggerNotification_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_IsValid_ReturnValue) == 0x000390, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CustomEvent_FailedReason) == 0x000398, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CustomEvent_FailedReason' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CustomEvent_FailureText) == 0x0003B8, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CustomEvent_FailureText' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_HasTag_ReturnValue) == 0x0003D0, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CreateDelegate_OutputDelegate11) == 0x0003D8, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, Temp_int_Loop_Counter_Variable) == 0x0003E8, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CustomEvent_DeathReport) == 0x0003F0, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CustomEvent_DeathReport' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_Less_IntInt_ReturnValue) == 0x000440, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_Add_IntInt_ReturnValue) == 0x000444, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CreateDelegate_OutputDelegate12) == 0x000448, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_Event_Widget) == 0x000458, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_Event_State) == 0x000460, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_CreateDelegate_OutputDelegate13) == 0x000468, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetContext_ReturnValue11) == 0x000478, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetContext_ReturnValue11' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetContext_ReturnValue12) == 0x000480, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetContext_ReturnValue12' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, K2Node_Event_ViewModel) == 0x000488, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::K2Node_Event_ViewModel' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD, CallFunc_GetQuestManager_ReturnValue) == 0x000490, "Member 'AthenaSpectatorHUD_C_ExecuteUbergraph_AthenaSpectatorHUD::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.ViewModelChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaSpectatorHUD_C_ViewModelChanged final
{
public:
	class UAthenaPlayerViewModel*                 ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorHUD_C_ViewModelChanged) == 0x000008, "Wrong alignment on AthenaSpectatorHUD_C_ViewModelChanged");
static_assert(sizeof(AthenaSpectatorHUD_C_ViewModelChanged) == 0x000008, "Wrong size on AthenaSpectatorHUD_C_ViewModelChanged");
static_assert(offsetof(AthenaSpectatorHUD_C_ViewModelChanged, ViewModel) == 0x000000, "Member 'AthenaSpectatorHUD_C_ViewModelChanged::ViewModel' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.PushContentWidgetInternal
// 0x0010 (0x0010 - 0x0000)
struct AthenaSpectatorHUD_C_PushContentWidgetInternal final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContentPushState                      State;                                             // 0x0008(0x0003)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(AthenaSpectatorHUD_C_PushContentWidgetInternal) == 0x000008, "Wrong alignment on AthenaSpectatorHUD_C_PushContentWidgetInternal");
static_assert(sizeof(AthenaSpectatorHUD_C_PushContentWidgetInternal) == 0x000010, "Wrong size on AthenaSpectatorHUD_C_PushContentWidgetInternal");
static_assert(offsetof(AthenaSpectatorHUD_C_PushContentWidgetInternal, Widget) == 0x000000, "Member 'AthenaSpectatorHUD_C_PushContentWidgetInternal::Widget' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_PushContentWidgetInternal, State) == 0x000008, "Member 'AthenaSpectatorHUD_C_PushContentWidgetInternal::State' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.On Player Died
// 0x0050 (0x0050 - 0x0000)
struct AthenaSpectatorHUD_C_On_Player_Died final
{
public:
	struct FFortPlayerDeathReport                 DeathReport;                                       // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaSpectatorHUD_C_On_Player_Died) == 0x000008, "Wrong alignment on AthenaSpectatorHUD_C_On_Player_Died");
static_assert(sizeof(AthenaSpectatorHUD_C_On_Player_Died) == 0x000050, "Wrong size on AthenaSpectatorHUD_C_On_Player_Died");
static_assert(offsetof(AthenaSpectatorHUD_C_On_Player_Died, DeathReport) == 0x000000, "Member 'AthenaSpectatorHUD_C_On_Player_Died::DeathReport' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.OnUnableToPerformAction
// 0x0038 (0x0038 - 0x0000)
struct AthenaSpectatorHUD_C_OnUnableToPerformAction final
{
public:
	struct FGameplayTagContainer                  FailedReason;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   FailureText;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaSpectatorHUD_C_OnUnableToPerformAction) == 0x000008, "Wrong alignment on AthenaSpectatorHUD_C_OnUnableToPerformAction");
static_assert(sizeof(AthenaSpectatorHUD_C_OnUnableToPerformAction) == 0x000038, "Wrong size on AthenaSpectatorHUD_C_OnUnableToPerformAction");
static_assert(offsetof(AthenaSpectatorHUD_C_OnUnableToPerformAction, FailedReason) == 0x000000, "Member 'AthenaSpectatorHUD_C_OnUnableToPerformAction::FailedReason' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnUnableToPerformAction, FailureText) == 0x000020, "Member 'AthenaSpectatorHUD_C_OnUnableToPerformAction::FailureText' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.HandleInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpectatorHUD_C_HandleInputMethodChanged final
{
public:
	bool                                          UsingGamepad;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSpectatorHUD_C_HandleInputMethodChanged) == 0x000001, "Wrong alignment on AthenaSpectatorHUD_C_HandleInputMethodChanged");
static_assert(sizeof(AthenaSpectatorHUD_C_HandleInputMethodChanged) == 0x000001, "Wrong size on AthenaSpectatorHUD_C_HandleInputMethodChanged");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleInputMethodChanged, UsingGamepad) == 0x000000, "Member 'AthenaSpectatorHUD_C_HandleInputMethodChanged::UsingGamepad' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.QuestsCompleted
// 0x0010 (0x0010 - 0x0000)
struct AthenaSpectatorHUD_C_QuestsCompleted final
{
public:
	TArray<class UFortQuestItem*>                 Quests;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(AthenaSpectatorHUD_C_QuestsCompleted) == 0x000008, "Wrong alignment on AthenaSpectatorHUD_C_QuestsCompleted");
static_assert(sizeof(AthenaSpectatorHUD_C_QuestsCompleted) == 0x000010, "Wrong size on AthenaSpectatorHUD_C_QuestsCompleted");
static_assert(offsetof(AthenaSpectatorHUD_C_QuestsCompleted, Quests) == 0x000000, "Member 'AthenaSpectatorHUD_C_QuestsCompleted::Quests' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.OnEnterState
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpectatorHUD_C_OnEnterState final
{
public:
	EFortUIState                                  PreviousUIState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorHUD_C_OnEnterState) == 0x000001, "Wrong alignment on AthenaSpectatorHUD_C_OnEnterState");
static_assert(sizeof(AthenaSpectatorHUD_C_OnEnterState) == 0x000001, "Wrong size on AthenaSpectatorHUD_C_OnEnterState");
static_assert(offsetof(AthenaSpectatorHUD_C_OnEnterState, PreviousUIState) == 0x000000, "Member 'AthenaSpectatorHUD_C_OnEnterState::PreviousUIState' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.HandleCursorModeChanged
// 0x0050 (0x0050 - 0x0000)
struct AthenaSpectatorHUD_C_HandleCursorModeChanged final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CursorModeContentCustomWidget;                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25AA[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortInputMode                                Temp_byte_Variable3;                               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInputMode                                Temp_byte_Variable4;                               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortInputMode                                K2Node_Select_Default;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25AB[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue2;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25AC[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue3;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorHUD_C_HandleCursorModeChanged) == 0x000008, "Wrong alignment on AthenaSpectatorHUD_C_HandleCursorModeChanged");
static_assert(sizeof(AthenaSpectatorHUD_C_HandleCursorModeChanged) == 0x000050, "Wrong size on AthenaSpectatorHUD_C_HandleCursorModeChanged");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, IsEnabled) == 0x000000, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::IsEnabled' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, ActionName) == 0x000008, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::ActionName' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, CursorModeContentCustomWidget) == 0x000010, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::CursorModeContentCustomWidget' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, Temp_byte_Variable) == 0x000018, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, Temp_byte_Variable2) == 0x000019, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, Temp_bool_Variable) == 0x000028, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, Temp_byte_Variable3) == 0x000029, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, Temp_byte_Variable4) == 0x00002A, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, Temp_bool_Variable2) == 0x00002B, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, K2Node_Select_Default) == 0x00002C, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, CallFunc_GetContext_ReturnValue2) == 0x000030, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, CallFunc_GetInputManager_ReturnValue) == 0x000038, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, K2Node_Select2_Default) == 0x000040, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleCursorModeChanged, CallFunc_GetContext_ReturnValue3) == 0x000048, "Member 'AthenaSpectatorHUD_C_HandleCursorModeChanged::CallFunc_GetContext_ReturnValue3' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.OnHandleAction
// 0x0310 (0x0310 - 0x0000)
struct AthenaSpectatorHUD_C_OnHandleAction final
{
public:
	struct FEventReply                            Result;                                            // 0x0000(0x00B8)(Parm, OutParm)
	bool                                          bPassThrough;                                      // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HandleAction;                                      // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25AD[0x5];                                     // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldCloseMenuOnEscape_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25AE[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00D8(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25AF[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0198(0x00B8)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25B0[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_Select_Default;                             // 0x0258(0x00B8)()
};
static_assert(alignof(AthenaSpectatorHUD_C_OnHandleAction) == 0x000008, "Wrong alignment on AthenaSpectatorHUD_C_OnHandleAction");
static_assert(sizeof(AthenaSpectatorHUD_C_OnHandleAction) == 0x000310, "Wrong size on AthenaSpectatorHUD_C_OnHandleAction");
static_assert(offsetof(AthenaSpectatorHUD_C_OnHandleAction, Result) == 0x000000, "Member 'AthenaSpectatorHUD_C_OnHandleAction::Result' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnHandleAction, bPassThrough) == 0x0000B8, "Member 'AthenaSpectatorHUD_C_OnHandleAction::bPassThrough' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnHandleAction, HandleAction) == 0x0000B9, "Member 'AthenaSpectatorHUD_C_OnHandleAction::HandleAction' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnHandleAction, Temp_bool_Variable) == 0x0000BA, "Member 'AthenaSpectatorHUD_C_OnHandleAction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnHandleAction, CallFunc_GetContext_ReturnValue) == 0x0000C0, "Member 'AthenaSpectatorHUD_C_OnHandleAction::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnHandleAction, CallFunc_GetContext_ReturnValue2) == 0x0000C8, "Member 'AthenaSpectatorHUD_C_OnHandleAction::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnHandleAction, CallFunc_ShouldCloseMenuOnEscape_ReturnValue) == 0x0000D0, "Member 'AthenaSpectatorHUD_C_OnHandleAction::CallFunc_ShouldCloseMenuOnEscape_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnHandleAction, CallFunc_Handled_ReturnValue) == 0x0000D8, "Member 'AthenaSpectatorHUD_C_OnHandleAction::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnHandleAction, CallFunc_Not_PreBool_ReturnValue) == 0x000190, "Member 'AthenaSpectatorHUD_C_OnHandleAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnHandleAction, CallFunc_Unhandled_ReturnValue) == 0x000198, "Member 'AthenaSpectatorHUD_C_OnHandleAction::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnHandleAction, CallFunc_BooleanAND_ReturnValue) == 0x000250, "Member 'AthenaSpectatorHUD_C_OnHandleAction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnHandleAction, K2Node_Select_Default) == 0x000258, "Member 'AthenaSpectatorHUD_C_OnHandleAction::K2Node_Select_Default' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.OnPlayerTargetingChanged
// 0x0028 (0x0028 - 0x0000)
struct AthenaSpectatorHUD_C_OnPlayerTargetingChanged final
{
public:
	bool                                          IsTargeting;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25B1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            CallFunc_GetEquippedWeapon_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeaponRanged*                      K2Node_DynamicCast_AsFort_Weapon_Ranged;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSpectatorHUD_C_OnPlayerTargetingChanged) == 0x000008, "Wrong alignment on AthenaSpectatorHUD_C_OnPlayerTargetingChanged");
static_assert(sizeof(AthenaSpectatorHUD_C_OnPlayerTargetingChanged) == 0x000028, "Wrong size on AthenaSpectatorHUD_C_OnPlayerTargetingChanged");
static_assert(offsetof(AthenaSpectatorHUD_C_OnPlayerTargetingChanged, IsTargeting) == 0x000000, "Member 'AthenaSpectatorHUD_C_OnPlayerTargetingChanged::IsTargeting' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnPlayerTargetingChanged, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaSpectatorHUD_C_OnPlayerTargetingChanged::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnPlayerTargetingChanged, CallFunc_GetEquippedWeapon_ReturnValue) == 0x000010, "Member 'AthenaSpectatorHUD_C_OnPlayerTargetingChanged::CallFunc_GetEquippedWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnPlayerTargetingChanged, K2Node_DynamicCast_AsFort_Weapon_Ranged) == 0x000018, "Member 'AthenaSpectatorHUD_C_OnPlayerTargetingChanged::K2Node_DynamicCast_AsFort_Weapon_Ranged' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_OnPlayerTargetingChanged, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaSpectatorHUD_C_OnPlayerTargetingChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.HandleIndicatorModeChanged
// 0x0005 (0x0005 - 0x0000)
struct AthenaSpectatorHUD_C_HandleIndicatorModeChanged final
{
public:
	bool                                          InidicatorsEnabled;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorHUD_C_HandleIndicatorModeChanged) == 0x000001, "Wrong alignment on AthenaSpectatorHUD_C_HandleIndicatorModeChanged");
static_assert(sizeof(AthenaSpectatorHUD_C_HandleIndicatorModeChanged) == 0x000005, "Wrong size on AthenaSpectatorHUD_C_HandleIndicatorModeChanged");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleIndicatorModeChanged, InidicatorsEnabled) == 0x000000, "Member 'AthenaSpectatorHUD_C_HandleIndicatorModeChanged::InidicatorsEnabled' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleIndicatorModeChanged, Temp_bool_Variable) == 0x000001, "Member 'AthenaSpectatorHUD_C_HandleIndicatorModeChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleIndicatorModeChanged, Temp_byte_Variable) == 0x000002, "Member 'AthenaSpectatorHUD_C_HandleIndicatorModeChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleIndicatorModeChanged, Temp_byte_Variable2) == 0x000003, "Member 'AthenaSpectatorHUD_C_HandleIndicatorModeChanged::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_HandleIndicatorModeChanged, K2Node_Select_Default) == 0x000004, "Member 'AthenaSpectatorHUD_C_HandleIndicatorModeChanged::K2Node_Select_Default' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.SetPersistentHUDContentVisibility
// 0x0005 (0x0005 - 0x0000)
struct AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility) == 0x000001, "Wrong alignment on AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility");
static_assert(sizeof(AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility) == 0x000005, "Wrong size on AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility");
static_assert(offsetof(AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility, Visible) == 0x000000, "Member 'AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility::Visible' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility, Temp_bool_Variable) == 0x000001, "Member 'AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility, Temp_byte_Variable) == 0x000002, "Member 'AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility, Temp_byte_Variable2) == 0x000003, "Member 'AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility, K2Node_Select_Default) == 0x000004, "Member 'AthenaSpectatorHUD_C_SetPersistentHUDContentVisibility::K2Node_Select_Default' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.ToggleChat
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpectatorHUD_C_ToggleChat final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSpectatorHUD_C_ToggleChat) == 0x000001, "Wrong alignment on AthenaSpectatorHUD_C_ToggleChat");
static_assert(sizeof(AthenaSpectatorHUD_C_ToggleChat) == 0x000001, "Wrong size on AthenaSpectatorHUD_C_ToggleChat");
static_assert(offsetof(AthenaSpectatorHUD_C_ToggleChat, Show) == 0x000000, "Member 'AthenaSpectatorHUD_C_ToggleChat::Show' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.ToggleTopLevelMenu
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpectatorHUD_C_ToggleTopLevelMenu final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSpectatorHUD_C_ToggleTopLevelMenu) == 0x000001, "Wrong alignment on AthenaSpectatorHUD_C_ToggleTopLevelMenu");
static_assert(sizeof(AthenaSpectatorHUD_C_ToggleTopLevelMenu) == 0x000001, "Wrong size on AthenaSpectatorHUD_C_ToggleTopLevelMenu");
static_assert(offsetof(AthenaSpectatorHUD_C_ToggleTopLevelMenu, Show) == 0x000000, "Member 'AthenaSpectatorHUD_C_ToggleTopLevelMenu::Show' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.ShowPicker
// 0x000C (0x000C - 0x0000)
struct AthenaSpectatorHUD_C_ShowPicker final
{
public:
	EFortPickerMode                               Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B2[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InitialOption;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreFirstAccept;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSpectatorHUD_C_ShowPicker) == 0x000004, "Wrong alignment on AthenaSpectatorHUD_C_ShowPicker");
static_assert(sizeof(AthenaSpectatorHUD_C_ShowPicker) == 0x00000C, "Wrong size on AthenaSpectatorHUD_C_ShowPicker");
static_assert(offsetof(AthenaSpectatorHUD_C_ShowPicker, Mode) == 0x000000, "Member 'AthenaSpectatorHUD_C_ShowPicker::Mode' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ShowPicker, InitialOption) == 0x000004, "Member 'AthenaSpectatorHUD_C_ShowPicker::InitialOption' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ShowPicker, IgnoreFirstAccept) == 0x000008, "Member 'AthenaSpectatorHUD_C_ShowPicker::IgnoreFirstAccept' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ShowPicker, CallFunc_GetVisibility_ReturnValue) == 0x000009, "Member 'AthenaSpectatorHUD_C_ShowPicker::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_ShowPicker, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'AthenaSpectatorHUD_C_ShowPicker::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.PopContentWidgetInternal
// 0x0018 (0x0018 - 0x0000)
struct AthenaSpectatorHUD_C_PopContentWidgetInternal final
{
public:
	struct FContentPushState                      State;                                             // 0x0000(0x0003)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_25B3[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_PopMenuContent_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorHUD_C_PopContentWidgetInternal) == 0x000008, "Wrong alignment on AthenaSpectatorHUD_C_PopContentWidgetInternal");
static_assert(sizeof(AthenaSpectatorHUD_C_PopContentWidgetInternal) == 0x000018, "Wrong size on AthenaSpectatorHUD_C_PopContentWidgetInternal");
static_assert(offsetof(AthenaSpectatorHUD_C_PopContentWidgetInternal, State) == 0x000000, "Member 'AthenaSpectatorHUD_C_PopContentWidgetInternal::State' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_PopContentWidgetInternal, ReturnValue) == 0x000008, "Member 'AthenaSpectatorHUD_C_PopContentWidgetInternal::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorHUD_C_PopContentWidgetInternal, CallFunc_PopMenuContent_ReturnValue) == 0x000010, "Member 'AthenaSpectatorHUD_C_PopContentWidgetInternal::CallFunc_PopMenuContent_ReturnValue' has a wrong offset!");

// Function AthenaSpectatorHUD.AthenaSpectatorHUD_C.CheckHUDElementVisibility
// 0x0058 (0x0058 - 0x0000)
struct AthenaSpectatorHUD_C_CheckHUDElementVisibility final
{
public:
	struct FGameplayTagContainer                  HiddenHUDElementTags;                              // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           HUDElementTagToCheck;                              // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                HUDElement;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0030(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSpectatorHUD_C_CheckHUDElementVisibility) == 0x000008, "Wrong alignment on AthenaSpectatorHUD_C_CheckHUDElementVisibility");
static_assert(sizeof(AthenaSpectatorHUD_C_CheckHUDElementVisibility) == 0x000058, "Wrong size on AthenaSpectatorHUD_C_CheckHUDElementVisibility");
static_assert(offsetof(AthenaSpectatorHUD_C_CheckHUDElementVisibility, HiddenHUDElementTags) == 0x000000, "Member 'AthenaSpectatorHUD_C_CheckHUDElementVisibility::HiddenHUDElementTags' has a wrong offset!");
