#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaPickupManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaPickupManager.AthenaPickupManager_C.ExecuteUbergraph_AthenaPickupManager
// 0x00B0 (0x00B0 - 0x0000)
struct AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3580[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItem*                         K2Node_CustomEvent_NewItem;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Count;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3581[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFortWorldItem* NewItem, int32 Count)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UFortWorldItem*>                 K2Node_CustomEvent_ItemsAdded;                     // 0x0028(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class UFortWorldItem*>                 K2Node_CustomEvent_ItemsRemoved;                   // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<class UFortWorldItem*>& ItemsAdded, TArray<class UFortWorldItem*>& ItemsRemoved)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue2;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue3;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue4;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue5;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager) == 0x000008, "Wrong alignment on AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager");
static_assert(sizeof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager) == 0x0000B0, "Wrong size on AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, EntryPoint) == 0x000000, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CustomEvent_NewItem) == 0x000008, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CustomEvent_NewItem' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CustomEvent_Count) == 0x000010, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CustomEvent_Count' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CustomEvent_ItemsAdded) == 0x000028, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CustomEvent_ItemsAdded' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CustomEvent_ItemsRemoved) == 0x000038, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CustomEvent_ItemsRemoved' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CreateDelegate_OutputDelegate2) == 0x000048, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CreateDelegate_OutputDelegate3) == 0x000058, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CreateDelegate_OutputDelegate4) == 0x000068, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, CallFunc_GetContext_ReturnValue) == 0x000078, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, CallFunc_GetContext_ReturnValue2) == 0x000080, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, CallFunc_GetContext_ReturnValue3) == 0x000088, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, CallFunc_GetContext_ReturnValue4) == 0x000090, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CreateDelegate_OutputDelegate5) == 0x000098, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, CallFunc_GetContext_ReturnValue5) == 0x0000A8, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::CallFunc_GetContext_ReturnValue5' has a wrong offset!");

// Function AthenaPickupManager.AthenaPickupManager_C.HandleItemPickup
// 0x0010 (0x0010 - 0x0000)
struct AthenaPickupManager_C_HandleItemPickup final
{
public:
	class UFortWorldItem*                         NewItem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaPickupManager_C_HandleItemPickup) == 0x000008, "Wrong alignment on AthenaPickupManager_C_HandleItemPickup");
static_assert(sizeof(AthenaPickupManager_C_HandleItemPickup) == 0x000010, "Wrong size on AthenaPickupManager_C_HandleItemPickup");
static_assert(offsetof(AthenaPickupManager_C_HandleItemPickup, NewItem) == 0x000000, "Member 'AthenaPickupManager_C_HandleItemPickup::NewItem' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleItemPickup, Count) == 0x000008, "Member 'AthenaPickupManager_C_HandleItemPickup::Count' has a wrong offset!");

// Function AthenaPickupManager.AthenaPickupManager_C.HandleWorldItemListChanged
// 0x0020 (0x0020 - 0x0000)
struct AthenaPickupManager_C_HandleWorldItemListChanged final
{
public:
	TArray<class UFortWorldItem*>                 ItemsAdded;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UFortWorldItem*>                 ItemsRemoved;                                      // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(AthenaPickupManager_C_HandleWorldItemListChanged) == 0x000008, "Wrong alignment on AthenaPickupManager_C_HandleWorldItemListChanged");
static_assert(sizeof(AthenaPickupManager_C_HandleWorldItemListChanged) == 0x000020, "Wrong size on AthenaPickupManager_C_HandleWorldItemListChanged");
static_assert(offsetof(AthenaPickupManager_C_HandleWorldItemListChanged, ItemsAdded) == 0x000000, "Member 'AthenaPickupManager_C_HandleWorldItemListChanged::ItemsAdded' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleWorldItemListChanged, ItemsRemoved) == 0x000010, "Member 'AthenaPickupManager_C_HandleWorldItemListChanged::ItemsRemoved' has a wrong offset!");

// Function AthenaPickupManager.AthenaPickupManager_C.RefreshCounts
// 0x000C (0x000C - 0x0000)
struct AthenaPickupManager_C_RefreshCounts final
{
public:
	float                                         CurrentUpdateTime;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3582[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaPickupManager_C_RefreshCounts) == 0x000004, "Wrong alignment on AthenaPickupManager_C_RefreshCounts");
static_assert(sizeof(AthenaPickupManager_C_RefreshCounts) == 0x00000C, "Wrong size on AthenaPickupManager_C_RefreshCounts");
static_assert(offsetof(AthenaPickupManager_C_RefreshCounts, CurrentUpdateTime) == 0x000000, "Member 'AthenaPickupManager_C_RefreshCounts::CurrentUpdateTime' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_RefreshCounts, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'AthenaPickupManager_C_RefreshCounts::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_RefreshCounts, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000008, "Member 'AthenaPickupManager_C_RefreshCounts::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");

}

