#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionScreen

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaDirectAcquisitionScreen.AthenaDirectAcquisitionScreen_C.ExecuteUbergraph_AthenaDirectAcquisitionScreen
// 0x0028 (0x0028 - 0x0000)
struct AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetWeeklyStoreEndDate_ReturnValue;        // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetDailyStoreEndDate_ReturnValue;         // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen");
static_assert(sizeof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen) == 0x000028, "Wrong size on AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen, EntryPoint) == 0x000000, "Member 'AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen, CallFunc_IsActivated_ReturnValue) == 0x000004, "Member 'AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen, CallFunc_GetWeeklyStoreEndDate_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen::CallFunc_GetWeeklyStoreEndDate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen, CallFunc_GetDailyStoreEndDate_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen::CallFunc_GetDailyStoreEndDate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen, CallFunc_GetContext_ReturnValue2) == 0x000020, "Member 'AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen::CallFunc_GetContext_ReturnValue2' has a wrong offset!");

// Function AthenaDirectAcquisitionScreen.AthenaDirectAcquisitionScreen_C.GenerateOfferWidget
// 0x0098 (0x0098 - 0x0000)
struct AthenaDirectAcquisitionScreen_C_GenerateOfferWidget final
{
public:
	class UFortDirectAcquisitionOfferInfo*        OfferData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetFortStoreOfferCategory_ReturnValue;    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetStorefrontName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315C[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaDirectAcquisitionOfferWidget_C*  CallFunc_Map_Find_Value;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315D[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315E[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315F[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue2;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3160[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionOfferWidget_C*  CallFunc_Create_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionScreen_C_GenerateOfferWidget");
static_assert(sizeof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget) == 0x000098, "Wrong size on AthenaDirectAcquisitionScreen_C_GenerateOfferWidget");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, OfferData) == 0x000000, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::OfferData' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_GetFortStoreOfferCategory_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_GetFortStoreOfferCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_GetStorefrontName_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_GetStorefrontName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Map_Find_Value) == 0x000028, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Map_Find_ReturnValue) == 0x000030, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Array_Get_Item) == 0x000038, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Conv_StringToName_ReturnValue) == 0x000048, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000050, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_GetChildrenCount_ReturnValue) == 0x000054, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000058, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00005C, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x00005D, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Percent_IntInt_ReturnValue) == 0x000060, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Divide_IntInt_ReturnValue) == 0x000064, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_SelectInt_ReturnValue) == 0x000068, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_SelectInt_ReturnValue2) == 0x00006C, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_SelectInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000078, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Create_ReturnValue) == 0x000080, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_AddChildToGrid_ReturnValue) == 0x000088, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000090, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionScreen.AthenaDirectAcquisitionScreen_C.Focus
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionScreen_C_Focus final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionScreen_C_Focus) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionScreen_C_Focus");
static_assert(sizeof(AthenaDirectAcquisitionScreen_C_Focus) == 0x000008, "Wrong size on AthenaDirectAcquisitionScreen_C_Focus");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_Focus, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionScreen_C_Focus::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

}

