#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSquadList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaSquadList.AthenaSquadList_C.ExecuteUbergraph_AthenaSquadList
// 0x00A0 (0x00A0 - 0x0000)
struct AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35FC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35FD[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35FE[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35FF[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3600[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3601[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3602[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item2;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3603[0x2];                                     // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList) == 0x000008, "Wrong alignment on AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList");
static_assert(sizeof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList) == 0x0000A0, "Wrong size on AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, EntryPoint) == 0x000000, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, Temp_int_Loop_Counter_Variable2) == 0x00002C, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_Add_IntInt_ReturnValue2) == 0x000030, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, Temp_int_Array_Index_Variable) == 0x000034, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, Temp_int_Array_Index_Variable2) == 0x000038, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_Create_ReturnValue) == 0x000040, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, K2Node_Event_IsDesignTime) == 0x000048, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_AddChild_ReturnValue) == 0x000050, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000060, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_Array_Get_Item) == 0x000070, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, Temp_int_Variable) == 0x000080, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_Array_Get_Item2) == 0x000088, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000091, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_Add_IntInt_ReturnValue3) == 0x000094, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_Array_Length_ReturnValue2) == 0x000098, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_Less_IntInt_ReturnValue2) == 0x00009C, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");

// Function AthenaSquadList.AthenaSquadList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaSquadList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSquadList_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaSquadList_C_PreConstruct");
static_assert(sizeof(AthenaSquadList_C_PreConstruct) == 0x000001, "Wrong size on AthenaSquadList_C_PreConstruct");
static_assert(offsetof(AthenaSquadList_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaSquadList_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaSquadList.AthenaSquadList_C.AppendSquadMember
// 0x0040 (0x0040 - 0x0000)
struct AthenaSquadList_C_AppendSquadMember final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3604[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaTeamMemberInfo_C*                CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3605[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSquadList_C_AppendSquadMember) == 0x000008, "Wrong alignment on AthenaSquadList_C_AppendSquadMember");
static_assert(sizeof(AthenaSquadList_C_AppendSquadMember) == 0x000040, "Wrong size on AthenaSquadList_C_AppendSquadMember");
static_assert(offsetof(AthenaSquadList_C_AppendSquadMember, PlayerState) == 0x000000, "Member 'AthenaSquadList_C_AppendSquadMember::PlayerState' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_AppendSquadMember, PlayerIndex) == 0x000008, "Member 'AthenaSquadList_C_AppendSquadMember::PlayerIndex' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_AppendSquadMember, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'AthenaSquadList_C_AppendSquadMember::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_AppendSquadMember, CallFunc_Create_ReturnValue) == 0x000018, "Member 'AthenaSquadList_C_AppendSquadMember::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_AppendSquadMember, K2Node_MakeStruct_Margin) == 0x000020, "Member 'AthenaSquadList_C_AppendSquadMember::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_AppendSquadMember, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'AthenaSquadList_C_AppendSquadMember::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_AppendSquadMember, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000038, "Member 'AthenaSquadList_C_AppendSquadMember::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function AthenaSquadList.AthenaSquadList_C.HandleSquadMembersChanged
// 0x0038 (0x0038 - 0x0000)
struct AthenaSquadList_C_HandleSquadMembersChanged final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3606[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3607[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSquadList_C_HandleSquadMembersChanged) == 0x000008, "Wrong alignment on AthenaSquadList_C_HandleSquadMembersChanged");
static_assert(sizeof(AthenaSquadList_C_HandleSquadMembersChanged) == 0x000038, "Wrong size on AthenaSquadList_C_HandleSquadMembersChanged");
static_assert(offsetof(AthenaSquadList_C_HandleSquadMembersChanged, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaSquadList_C_HandleSquadMembersChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_HandleSquadMembersChanged, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaSquadList_C_HandleSquadMembersChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_HandleSquadMembersChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSquadList_C_HandleSquadMembersChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_HandleSquadMembersChanged, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'AthenaSquadList_C_HandleSquadMembersChanged::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_HandleSquadMembersChanged, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000018, "Member 'AthenaSquadList_C_HandleSquadMembersChanged::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_HandleSquadMembersChanged, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaSquadList_C_HandleSquadMembersChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_HandleSquadMembersChanged, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'AthenaSquadList_C_HandleSquadMembersChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_HandleSquadMembersChanged, CallFunc_Array_Get_Item) == 0x000028, "Member 'AthenaSquadList_C_HandleSquadMembersChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_HandleSquadMembersChanged, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'AthenaSquadList_C_HandleSquadMembersChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaSquadList.AthenaSquadList_C.ClearSquadMembers
// 0x0020 (0x0020 - 0x0000)
struct AthenaSquadList_C_ClearSquadMembers final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3608[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSquadList_C_ClearSquadMembers) == 0x000008, "Wrong alignment on AthenaSquadList_C_ClearSquadMembers");
static_assert(sizeof(AthenaSquadList_C_ClearSquadMembers) == 0x000020, "Wrong size on AthenaSquadList_C_ClearSquadMembers");
static_assert(offsetof(AthenaSquadList_C_ClearSquadMembers, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaSquadList_C_ClearSquadMembers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ClearSquadMembers, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaSquadList_C_ClearSquadMembers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ClearSquadMembers, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSquadList_C_ClearSquadMembers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ClearSquadMembers, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaSquadList_C_ClearSquadMembers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ClearSquadMembers, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'AthenaSquadList_C_ClearSquadMembers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ClearSquadMembers, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaSquadList_C_ClearSquadMembers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

