#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTabsScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaTabsScreen.AthenaTabsScreen_C.ExecuteUbergraph_AthenaTabsScreen
// 0x0208 (0x0208 - 0x0000)
struct AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24BE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           CallFunc_GetFeatureState_OutFeatureState;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     CallFunc_GetFeatureState_OutReason;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24BF[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_CustomEvent_TabId;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUserWidget*                      K2Node_CustomEvent_TabWidget;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStoreMain_Root_C*                      K2Node_DynamicCast_AsStore_Main_Root;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C0[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C1[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTabListRegistrationInfo           CallFunc_GetPreregisteredTabInfo_OutTabInfo;       // 0x0068(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_GetPreregisteredTabInfo_ReturnValue;      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C2[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalTabList_C*                   K2Node_DynamicCast_AsHorizontal_Tab_List;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C3[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalTabList_C*                   K2Node_DynamicCast_AsHorizontal_Tab_List2;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C4[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId2;                 // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTabButton_C*                       K2Node_DynamicCast_AsIcon_Tab_Button;              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C5[0x6];                                     // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue2;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName TabId, class UCommonUserWidget* TabWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C6[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x018C(0x0010)(NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin2;                         // 0x019C(0x0010)(NoDestructor)
	uint8                                         Pad_24C7[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01B8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x01E0(0x0028)()
};
static_assert(alignof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen) == 0x000008, "Wrong alignment on AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen");
static_assert(sizeof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen) == 0x000208, "Wrong size on AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, EntryPoint) == 0x000000, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, CallFunc_GetFeatureState_OutFeatureState) == 0x000010, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::CallFunc_GetFeatureState_OutFeatureState' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, CallFunc_GetFeatureState_OutReason) == 0x000011, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::CallFunc_GetFeatureState_OutReason' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_MakeArray_Array) == 0x000018, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_CustomEvent_TabId) == 0x000028, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_CustomEvent_TabId' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_CustomEvent_TabWidget) == 0x000030, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_CustomEvent_TabWidget' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_ComponentBoundEvent_TabId) == 0x000038, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_DynamicCast_AsStore_Main_Root) == 0x000040, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_DynamicCast_AsStore_Main_Root' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000049, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_ComponentBoundEvent_Button2) == 0x000050, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_ComponentBoundEvent_Button) == 0x000060, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, CallFunc_GetPreregisteredTabInfo_OutTabInfo) == 0x000068, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::CallFunc_GetPreregisteredTabInfo_OutTabInfo' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, CallFunc_GetPreregisteredTabInfo_ReturnValue) == 0x000120, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::CallFunc_GetPreregisteredTabInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_DynamicCast_AsHorizontal_Tab_List) == 0x000128, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_DynamicCast_AsHorizontal_Tab_List' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_DynamicCast_bSuccess2) == 0x000130, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_DynamicCast_AsHorizontal_Tab_List2) == 0x000138, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_DynamicCast_AsHorizontal_Tab_List2' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_DynamicCast_bSuccess3) == 0x000140, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_ComponentBoundEvent_TabId2) == 0x000148, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_ComponentBoundEvent_TabId2' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_ComponentBoundEvent_TabButton) == 0x000150, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_DynamicCast_AsIcon_Tab_Button) == 0x000158, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_DynamicCast_AsIcon_Tab_Button' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_DynamicCast_bSuccess4) == 0x000160, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_Event_IsDesignTime) == 0x000161, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000168, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue2) == 0x000170, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000178, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, CallFunc_IsValid_ReturnValue2) == 0x000188, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_MakeStruct_Margin) == 0x00018C, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_MakeStruct_Margin2) == 0x00019C, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_MakeStruct_Margin2' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x0001B0, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_MakeStruct_SlateColor) == 0x0001B8, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen, K2Node_MakeStruct_SlateColor2) == 0x0001E0, "Member 'AthenaTabsScreen_C_ExecuteUbergraph_AthenaTabsScreen::K2Node_MakeStruct_SlateColor2' has a wrong offset!");

// Function AthenaTabsScreen.AthenaTabsScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaTabsScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTabsScreen_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaTabsScreen_C_PreConstruct");
static_assert(sizeof(AthenaTabsScreen_C_PreConstruct) == 0x000001, "Wrong size on AthenaTabsScreen_C_PreConstruct");
static_assert(offsetof(AthenaTabsScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaTabsScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaTabsScreen.AthenaTabsScreen_C.BndEvt__Social_K2Node_ComponentBoundEvent_89_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaTabsScreen_C_BndEvt__Social_K2Node_ComponentBoundEvent_89_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTabsScreen_C_BndEvt__Social_K2Node_ComponentBoundEvent_89_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaTabsScreen_C_BndEvt__Social_K2Node_ComponentBoundEvent_89_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaTabsScreen_C_BndEvt__Social_K2Node_ComponentBoundEvent_89_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaTabsScreen_C_BndEvt__Social_K2Node_ComponentBoundEvent_89_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaTabsScreen_C_BndEvt__Social_K2Node_ComponentBoundEvent_89_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaTabsScreen_C_BndEvt__Social_K2Node_ComponentBoundEvent_89_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaTabsScreen.AthenaTabsScreen_C.BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaTabsScreen_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTabsScreen_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaTabsScreen_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaTabsScreen_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaTabsScreen_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaTabsScreen_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaTabsScreen_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaTabsScreen.AthenaTabsScreen_C.HandleTabContentCreated
// 0x0010 (0x0010 - 0x0000)
struct AthenaTabsScreen_C_HandleTabContentCreated final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUserWidget*                      TabWidget;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTabsScreen_C_HandleTabContentCreated) == 0x000008, "Wrong alignment on AthenaTabsScreen_C_HandleTabContentCreated");
static_assert(sizeof(AthenaTabsScreen_C_HandleTabContentCreated) == 0x000010, "Wrong size on AthenaTabsScreen_C_HandleTabContentCreated");
static_assert(offsetof(AthenaTabsScreen_C_HandleTabContentCreated, TabId) == 0x000000, "Member 'AthenaTabsScreen_C_HandleTabContentCreated::TabId' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_HandleTabContentCreated, TabWidget) == 0x000008, "Member 'AthenaTabsScreen_C_HandleTabContentCreated::TabWidget' has a wrong offset!");

// Function AthenaTabsScreen.AthenaTabsScreen_C.BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature) == 0x000008, "Wrong alignment on AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature");
static_assert(sizeof(AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature) == 0x000008, "Wrong size on AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature");
static_assert(offsetof(AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature, TabId) == 0x000000, "Member 'AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature::TabId' has a wrong offset!");

// Function AthenaTabsScreen.AthenaTabsScreen_C.BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'AthenaTabsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function AthenaTabsScreen.AthenaTabsScreen_C.HandleTabCreated
// 0x0040 (0x0040 - 0x0000)
struct AthenaTabsScreen_C_HandleTabCreated final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTabButton_C*                       K2Node_DynamicCast_AsIcon_Tab_Button;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C8[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0020(0x0018)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTabsScreen_C_HandleTabCreated) == 0x000008, "Wrong alignment on AthenaTabsScreen_C_HandleTabCreated");
static_assert(sizeof(AthenaTabsScreen_C_HandleTabCreated) == 0x000040, "Wrong size on AthenaTabsScreen_C_HandleTabCreated");
static_assert(offsetof(AthenaTabsScreen_C_HandleTabCreated, TabId) == 0x000000, "Member 'AthenaTabsScreen_C_HandleTabCreated::TabId' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_HandleTabCreated, TabButton) == 0x000008, "Member 'AthenaTabsScreen_C_HandleTabCreated::TabButton' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_HandleTabCreated, K2Node_DynamicCast_AsIcon_Tab_Button) == 0x000010, "Member 'AthenaTabsScreen_C_HandleTabCreated::K2Node_DynamicCast_AsIcon_Tab_Button' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_HandleTabCreated, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaTabsScreen_C_HandleTabCreated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_HandleTabCreated, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000019, "Member 'AthenaTabsScreen_C_HandleTabCreated::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_HandleTabCreated, CallFunc_TextToUpper_ReturnValue) == 0x000020, "Member 'AthenaTabsScreen_C_HandleTabCreated::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_HandleTabCreated, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x000038, "Member 'AthenaTabsScreen_C_HandleTabCreated::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");

// Function AthenaTabsScreen.AthenaTabsScreen_C.HandleTabSelected
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) AthenaTabsScreen_C_HandleTabSelected final
{
public:
	class FName                                   TabName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveTab_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTabsScreen_C_HandleTabSelected) == 0x000008, "Wrong alignment on AthenaTabsScreen_C_HandleTabSelected");
static_assert(sizeof(AthenaTabsScreen_C_HandleTabSelected) == 0x000010, "Wrong size on AthenaTabsScreen_C_HandleTabSelected");
static_assert(offsetof(AthenaTabsScreen_C_HandleTabSelected, TabName) == 0x000000, "Member 'AthenaTabsScreen_C_HandleTabSelected::TabName' has a wrong offset!");
static_assert(offsetof(AthenaTabsScreen_C_HandleTabSelected, CallFunc_GetActiveTab_ReturnValue) == 0x000008, "Member 'AthenaTabsScreen_C_HandleTabSelected::CallFunc_GetActiveTab_ReturnValue' has a wrong offset!");

// Function AthenaTabsScreen.AthenaTabsScreen_C.SetTopBar
// 0x0008 (0x0008 - 0x0000)
struct AthenaTabsScreen_C_SetTopBar final
{
public:
	class UTopBar_C*                              InTopbar;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTabsScreen_C_SetTopBar) == 0x000008, "Wrong alignment on AthenaTabsScreen_C_SetTopBar");
static_assert(sizeof(AthenaTabsScreen_C_SetTopBar) == 0x000008, "Wrong size on AthenaTabsScreen_C_SetTopBar");
static_assert(offsetof(AthenaTabsScreen_C_SetTopBar, InTopbar) == 0x000000, "Member 'AthenaTabsScreen_C_SetTopBar::InTopbar' has a wrong offset!");

}

