#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonTab.AthenaSeasonTab_C
// 0x0120 (0x0700 - 0x05E0)
class UAthenaSeasonTab_C final : public USeasonPassScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(Transient, DuplicateTransient)
	class UAthenaSeasonBPTrackerWidget_C*         AthenaSeasonBPTrackerWidget;                       // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundGradient;                                // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Border_SaleInfo;                                   // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrentPageNumber;                                 // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ItemName;                                          // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ItemType;                                          // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  LevelPageWidgetSwitcher;                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainViewItemInfoOverlay;                           // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MainViewItemInfoVB;                                // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PageLeftBtn;                                       // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PageRightBtn;                                      // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PassCompleted;                                     // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PassNotOwned;                                      // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PassOwned;                                         // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PurchaseBattlePassText;                            // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PurchaseLevelBtn;                                  // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PurchaseLevelDescription;                          // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PurchaseSeasonBtn;                                 // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityGlow;                                        // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rule;                                              // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonDateTimeTextBlock*               SeasonCountdown;                                   // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SeasonHeadingTextLabel;                            // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SeasonPassOwnedSwitcher;                           // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescription;                                  // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_ExclusiveText;                                   // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TotalPageNumber;                                   // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UFortCompendiumBundleDefinition*> UnlockableBundles;                                 // 0x06B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UFortCompendiumBundle*>          ActiveBundles;                                     // 0x06C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   LastActiveTab;                                     // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonPageWidget_C*              CurrentPage;                                       // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferInfo*        SeasonCatalogOffer;                                // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             BattlePointsCurrency;                              // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoNotNavigateToFirstLevel;                         // 0x06F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaSeasonTab(int32 EntryPoint);
	void UpdateStoreHasStarsNotification(bool bShowNotification);
	void ScrollNegative();
	void ScrollPositive();
	void NoOffersAvailable();
	void BndEvt__PurchaseLevelBtn_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__LevelPageWidgetSwitcher_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void HandlePageRight();
	void HandlePageLeft();
	void BndEvt__PageRightBtn_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnLevelsGenerated();
	void BndEvt__PurchaseSeasonBtn_K2Node_ComponentBoundEvent_61_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnSeasonPassChanged();
	void GenerateOfferWidget(class UFortDirectAcquisitionOfferInfo* OfferData);
	void OnOffersGenerated();
	void OnStartReadingOffers();
	void OnNavigateToLevel(int32 Level);
	void OnDeactivated();
	void OnActivated();
	void Construct();
	TArray<class USeasonPassLevelWidget*> GenerateLevelWidgets(class UFortSeasonPassLevelInfo* LevelInfo);
	void SelectPageByLevel(int32 TargetLevel);
	void SetupViewedItemData(class UFortItem* Item);
	void UpdateSeasonPurchaseState();
	void UpdatePageCount();
	void SetupViewedItemName(class UFortItem* Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonTab_C">();
	}
	static class UAthenaSeasonTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonTab_C>();
	}
};
static_assert(alignof(UAthenaSeasonTab_C) == 0x000010, "Wrong alignment on UAthenaSeasonTab_C");
static_assert(sizeof(UAthenaSeasonTab_C) == 0x000700, "Wrong size on UAthenaSeasonTab_C");
static_assert(offsetof(UAthenaSeasonTab_C, UberGraphFrame) == 0x0005E0, "Member 'UAthenaSeasonTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, AthenaSeasonBPTrackerWidget) == 0x0005E8, "Member 'UAthenaSeasonTab_C::AthenaSeasonBPTrackerWidget' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, BackgroundGradient) == 0x0005F0, "Member 'UAthenaSeasonTab_C::BackgroundGradient' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, Border_SaleInfo) == 0x0005F8, "Member 'UAthenaSeasonTab_C::Border_SaleInfo' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, CurrentPageNumber) == 0x000600, "Member 'UAthenaSeasonTab_C::CurrentPageNumber' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, ItemName) == 0x000608, "Member 'UAthenaSeasonTab_C::ItemName' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, ItemType) == 0x000610, "Member 'UAthenaSeasonTab_C::ItemType' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, LevelPageWidgetSwitcher) == 0x000618, "Member 'UAthenaSeasonTab_C::LevelPageWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, MainViewItemInfoOverlay) == 0x000620, "Member 'UAthenaSeasonTab_C::MainViewItemInfoOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, MainViewItemInfoVB) == 0x000628, "Member 'UAthenaSeasonTab_C::MainViewItemInfoVB' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PageLeftBtn) == 0x000630, "Member 'UAthenaSeasonTab_C::PageLeftBtn' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PageRightBtn) == 0x000638, "Member 'UAthenaSeasonTab_C::PageRightBtn' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PassCompleted) == 0x000640, "Member 'UAthenaSeasonTab_C::PassCompleted' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PassNotOwned) == 0x000648, "Member 'UAthenaSeasonTab_C::PassNotOwned' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PassOwned) == 0x000650, "Member 'UAthenaSeasonTab_C::PassOwned' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PurchaseBattlePassText) == 0x000658, "Member 'UAthenaSeasonTab_C::PurchaseBattlePassText' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PurchaseLevelBtn) == 0x000660, "Member 'UAthenaSeasonTab_C::PurchaseLevelBtn' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PurchaseLevelDescription) == 0x000668, "Member 'UAthenaSeasonTab_C::PurchaseLevelDescription' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PurchaseSeasonBtn) == 0x000670, "Member 'UAthenaSeasonTab_C::PurchaseSeasonBtn' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, RarityGlow) == 0x000678, "Member 'UAthenaSeasonTab_C::RarityGlow' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, Rule) == 0x000680, "Member 'UAthenaSeasonTab_C::Rule' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, SeasonCountdown) == 0x000688, "Member 'UAthenaSeasonTab_C::SeasonCountdown' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, SeasonHeadingTextLabel) == 0x000690, "Member 'UAthenaSeasonTab_C::SeasonHeadingTextLabel' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, SeasonPassOwnedSwitcher) == 0x000698, "Member 'UAthenaSeasonTab_C::SeasonPassOwnedSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, ShortDescription) == 0x0006A0, "Member 'UAthenaSeasonTab_C::ShortDescription' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, T_ExclusiveText) == 0x0006A8, "Member 'UAthenaSeasonTab_C::T_ExclusiveText' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, TotalPageNumber) == 0x0006B0, "Member 'UAthenaSeasonTab_C::TotalPageNumber' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, UnlockableBundles) == 0x0006B8, "Member 'UAthenaSeasonTab_C::UnlockableBundles' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, ActiveBundles) == 0x0006C8, "Member 'UAthenaSeasonTab_C::ActiveBundles' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, LastActiveTab) == 0x0006D8, "Member 'UAthenaSeasonTab_C::LastActiveTab' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, CurrentPage) == 0x0006E0, "Member 'UAthenaSeasonTab_C::CurrentPage' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, SeasonCatalogOffer) == 0x0006E8, "Member 'UAthenaSeasonTab_C::SeasonCatalogOffer' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, BattlePointsCurrency) == 0x0006F0, "Member 'UAthenaSeasonTab_C::BattlePointsCurrency' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, DoNotNavigateToFirstLevel) == 0x0006F8, "Member 'UAthenaSeasonTab_C::DoNotNavigateToFirstLevel' has a wrong offset!");

}

