#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pickups

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Pickups.B_Pickups_C.ExecuteUbergraph_B_Pickups
// 0x0450 (0x0450 - 0x0000)
struct B_Pickups_C_ExecuteUbergraph_B_Pickups final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3746[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3747[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable3;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3748[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_PickupTarget;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3749[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_374A[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_374B[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable4;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_374C[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374D[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue2;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374E[0x1];                                     // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x008C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPickupStretchMIDFromPool_bNeedsToBeInitialized; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_374F[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetPickupStretchMIDFromPool_ReturnValue;  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3750[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable5;                              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortResourceItemDefinition*            K2Node_DynamicCast_AsFort_Resource_Item_Definition; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      Temp_byte_Variable;                                // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3751[0x2];                                     // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3752[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable2;                             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         K2Node_DynamicCast_AsMesh_Component;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3753[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue2;                 // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ApplyCosmeticOverridesToMaterial_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3754[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue2;              // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3755[0x2];                                     // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x0110(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3756[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable3;                             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0128(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x01A8(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable4;                             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickupBackpack*                    K2Node_DynamicCast_AsFort_Pickup_Backpack;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue2;        // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3757[0x2];                                     // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0244(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0250(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x025C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0268(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0278(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0284(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue3;                 // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0298(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue2;             // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3758[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3759[0x6];                                     // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0338(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInterface*                     Temp_object_Variable5;                             // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item2;                          // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item3;                          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item4;                          // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375A[0x4];                                     // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable6;                             // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable7;                             // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue3;                  // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375B[0x6];                                     // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select2_Default;                            // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375C[0x3];                                     // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375D[0x3];                                     // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select3_Default;                            // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumericCVar_OutValue;                  // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNumericCVar_ReturnValue;               // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375E[0x3];                                     // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable3;                                // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item5;                          // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375F[0x3];                                     // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_C_ExecuteUbergraph_B_Pickups) == 0x000008, "Wrong alignment on B_Pickups_C_ExecuteUbergraph_B_Pickups");
static_assert(sizeof(B_Pickups_C_ExecuteUbergraph_B_Pickups) == 0x000450, "Wrong size on B_Pickups_C_ExecuteUbergraph_B_Pickups");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, EntryPoint) == 0x000000, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_bool_Variable) == 0x000004, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_float_Variable) == 0x000008, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_float_Variable2) == 0x00000C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item) == 0x000018, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_int_Variable) == 0x00001C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable) == 0x000028, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_float_Variable3) == 0x000030, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Event_PickupTarget) == 0x000038, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Event_PickupTarget' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_IsLocallyControlled_ReturnValue) == 0x000040, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetController_ReturnValue) == 0x000048, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000058, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_LastIndex_ReturnValue) == 0x000064, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_float_Variable4) == 0x000068, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_float_Variable4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00006C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000070, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000080, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetSubGame_ReturnValue) == 0x000088, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_SwitchEnum_CmpSuccess) == 0x000089, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetSubGame_ReturnValue2) == 0x00008A, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetSubGame_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x00008C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetMaterial_ReturnValue) == 0x000098, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Add_ReturnValue) == 0x0000A0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Add_ReturnValue2) == 0x0000A4, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetPickupStretchMIDFromPool_bNeedsToBeInitialized) == 0x0000A8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetPickupStretchMIDFromPool_bNeedsToBeInitialized' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetPickupStretchMIDFromPool_ReturnValue) == 0x0000B0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetPickupStretchMIDFromPool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000B8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_float_Variable5) == 0x0000BC, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_float_Variable5' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsFort_Resource_Item_Definition) == 0x0000C0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsFort_Resource_Item_Definition' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess2) == 0x0000C8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x0000C9, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x0000CA, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_byte_Variable) == 0x0000CB, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_BooleanOR_ReturnValue) == 0x0000CC, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_BooleanOR_ReturnValue2) == 0x0000CD, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Select_Default) == 0x0000D0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable2) == 0x0000D8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsMesh_Component) == 0x0000E0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsMesh_Component' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess3) == 0x0000E8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetMaterial_ReturnValue2) == 0x0000F0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_ApplyCosmeticOverridesToMaterial_ReturnValue) == 0x0000F8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_ApplyCosmeticOverridesToMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Add_ReturnValue3) == 0x000100, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Contains_ReturnValue) == 0x000104, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Add_ReturnValue4) == 0x000108, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Contains_ReturnValue2) == 0x00010C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Contains_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_BooleanOR_ReturnValue3) == 0x00010D, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_SelectRotator_ReturnValue) == 0x000110, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00011C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable3) == 0x000120, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000128, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0001A8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetOwner_ReturnValue) == 0x000228, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable4) == 0x000230, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsFort_Pickup_Backpack) == 0x000238, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsFort_Pickup_Backpack' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess4) == 0x000240, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_AttachToComponent_ReturnValue2) == 0x000241, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_AttachToComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000244, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x000250, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetComponentBounds_Origin) == 0x00025C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetComponentBounds_BoxExtent) == 0x000268, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetComponentBounds_SphereRadius) == 0x000274, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000278, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_VectorVector_ReturnValue) == 0x000284, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetMaterial_ReturnValue3) == 0x000290, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetMaterial_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000298, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetNumMaterials_ReturnValue) == 0x000318, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_LastIndex_ReturnValue2) == 0x00031C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_LastIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000320, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsMaterial_Instance) == 0x000328, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess5) == 0x000330, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000331, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000338, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable5) == 0x0003B8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item2) == 0x0003C0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item3) == 0x0003C8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0003D0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item4) == 0x0003D8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_int_Variable2) == 0x0003E0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable6) == 0x0003E8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable7) == 0x0003F0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable7' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetSubGame_ReturnValue3) == 0x0003F8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetSubGame_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_SwitchEnum2_CmpSuccess) == 0x0003F9, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Select2_Default) == 0x000400, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000408, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_FloatFloat_ReturnValue2) == 0x00040C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_FloatFloat_ReturnValue3) == 0x000410, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_FloatFloat_ReturnValue4) == 0x000414, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetGameState_ReturnValue) == 0x000418, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000420, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess6) == 0x000428, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Select3_Default) == 0x00042C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetNumericCVar_OutValue) == 0x000430, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetNumericCVar_OutValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetNumericCVar_ReturnValue) == 0x000434, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetNumericCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_int_Variable3) == 0x000438, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00043C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item5) == 0x000440, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x000448, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_IntInt_ReturnValue2) == 0x00044C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.OnAboutToEnterBackpack
// 0x0008 (0x0008 - 0x0000)
struct B_Pickups_C_OnAboutToEnterBackpack final
{
public:
	class AFortPawn*                              PickupTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_C_OnAboutToEnterBackpack) == 0x000008, "Wrong alignment on B_Pickups_C_OnAboutToEnterBackpack");
static_assert(sizeof(B_Pickups_C_OnAboutToEnterBackpack) == 0x000008, "Wrong size on B_Pickups_C_OnAboutToEnterBackpack");
static_assert(offsetof(B_Pickups_C_OnAboutToEnterBackpack, PickupTarget) == 0x000000, "Member 'B_Pickups_C_OnAboutToEnterBackpack::PickupTarget' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_Pickups_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_C_ReceiveTick) == 0x000004, "Wrong alignment on B_Pickups_C_ReceiveTick");
static_assert(sizeof(B_Pickups_C_ReceiveTick) == 0x000004, "Wrong size on B_Pickups_C_ReceiveTick");
static_assert(offsetof(B_Pickups_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_Pickups_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.UserConstructionScript
// 0x0180 (0x0180 - 0x0000)
struct B_Pickups_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3760[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3761[0x8];                                     // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable2;                             // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3762[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue2;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3763[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable3;                             // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             Temp_struct_Variable4;                             // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue3;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue4;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable5;                             // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_AddComponent_ReturnValue5;                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3764[0x2];                                     // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Select_Default;                             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Select2_Default;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue2;               // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Pickups_C_UserConstructionScript) == 0x000010, "Wrong alignment on B_Pickups_C_UserConstructionScript");
static_assert(sizeof(B_Pickups_C_UserConstructionScript) == 0x000180, "Wrong size on B_Pickups_C_UserConstructionScript");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'B_Pickups_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_struct_Variable) == 0x000010, "Member 'B_Pickups_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_struct_Variable2) == 0x000050, "Member 'B_Pickups_C_UserConstructionScript::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_bool_Variable2) == 0x000080, "Member 'B_Pickups_C_UserConstructionScript::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue2) == 0x000088, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_GetComponentBounds_Origin) == 0x000090, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_GetComponentBounds_BoxExtent) == 0x00009C, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_GetComponentBounds_SphereRadius) == 0x0000A8, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_struct_Variable3) == 0x0000B0, "Member 'B_Pickups_C_UserConstructionScript::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_struct_Variable4) == 0x0000E0, "Member 'B_Pickups_C_UserConstructionScript::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue3) == 0x000110, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue4) == 0x000118, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_struct_Variable5) == 0x000120, "Member 'B_Pickups_C_UserConstructionScript::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue5) == 0x000150, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000158, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000159, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00015C, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, K2Node_Select_Default) == 0x000160, "Member 'B_Pickups_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, K2Node_Select2_Default) == 0x000168, "Member 'B_Pickups_C_UserConstructionScript::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000171, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue2) == 0x000172, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue2' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.SetRarityColor
// 0x00F0 (0x00F0 - 0x0000)
struct B_Pickups_C_SetRarityColor final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortRarity                                   Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3765[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable5;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable7;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable8;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable9;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable10;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item;                           // 0x002C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3766[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
