#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExpeditionSquadSlotsView

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ExpeditionSquadSlotsView.BP_ExpeditionSquadSlotsView_C
// 0x0040 (0x0338 - 0x02F8)
class UBP_ExpeditionSquadSlotsView_C final : public UFortSquadSlotsView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(Transient, DuplicateTransient)
	class USquadSlotGroup_C*                      SubordinatesSquadSlotGroup;                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnSquadSlotSelected;                               // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bShowHeader;                                       // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelectableButtons;                                // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EE8[0x6];                                     // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnSquadSlotOpened;                                 // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EFortItemCardSize                             Slot_Size;                                         // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnSquadSlotSelected__DelegateSignature(int32 SquadSlotIndex);
	void OnSquadSlotOpened__DelegateSignature();
	void ExecuteUbergraph_BP_ExpeditionSquadSlotsView(int32 EntryPoint);
	void Destruct();
	void Construct();
	void OpenSquadSlotEvent(int32 SquadSlotIndex);
	void HandleSquadSlotOpened();
	void PreConstruct(bool IsDesignTime);
	void HandleSquadSlotSelected(int32 SquadSlotIndex);
	class UFortSquadSlotSelectorButton* CreateAndAddSquadSlotButton(int32 SquadSlotIndex, struct FHomebaseSquadSlot& SquadSlotDefinition, class UWidget** OutSquadSlotButtonHost);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ExpeditionSquadSlotsView_C">();
	}
	static class UBP_ExpeditionSquadSlotsView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ExpeditionSquadSlotsView_C>();
	}
};
static_assert(alignof(UBP_ExpeditionSquadSlotsView_C) == 0x000008, "Wrong alignment on UBP_ExpeditionSquadSlotsView_C");
static_assert(sizeof(UBP_ExpeditionSquadSlotsView_C) == 0x000338, "Wrong size on UBP_ExpeditionSquadSlotsView_C");
static_assert(offsetof(UBP_ExpeditionSquadSlotsView_C, UberGraphFrame) == 0x0002F8, "Member 'UBP_ExpeditionSquadSlotsView_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ExpeditionSquadSlotsView_C, SubordinatesSquadSlotGroup) == 0x000300, "Member 'UBP_ExpeditionSquadSlotsView_C::SubordinatesSquadSlotGroup' has a wrong offset!");
static_assert(offsetof(UBP_ExpeditionSquadSlotsView_C, OnSquadSlotSelected) == 0x000308, "Member 'UBP_ExpeditionSquadSlotsView_C::OnSquadSlotSelected' has a wrong offset!");
static_assert(offsetof(UBP_ExpeditionSquadSlotsView_C, bShowHeader) == 0x000318, "Member 'UBP_ExpeditionSquadSlotsView_C::bShowHeader' has a wrong offset!");
static_assert(offsetof(UBP_ExpeditionSquadSlotsView_C, bSelectableButtons) == 0x000319, "Member 'UBP_ExpeditionSquadSlotsView_C::bSelectableButtons' has a wrong offset!");
static_assert(offsetof(UBP_ExpeditionSquadSlotsView_C, OnSquadSlotOpened) == 0x000320, "Member 'UBP_ExpeditionSquadSlotsView_C::OnSquadSlotOpened' has a wrong offset!");
static_assert(offsetof(UBP_ExpeditionSquadSlotsView_C, Slot_Size) == 0x000330, "Member 'UBP_ExpeditionSquadSlotsView_C::Slot_Size' has a wrong offset!");

}

