#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemTransform_TabButton

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemTransform_TabButton.BP_ItemTransform_TabButton_C.ExecuteUbergraph_BP_ItemTransform_TabButton
// 0x01E0 (0x01E0 - 0x0000)
struct BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B97[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetCurrentTextStyleClass_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetCurrentTextStyleClass_ReturnValue2;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B98[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                K2Node_Event_TabLabelInfo;                         // 0x0020(0x0090)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue2;                 // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B99[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00C8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x00F0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor3;                     // 0x0118(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor4;                     // 0x0140(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor5;                     // 0x0168(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor6;                     // 0x0190(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor7;                     // 0x01B8(0x0028)()
};
static_assert(alignof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton) == 0x000008, "Wrong alignment on BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton");
static_assert(sizeof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton) == 0x0001E0, "Wrong size on BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, EntryPoint) == 0x000000, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, CallFunc_GetCurrentTextStyleClass_ReturnValue) == 0x000008, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::CallFunc_GetCurrentTextStyleClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, CallFunc_GetCurrentTextStyleClass_ReturnValue2) == 0x000010, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::CallFunc_GetCurrentTextStyleClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, K2Node_Event_IsDesignTime) == 0x000018, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, K2Node_Event_TabLabelInfo) == 0x000020, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::K2Node_Event_TabLabelInfo' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B0, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, CallFunc_Create_Basic_Tooltip_Output) == 0x0000B8, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, CallFunc_GetSelected_ReturnValue) == 0x0000C0, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, CallFunc_GetSelected_ReturnValue2) == 0x0000C1, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::CallFunc_GetSelected_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, K2Node_MakeStruct_SlateColor) == 0x0000C8, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, K2Node_MakeStruct_SlateColor2) == 0x0000F0, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::K2Node_MakeStruct_SlateColor2' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, K2Node_MakeStruct_SlateColor3) == 0x000118, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::K2Node_MakeStruct_SlateColor3' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, K2Node_MakeStruct_SlateColor4) == 0x000140, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::K2Node_MakeStruct_SlateColor4' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, K2Node_MakeStruct_SlateColor5) == 0x000168, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::K2Node_MakeStruct_SlateColor5' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, K2Node_MakeStruct_SlateColor6) == 0x000190, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::K2Node_MakeStruct_SlateColor6' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton, K2Node_MakeStruct_SlateColor7) == 0x0001B8, "Member 'BP_ItemTransform_TabButton_C_ExecuteUbergraph_BP_ItemTransform_TabButton::K2Node_MakeStruct_SlateColor7' has a wrong offset!");

// Function BP_ItemTransform_TabButton.BP_ItemTransform_TabButton_C.SetTabLabelInfo
// 0x0090 (0x0090 - 0x0000)
struct BP_ItemTransform_TabButton_C_SetTabLabelInfo final
{
public:
	struct FFortTabButtonLabelInfo                TabLabelInfo;                                      // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_ItemTransform_TabButton_C_SetTabLabelInfo) == 0x000008, "Wrong alignment on BP_ItemTransform_TabButton_C_SetTabLabelInfo");
static_assert(sizeof(BP_ItemTransform_TabButton_C_SetTabLabelInfo) == 0x000090, "Wrong size on BP_ItemTransform_TabButton_C_SetTabLabelInfo");
static_assert(offsetof(BP_ItemTransform_TabButton_C_SetTabLabelInfo, TabLabelInfo) == 0x000000, "Member 'BP_ItemTransform_TabButton_C_SetTabLabelInfo::TabLabelInfo' has a wrong offset!");

// Function BP_ItemTransform_TabButton.BP_ItemTransform_TabButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemTransform_TabButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTransform_TabButton_C_PreConstruct) == 0x000001, "Wrong alignment on BP_ItemTransform_TabButton_C_PreConstruct");
static_assert(sizeof(BP_ItemTransform_TabButton_C_PreConstruct) == 0x000001, "Wrong size on BP_ItemTransform_TabButton_C_PreConstruct");
static_assert(offsetof(BP_ItemTransform_TabButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_ItemTransform_TabButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_ItemTransform_TabButton.BP_ItemTransform_TabButton_C.Set Text
// 0x0028 (0x0028 - 0x0000)
struct BP_ItemTransform_TabButton_C_Set_Text final
{
public:
	class FText                                   Param_ButtonText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemTransform_TabButton_C_Set_Text) == 0x000008, "Wrong alignment on BP_ItemTransform_TabButton_C_Set_Text");
static_assert(sizeof(BP_ItemTransform_TabButton_C_Set_Text) == 0x000028, "Wrong size on BP_ItemTransform_TabButton_C_Set_Text");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Set_Text, Param_ButtonText) == 0x000000, "Member 'BP_ItemTransform_TabButton_C_Set_Text::Param_ButtonText' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Set_Text, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'BP_ItemTransform_TabButton_C_Set_Text::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Set_Text, CallFunc_Create_Basic_Tooltip_Output) == 0x000020, "Member 'BP_ItemTransform_TabButton_C_Set_Text::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");

// Function BP_ItemTransform_TabButton.BP_ItemTransform_TabButton_C.Set Icon
// 0x0078 (0x0078 - 0x0000)
struct BP_ItemTransform_TabButton_C_Set_Icon final
{
public:
	struct FSlateBrush                            Param_IconBrush;                                   // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_ItemTransform_TabButton_C_Set_Icon) == 0x000008, "Wrong alignment on BP_ItemTransform_TabButton_C_Set_Icon");
static_assert(sizeof(BP_ItemTransform_TabButton_C_Set_Icon) == 0x000078, "Wrong size on BP_ItemTransform_TabButton_C_Set_Icon");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Set_Icon, Param_IconBrush) == 0x000000, "Member 'BP_ItemTransform_TabButton_C_Set_Icon::Param_IconBrush' has a wrong offset!");

// Function BP_ItemTransform_TabButton.BP_ItemTransform_TabButton_C.Refresh Bang State
// 0x0030 (0x0030 - 0x0000)
struct BP_ItemTransform_TabButton_C_Refresh_Bang_State final
{
public:
	int32                                         NumUnseen;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConversionControlKeyRequest                  CallFunc_Get_Tab_Id_as_Request_Type_ReturnValue;   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9B[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortAccountItem*>               CallFunc_GetTransformKeys_TransformKeys;           // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Calculate_Unseen_Keys_NumUnseen;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemTransform_TabButton_C_Refresh_Bang_State) == 0x000008, "Wrong alignment on BP_ItemTransform_TabButton_C_Refresh_Bang_State");
static_assert(sizeof(BP_ItemTransform_TabButton_C_Refresh_Bang_State) == 0x000030, "Wrong size on BP_ItemTransform_TabButton_C_Refresh_Bang_State");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Refresh_Bang_State, NumUnseen) == 0x000000, "Member 'BP_ItemTransform_TabButton_C_Refresh_Bang_State::NumUnseen' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Refresh_Bang_State, CallFunc_Get_Tab_Id_as_Request_Type_ReturnValue) == 0x000004, "Member 'BP_ItemTransform_TabButton_C_Refresh_Bang_State::CallFunc_Get_Tab_Id_as_Request_Type_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Refresh_Bang_State, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'BP_ItemTransform_TabButton_C_Refresh_Bang_State::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Refresh_Bang_State, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'BP_ItemTransform_TabButton_C_Refresh_Bang_State::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Refresh_Bang_State, CallFunc_GetTransformKeys_TransformKeys) == 0x000018, "Member 'BP_ItemTransform_TabButton_C_Refresh_Bang_State::CallFunc_GetTransformKeys_TransformKeys' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Refresh_Bang_State, CallFunc_Calculate_Unseen_Keys_NumUnseen) == 0x000028, "Member 'BP_ItemTransform_TabButton_C_Refresh_Bang_State::CallFunc_Calculate_Unseen_Keys_NumUnseen' has a wrong offset!");

// Function BP_ItemTransform_TabButton.BP_ItemTransform_TabButton_C.Set Tab Id
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_ItemTransform_TabButton_C_Set_Tab_Id final
{
public:
	class FName                                   Param_TabId;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemTransform_TabButton_C_Set_Tab_Id) == 0x000008, "Wrong alignment on BP_ItemTransform_TabButton_C_Set_Tab_Id");
static_assert(sizeof(BP_ItemTransform_TabButton_C_Set_Tab_Id) == 0x000008, "Wrong size on BP_ItemTransform_TabButton_C_Set_Tab_Id");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Set_Tab_Id, Param_TabId) == 0x000000, "Member 'BP_ItemTransform_TabButton_C_Set_Tab_Id::Param_TabId' has a wrong offset!");

// Function BP_ItemTransform_TabButton.BP_ItemTransform_TabButton_C.Get Tab Id as Request Type
// 0x0003 (0x0003 - 0x0000)
struct BP_ItemTransform_TabButton_C_Get_Tab_Id_as_Request_Type final
{
public:
	EConversionControlKeyRequest                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTransform_TabButton_C_Get_Tab_Id_as_Request_Type) == 0x000001, "Wrong alignment on BP_ItemTransform_TabButton_C_Get_Tab_Id_as_Request_Type");
static_assert(sizeof(BP_ItemTransform_TabButton_C_Get_Tab_Id_as_Request_Type) == 0x000003, "Wrong size on BP_ItemTransform_TabButton_C_Get_Tab_Id_as_Request_Type");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Tab_Id_as_Request_Type, ReturnValue) == 0x000000, "Member 'BP_ItemTransform_TabButton_C_Get_Tab_Id_as_Request_Type::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Tab_Id_as_Request_Type, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000001, "Member 'BP_ItemTransform_TabButton_C_Get_Tab_Id_as_Request_Type::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Tab_Id_as_Request_Type, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x000002, "Member 'BP_ItemTransform_TabButton_C_Get_Tab_Id_as_Request_Type::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");

// Function BP_ItemTransform_TabButton.BP_ItemTransform_TabButton_C.Calculate Unseen Keys
// 0x0048 (0x0048 - 0x0000)
struct BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys final
{
public:
	TArray<class UFortAccountItem*>               Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         NumUnseen;                                         // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalNumUnseen;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9C[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItem*                       CallFunc_Get_Item_from_Transform_Seen_State_Item;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasBeenSeenLocally_ReturnValue;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys) == 0x000008, "Wrong alignment on BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys");
static_assert(sizeof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys) == 0x000048, "Wrong size on BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys, Array) == 0x000000, "Member 'BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys::Array' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys, NumUnseen) == 0x000010, "Member 'BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys::NumUnseen' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys, LocalNumUnseen) == 0x000014, "Member 'BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys::LocalNumUnseen' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys, CallFunc_Add_IntInt_ReturnValue2) == 0x000024, "Member 'BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys, CallFunc_Get_Item_from_Transform_Seen_State_Item) == 0x000038, "Member 'BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys::CallFunc_Get_Item_from_Transform_Seen_State_Item' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys, CallFunc_HasBeenSeenLocally_ReturnValue) == 0x000041, "Member 'BP_ItemTransform_TabButton_C_Calculate_Unseen_Keys::CallFunc_HasBeenSeenLocally_ReturnValue' has a wrong offset!");

// Function BP_ItemTransform_TabButton.BP_ItemTransform_TabButton_C.Get Item from Transform Seen State
// 0x0080 (0x0080 - 0x0000)
struct BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State final
{
public:
	class UFortAccountItem*                       Transform_Key;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       Item;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Catalyst_Tags;                                     // 0x0010(0x0020)(Edit, BlueprintVisible)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversionControlItemDefinition*   K2Node_DynamicCast_AsFort_Conversion_Control_Item_Definition; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9D[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetRequiredCatalysts_ReturnValue;         // 0x0048(0x0020)()
	class AFortPlayerController*                  CallFunc_Get_FortPC_FortPC;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHomebaseNodeItem*                  CallFunc_GetHomebaseNodeItemForTagContainer_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State) == 0x000008, "Wrong alignment on BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State");
static_assert(sizeof(BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State) == 0x000080, "Wrong size on BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State, Transform_Key) == 0x000000, "Member 'BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State::Transform_Key' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State, Item) == 0x000008, "Member 'BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State::Item' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State, Catalyst_Tags) == 0x000010, "Member 'BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State::Catalyst_Tags' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000030, "Member 'BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State, K2Node_DynamicCast_AsFort_Conversion_Control_Item_Definition) == 0x000038, "Member 'BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State::K2Node_DynamicCast_AsFort_Conversion_Control_Item_Definition' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State, CallFunc_GetRequiredCatalysts_ReturnValue) == 0x000048, "Member 'BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State::CallFunc_GetRequiredCatalysts_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State, CallFunc_Get_FortPC_FortPC) == 0x000068, "Member 'BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State::CallFunc_Get_FortPC_FortPC' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State, CallFunc_GetHomebaseNodeItemForTagContainer_ReturnValue) == 0x000070, "Member 'BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State::CallFunc_GetHomebaseNodeItemForTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State, CallFunc_GetNumGameplayTagsInContainer_ReturnValue) == 0x000078, "Member 'BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State::CallFunc_GetNumGameplayTagsInContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00007C, "Member 'BP_ItemTransform_TabButton_C_Get_Item_from_Transform_Seen_State::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ItemTransform_TabButton.BP_ItemTransform_TabButton_C.Get FortPC
// 0x0020 (0x0020 - 0x0000)
struct BP_ItemTransform_TabButton_C_Get_FortPC final
{
public:
	class AFortPlayerController*                  FortPC;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemTransform_TabButton_C_Get_FortPC) == 0x000008, "Wrong alignment on BP_ItemTransform_TabButton_C_Get_FortPC");
static_assert(sizeof(BP_ItemTransform_TabButton_C_Get_FortPC) == 0x000020, "Wrong size on BP_ItemTransform_TabButton_C_Get_FortPC");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_FortPC, FortPC) == 0x000000, "Member 'BP_ItemTransform_TabButton_C_Get_FortPC::FortPC' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_FortPC, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'BP_ItemTransform_TabButton_C_Get_FortPC::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemTransform_TabButton_C_Get_FortPC, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000010, "Member 'BP_ItemTransform_TabButton_C_Get_FortPC::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
