#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FullPartyMemberAthena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FullPartyMemberAthena.FullPartyMemberAthena_C
// 0x03D8 (0x05F8 - 0x0220)
class UFullPartyMemberAthena_C final : public UAthenaPartyMemberBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(Transient, DuplicateTransient)
	class UVerticalBox*                           CONNECTED;                                         // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Connecting;                                        // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_233;                                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageEmpty;                                        // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KillsText;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LeaderImageOverlay;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MemberStateSwitcher;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNormalBangWrapper_C*                   NormalBangWrapper_0;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Open;                                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerName;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Speaker;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    MemberInfo;                                        // 0x0298(0x01A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                              Dimensions;                                        // 0x0440(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   DeclineAction;                                     // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   LocalPlayerActionsTitle;                           // 0x0450(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bLocalPlayerAlone;                                 // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3674[0x7];                                     // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_LocalPlayerProfileModal_C*          NewLocalPlayerWidget;                              // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Modified_Power;                                    // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SquadMemberIndex_0;                                // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3675[0x4];                                     // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            MutedBrush;                                        // 0x0488(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            NotTalkingBrush;                                   // 0x0500(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            TalkingBrush;                                      // 0x0578(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsTalking;                                        // 0x05F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsMuted;                                          // 0x05F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_FullPartyMemberAthena(int32 EntryPoint);
	void PlayerNameChanged(const class FString& Param_PlayerName);
	void TalkingStateChanged(bool bTalking);
	void MutedStateChanged(bool Muted);
	void TeamMemberChanged();
	void OnClicked();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void UpdateMemberInfo(const struct FFortTeamMemberInfo& NewMemberInfo);
	void ShowOpen();
	void ShowConnecting();
	void ShowConnected();
	void UpdateDimensions(const struct FVector2D& NewDimensions);
	class UFullPartyMemberConnected_C* DuplicateConnectedWidget();
	void UpdateLocalPlayerAction();
	void HandleLocalPlayerActionsResult(EFortDialogResult Result, class FName ResultName);
	void MakeLocalPlayerConfirmActions(bool LocalPlayerAlone, TArray<struct FConfirmationDialogAction>* OutConfirmActions);
	void InitializeConnectedWidget(class UFullPartyMemberConnected_C* ConnectedWidget);
	void HandleAthenaTeamMemberChanged();
	void HandleAthenaTeamMemberMuteChanged(bool Param_bIsMuted);
	void HandleAthenaTeamMemberTalkingChanged(bool Param_bIsTalking);
	void HighlightEmptyBanner(bool BannerIsHighlighted);
	void UpdateMicIndicator();
	void HandleAthenaTeamMemberKillsChanged(TArray<int32>& Kills);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FullPartyMemberAthena_C">();
	}
	static class UFullPartyMemberAthena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFullPartyMemberAthena_C>();
	}
};
static_assert(alignof(UFullPartyMemberAthena_C) == 0x000008, "Wrong alignment on UFullPartyMemberAthena_C");
static_assert(sizeof(UFullPartyMemberAthena_C) == 0x0005F8, "Wrong size on UFullPartyMemberAthena_C");
static_assert(offsetof(UFullPartyMemberAthena_C, UberGraphFrame) == 0x000220, "Member 'UFullPartyMemberAthena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, CONNECTED) == 0x000228, "Member 'UFullPartyMemberAthena_C::CONNECTED' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, Connecting) == 0x000230, "Member 'UFullPartyMemberAthena_C::Connecting' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, Image_1) == 0x000238, "Member 'UFullPartyMemberAthena_C::Image_1' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, Image_2) == 0x000240, "Member 'UFullPartyMemberAthena_C::Image_2' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, Image_3) == 0x000248, "Member 'UFullPartyMemberAthena_C::Image_3' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, Image_233) == 0x000250, "Member 'UFullPartyMemberAthena_C::Image_233' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, ImageEmpty) == 0x000258, "Member 'UFullPartyMemberAthena_C::ImageEmpty' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, KillsText) == 0x000260, "Member 'UFullPartyMemberAthena_C::KillsText' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, LeaderImageOverlay) == 0x000268, "Member 'UFullPartyMemberAthena_C::LeaderImageOverlay' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, MemberStateSwitcher) == 0x000270, "Member 'UFullPartyMemberAthena_C::MemberStateSwitcher' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, NormalBangWrapper_0) == 0x000278, "Member 'UFullPartyMemberAthena_C::NormalBangWrapper_0' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, Open) == 0x000280, "Member 'UFullPartyMemberAthena_C::Open' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, PlayerName) == 0x000288, "Member 'UFullPartyMemberAthena_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, Speaker) == 0x000290, "Member 'UFullPartyMemberAthena_C::Speaker' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, MemberInfo) == 0x000298, "Member 'UFullPartyMemberAthena_C::MemberInfo' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, Dimensions) == 0x000440, "Member 'UFullPartyMemberAthena_C::Dimensions' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, DeclineAction) == 0x000448, "Member 'UFullPartyMemberAthena_C::DeclineAction' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, LocalPlayerActionsTitle) == 0x000450, "Member 'UFullPartyMemberAthena_C::LocalPlayerActionsTitle' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, bLocalPlayerAlone) == 0x000468, "Member 'UFullPartyMemberAthena_C::bLocalPlayerAlone' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, NewLocalPlayerWidget) == 0x000470, "Member 'UFullPartyMemberAthena_C::NewLocalPlayerWidget' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, Modified_Power) == 0x000478, "Member 'UFullPartyMemberAthena_C::Modified_Power' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, SquadMemberIndex_0) == 0x000480, "Member 'UFullPartyMemberAthena_C::SquadMemberIndex_0' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, MutedBrush) == 0x000488, "Member 'UFullPartyMemberAthena_C::MutedBrush' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, NotTalkingBrush) == 0x000500, "Member 'UFullPartyMemberAthena_C::NotTalkingBrush' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, TalkingBrush) == 0x000578, "Member 'UFullPartyMemberAthena_C::TalkingBrush' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, bIsTalking) == 0x0005F0, "Member 'UFullPartyMemberAthena_C::bIsTalking' has a wrong offset!");
static_assert(offsetof(UFullPartyMemberAthena_C, bIsMuted) == 0x0005F1, "Member 'UFullPartyMemberAthena_C::bIsMuted' has a wrong offset!");

}

