#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HBOnboardingFlow

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HBOnboardingFlow.HBOnboardingFlow_C.ExecuteUbergraph_HBOnboardingFlow
// 0x0790 (0x0790 - 0x0000)
struct HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedOnboardingObjective_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3432[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3433[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AutoSelectSubGame_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3434[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3435[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue2;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3436[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue3;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3437[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue5;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue6;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue7;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileApp_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3438[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue8;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileApp_ReturnValue2;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3439[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue9;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343A[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343B[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue4;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue10;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_343C[0x6];                                     // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue11;                 // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue12;                 // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileApp_ReturnValue3;                 // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue2;                  // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_343D[0x5];                                     // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue13;                 // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_CanPlay_DenialReason;                     // 0x0190(0x0018)()
	bool                                          CallFunc_CanPlay_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_343E[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue5;                  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue14;                 // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_343F[0xE];                                     // 0x01D2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01E0(0x0030)(IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x0228(0x0010)(ZeroConstructor, NoDestructor)
	class AFortClientAnnouncement*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_WaitForClientAnnouncement* CallFunc_WaitForClientAnnouncement_ReturnValue;    // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3440[0x6];                                     // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array;                            // 0x0260(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate14;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue15;                 // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue6;                  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x0290(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3441[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue7;                  // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate15;            // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3442[0x6];                                     // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate16;            // 0x02E8(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array2;                           // 0x02F8(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortQuestManager*                      CallFunc_GetCampaignQuestManager_QuestManager;     // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_SendQuestStatEvent*    CallFunc_SendClientStatEvent_ReturnValue;          // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3443[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleClientEvent_EventSource6;             // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus6;              // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent6;             // 0x0330(0x0020)(NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue3;               // 0x0350(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate17;            // 0x0388(0x0010)(ZeroConstructor, NoDestructor)
	class AFortClientAnnouncement*                CallFunc_FinishSpawningActor_ReturnValue2;         // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_WaitForClientAnnouncement* CallFunc_WaitForClientAnnouncement_ReturnValue2;   // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3444[0x7];                                     // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIState                                  CallFunc__BPGetCurrentUIState_ReturnValue;         // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3445[0x6];                                     // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate18;            // 0x03C0(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue16;                 // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetCampaignQuestManager_QuestManager2;    // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_SendQuestStatEvent*    CallFunc_SendClientStatEvent_ReturnValue2;         // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue12;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedOnboardingObjective_ReturnValue2; // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x03EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3446[0x4];                                     // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue17;                 // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortHomeBaseInfo                      CallFunc_GetHomeBaseInfo_Result;                   // 0x03F8(0x0040)()
	bool                                          CallFunc_HasCompletedOnboardingObjective_ReturnValue3; // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x043A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x043B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedOnboardingObjective_ReturnValue4; // 0x043D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x043E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3447[0x1];                                     // 0x043F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array3;                           // 0x0440(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue8;                  // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue13;                    // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3448[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue2;          // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIState                                  CallFunc__BPGetCurrentUIState_ReturnValue2;        // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3449[0x6];                                     // 0x046A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate19;            // 0x0470(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate20;            // 0x0480(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventSource5;             // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus5;              // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent5;             // 0x04A0(0x0020)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue6;                 // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344A[0x7];                                     // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleClientEvent_EventSource4;             // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus4;              // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent4;             // 0x04D8(0x0020)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate21;            // 0x04F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344B[0x7];                                     // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate22;            // 0x0510(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate23;            // 0x0520(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   K2Node_CustomEvent_Reason_Title;                   // 0x0530(0x0018)()
	class FText                                   K2Node_CustomEvent_Reason;                         // 0x0548(0x0018)()
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0568(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue14;                    // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344C[0x7];                                     // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue2;             // 0x0588(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue3;             // 0x05A0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue4;             // 0x05B8(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate24;            // 0x05D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NeedsToPlayEventMovie_ReturnValue;        // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RecheckNeedToPlayEventMovie_WaitingToCheckAgain; // 0x05E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RecheckNeedToPlayEventMovie_WaitingToCheckAgain2; // 0x05E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344D[0x5];                                     // 0x05E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue5;             // 0x05E8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue6;             // 0x0600(0x0018)()
	bool                                          CallFunc_CanAccessManagementFeatures_Can_Manage;   // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue7;                 // 0x0619(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344E[0x6];                                     // 0x061A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleClientEvent_EventSource3;             // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus3;              // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent3;             // 0x0630(0x0020)(NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344F[0x7];                                     // 0x0651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3450[0x7];                                     // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate25;            // 0x0670(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_LoadCampaignProfiles*  CallFunc_LoadCampaignProfiles_ReturnValue;         // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue15;                    // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3451[0x7];                                     // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate26;            // 0x0690(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate27;            // 0x06A0(0x0010)(ZeroConstructor, NoDestructor)
	class UFortQuestItem*                         CallFunc_GetOnboardingQuestItem_Result;            // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue16;                    // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3452[0x7];                                     // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_GetOnboardingQuestItem_Result2;           // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue;            // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3453[0x7];                                     // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetCampaignQuestManager_QuestManager3;    // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_EnsureClientQuestLogin* CallFunc_SendEnsureClientQuestLogin_ReturnValue;   // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetCampaignQuestManager_QuestManager4;    // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_SendQuestStatEvent*    CallFunc_SendClientStatEvent_ReturnValue3;         // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue17;                    // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue18;                    // 0x06F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedOnboardingObjective_ReturnValue5; // 0x06F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3454[0x5];                                     // 0x06F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleClientEvent_EventSource2;             // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus2;              // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent2;             // 0x0708(0x0020)(NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3; // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue2;              // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3455[0x7];                                     // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortClientAnnouncement*                CallFunc_FinishSpawningActor_ReturnValue3;         // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventSource;              // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus;               // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent;              // 0x0750(0x0020)(NoDestructor)
	class UFortAsyncAction_WaitForClientAnnouncement* CallFunc_WaitForClientAnnouncement_ReturnValue3;   // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue19;                    // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3456[0x7];                                     // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate28;            // 0x0780(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow) == 0x000010, "Wrong alignment on HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow");
static_assert(sizeof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow) == 0x000790, "Wrong size on HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, EntryPoint) == 0x000000, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::EntryPoint' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_HasCompletedOnboardingObjective_ReturnValue) == 0x000004, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_HasCompletedOnboardingObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue) == 0x000008, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue2) == 0x000020, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_AutoSelectSubGame_ReturnValue) == 0x000028, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_AutoSelectSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetSubGame_ReturnValue) == 0x000040, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_SwitchEnum_CmpSuccess) == 0x000041, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue2) == 0x000048, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate2) == 0x000050, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue2) == 0x000060, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue3) == 0x000068, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue3) == 0x000070, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue3) == 0x000078, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue4) == 0x000080, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue5) == 0x000088, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue6) == 0x000090, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue7) == 0x000098, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsMobileApp_ReturnValue) == 0x0000A0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsMobileApp_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue8) == 0x0000A8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue8' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsMobileApp_ReturnValue2) == 0x0000B0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsMobileApp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue9) == 0x0000B8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue9' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CustomEvent_Result) == 0x0000C0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CustomEvent_ResultName) == 0x0000C8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate3) == 0x0000D0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, Temp_name_Variable) == 0x0000E0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, Temp_byte_Variable) == 0x0000E8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate4) == 0x0000F0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue4) == 0x000100, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue10) == 0x000108, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue10' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetQuestManager_ReturnValue) == 0x000110, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue4) == 0x000118, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue5) == 0x000119, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate5) == 0x000120, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate6) == 0x000130, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate7) == 0x000140, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue11) == 0x000150, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue11' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue12) == 0x000158, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue12' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsMobileApp_ReturnValue3) == 0x000160, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsMobileApp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetSubGame_ReturnValue2) == 0x000161, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetSubGame_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000162, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate8) == 0x000168, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate9) == 0x000178, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue13) == 0x000188, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue13' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_CanPlay_DenialReason) == 0x000190, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_CanPlay_DenialReason' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_CanPlay_ReturnValue) == 0x0001A8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_CanPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate10) == 0x0001B0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue5) == 0x0001C0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue14) == 0x0001C8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue14' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue6) == 0x0001D0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, Temp_bool_Has_Been_Initd_Variable) == 0x0001D1, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_MakeTransform_ReturnValue) == 0x0001E0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate11) == 0x000210, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000220, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate12) == 0x000228, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_FinishSpawningActor_ReturnValue) == 0x000238, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_WaitForClientAnnouncement_ReturnValue) == 0x000240, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_WaitForClientAnnouncement_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValidClass_ReturnValue) == 0x000248, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue7) == 0x000249, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate13) == 0x000250, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_MakeArray_Array) == 0x000260, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate14) == 0x000270, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue15) == 0x000280, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue15' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue6) == 0x000288, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue6' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_MakeTransform_ReturnValue2) == 0x000290, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_MakeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue8) == 0x0002C0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue7) == 0x0002C8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue7' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate15) == 0x0002D0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue9) == 0x0002E0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_Not_PreBool_ReturnValue) == 0x0002E1, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate16) == 0x0002E8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate16' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_MakeArray_Array2) == 0x0002F8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetCampaignQuestManager_QuestManager) == 0x000308, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetCampaignQuestManager_QuestManager' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SendClientStatEvent_ReturnValue) == 0x000310, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SendClientStatEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue10) == 0x000318, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue10' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_HandleClientEvent_EventSource6) == 0x000320, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_HandleClientEvent_EventSource6' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_HandleClientEvent_EventFocus6) == 0x000328, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_HandleClientEvent_EventFocus6' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_HandleClientEvent_ClientEvent6) == 0x000330, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_HandleClientEvent_ClientEvent6' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_MakeTransform_ReturnValue3) == 0x000350, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_MakeTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2) == 0x000380, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate17) == 0x000388, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate17' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_FinishSpawningActor_ReturnValue2) == 0x000398, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_FinishSpawningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_WaitForClientAnnouncement_ReturnValue2) == 0x0003A0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_WaitForClientAnnouncement_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue11) == 0x0003A8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue11' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetUIManagerWidget_ReturnValue) == 0x0003B0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc__BPGetCurrentUIState_ReturnValue) == 0x0003B8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc__BPGetCurrentUIState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x0003B9, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate18) == 0x0003C0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate18' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue16) == 0x0003D0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue16' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetCampaignQuestManager_QuestManager2) == 0x0003D8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetCampaignQuestManager_QuestManager2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SendClientStatEvent_ReturnValue2) == 0x0003E0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SendClientStatEvent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue12) == 0x0003E8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue12' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_HasCompletedOnboardingObjective_ReturnValue2) == 0x0003E9, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_HasCompletedOnboardingObjective_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, Temp_bool_IsClosed_Variable) == 0x0003EA, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::Temp_bool_IsClosed_Variable' has a wrong offset!");
