#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyPlayerPadTop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LobbyPlayerPadTop.LobbyPlayerPadTop_C
// 0x0368 (0x0578 - 0x0210)
class ULobbyPlayerPadTop_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 LeaderImage;                                       // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Microphone;                                        // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayInputAction;                                // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerBanner_C*                        PlayerBanner_92;                                   // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PowerBox;                                          // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPowerWidget_C*                         PowerWidget;                                       // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ReadyStatusBox;                                    // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ReadyUpStatusText;                                 // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPlayerName;                                    // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0260(0x01A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PlayerIndex;                                       // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHovered;                                          // 0x040C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsTalking;                                        // 0x040D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsMuted;                                          // 0x040E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402C[0x1];                                     // 0x040F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            TalkingBrush;                                      // 0x0410(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            MutedBrush;                                        // 0x0488(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            MicBrush;                                          // 0x0500(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_LobbyPlayerPadTop(int32 EntryPoint);
	void OnLobbyDisconnected();
	void OnUpdateLobbyPlayerPadTop(const struct FUniqueNetIdRepl& PlayerNetId, bool bIsReady);
	void OnLobbyStarted();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void RefreshPlayerName();
	void Refresh();
	void SetTeamMemberInfo(const struct FFortTeamMemberInfo& Param_TeamMemberInfo);
	void OnLobbyPlayerHovered(int32 Param_PlayerIndex);
	void InitializeContextEvents();
	void Initialize(int32 Param_PlayerIndex);
	void OnLobbyPlayerUnhovered(int32 Param_PlayerIndex);
	void OnAthenaReadyStateChanged(struct FUniqueNetIdRepl& Member_Id, bool Ready);
	void RefreshReadyState(bool Ready);
	void HandlePlayerTalkingChanged(const struct FUniqueNetIdRepl& UniqueId, bool IsTalking);
	void HandlePlayerMutingChanged(const struct FUniqueNetIdRepl& UniqueId, bool IsTalking);
	void HandlePlayerStoppedTalking();
	void UpdateMicIcon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyPlayerPadTop_C">();
	}
	static class ULobbyPlayerPadTop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULobbyPlayerPadTop_C>();
	}
};
static_assert(alignof(ULobbyPlayerPadTop_C) == 0x000008, "Wrong alignment on ULobbyPlayerPadTop_C");
static_assert(sizeof(ULobbyPlayerPadTop_C) == 0x000578, "Wrong size on ULobbyPlayerPadTop_C");
static_assert(offsetof(ULobbyPlayerPadTop_C, UberGraphFrame) == 0x000210, "Member 'ULobbyPlayerPadTop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, LeaderImage) == 0x000218, "Member 'ULobbyPlayerPadTop_C::LeaderImage' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, Microphone) == 0x000220, "Member 'ULobbyPlayerPadTop_C::Microphone' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, OverlayInputAction) == 0x000228, "Member 'ULobbyPlayerPadTop_C::OverlayInputAction' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, PlayerBanner_92) == 0x000230, "Member 'ULobbyPlayerPadTop_C::PlayerBanner_92' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, PowerBox) == 0x000238, "Member 'ULobbyPlayerPadTop_C::PowerBox' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, PowerWidget) == 0x000240, "Member 'ULobbyPlayerPadTop_C::PowerWidget' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, ReadyStatusBox) == 0x000248, "Member 'ULobbyPlayerPadTop_C::ReadyStatusBox' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, ReadyUpStatusText) == 0x000250, "Member 'ULobbyPlayerPadTop_C::ReadyUpStatusText' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, TextPlayerName) == 0x000258, "Member 'ULobbyPlayerPadTop_C::TextPlayerName' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, TeamMemberInfo) == 0x000260, "Member 'ULobbyPlayerPadTop_C::TeamMemberInfo' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, PlayerIndex) == 0x000408, "Member 'ULobbyPlayerPadTop_C::PlayerIndex' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, bHovered) == 0x00040C, "Member 'ULobbyPlayerPadTop_C::bHovered' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, bIsTalking) == 0x00040D, "Member 'ULobbyPlayerPadTop_C::bIsTalking' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, bIsMuted) == 0x00040E, "Member 'ULobbyPlayerPadTop_C::bIsMuted' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, TalkingBrush) == 0x000410, "Member 'ULobbyPlayerPadTop_C::TalkingBrush' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, MutedBrush) == 0x000488, "Member 'ULobbyPlayerPadTop_C::MutedBrush' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadTop_C, MicBrush) == 0x000500, "Member 'ULobbyPlayerPadTop_C::MicBrush' has a wrong offset!");

}

