#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginScreen

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Account_structs.hpp"


namespace SDK::Params
{

// Function LoginScreen.LoginScreen_C.ExecuteUbergraph_LoginScreen
// 0x0270 (0x0270 - 0x0000)
struct LoginScreen_C_ExecuteUbergraph_LoginScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBROnly_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_246B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_246C[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* WebWidget)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	EFortUIState                                  K2Node_Event_PreviousUIState;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIState                                  K2Node_Event_NextUIState;                          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_246D[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_LoginEmail;                     // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_LoginPassword;                  // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EExternalAccountType                          K2Node_CustomEvent_Account_Type;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_246E[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartManualLogin_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartAutoLogin_ReturnValue;               // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_246F[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Reason2;                              // 0x0080(0x0018)()
	class FText                                   K2Node_Event_EulaText;                             // 0x0098(0x0018)()
	bool                                          K2Node_Event_bProceed;                             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Accepted;                       // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowBenchmark_Return_Value;         // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2470[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2471[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_StatusText;                     // 0x00D0(0x0018)()
	class FText                                   K2Node_CustomEvent_FailReason;                     // 0x00E8(0x0018)()
	bool                                          CallFunc_StartAutoLogin_ReturnValue2;              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2472[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFort_Entry_Music_Controller_BP_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	class UWidget*                                K2Node_Event_Widget;                               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContentPushState                      K2Node_Event_State;                                // 0x0120(0x0003)(NoDestructor)
	uint8                                         Pad_2473[0x1];                                     // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2474[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoggingOut_ReturnValue;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2475[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoggedIn_ReturnValue;                   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2476[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEulaText_ReturnValue;                  // 0x0150(0x0018)()
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2477[0x3];                                     // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue2;            // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bLinkedAccountNeedsPurchase;          // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckNetworkError_ReturnValue;            // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckNetworkError_ReturnValue2;           // 0x0177(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2478[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2479[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Reason;                               // 0x0190(0x0018)()
	class AFort_Entry_Music_Controller_BP_C*      CallFunc_Array_Get_Item;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_247A[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Tile;                                 // 0x01B8(0x0018)()
	class FText                                   K2Node_Event_Body;                                 // 0x01D0(0x0018)()
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate3;             // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_247B[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_ErrorText;                            // 0x0200(0x0018)()
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMOTD_C*                                CallFunc_Create_ReturnValue;                       // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoggedIn_ReturnValue2;                  // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_247C[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	class UWidget*                                K2Node_CustomEvent_WebWidget;                      // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CloseWebLogin_bWasClosed;                 // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBROnly_ReturnValue2;                    // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_PlayedBefore;                   // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartManualLogin_ReturnValue2;            // 0x025B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_247D[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_CustomEvent_Button;                         // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortLoginAccountType                         K2Node_CustomEvent_ChosenCredential;               // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortLoginAccountType                         K2Node_CustomEvent_Platform;                       // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_ExecuteUbergraph_LoginScreen) == 0x000008, "Wrong alignment on LoginScreen_C_ExecuteUbergraph_LoginScreen");
static_assert(sizeof(LoginScreen_C_ExecuteUbergraph_LoginScreen) == 0x000270, "Wrong size on LoginScreen_C_ExecuteUbergraph_LoginScreen");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, EntryPoint) == 0x000000, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsBROnly_ReturnValue) == 0x000004, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsBROnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_PreviousUIState) == 0x000040, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_PreviousUIState' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_NextUIState) == 0x000041, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_NextUIState' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_LoginEmail) == 0x000048, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_LoginEmail' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_LoginPassword) == 0x000058, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_LoginPassword' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_Account_Type) == 0x000068, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_Account_Type' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue3) == 0x000070, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_StartManualLogin_ReturnValue) == 0x000078, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_StartManualLogin_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_StartAutoLogin_ReturnValue) == 0x000079, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_StartAutoLogin_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_Reason2) == 0x000080, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_Reason2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_EulaText) == 0x000098, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_EulaText' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_bProceed) == 0x0000B0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_bProceed' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, Temp_byte_Variable) == 0x0000B1, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_Accepted) == 0x0000B2, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_Accepted' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_SwitchEnum_CmpSuccess) == 0x0000B3, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, Temp_int_Loop_Counter_Variable) == 0x0000B4, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_ShouldShowBenchmark_Return_Value) == 0x0000BC, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_ShouldShowBenchmark_Return_Value' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue) == 0x0000C0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_StatusText) == 0x0000D0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_StatusText' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_FailReason) == 0x0000E8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_FailReason' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_StartAutoLogin_ReturnValue2) == 0x000100, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_StartAutoLogin_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetAllActorsOfClass_OutActors) == 0x000108, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_Widget) == 0x000118, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_State) == 0x000120, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Array_Length_ReturnValue) == 0x000124, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, Temp_name_Variable) == 0x000130, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsLoggingOut_ReturnValue) == 0x000138, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsLoggingOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_ComponentBoundEvent_Button) == 0x000140, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsLoggedIn_ReturnValue) == 0x000148, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetEulaText_ReturnValue) == 0x000150, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetEulaText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetChildrenCount_ReturnValue) == 0x000168, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Greater_IntInt_ReturnValue) == 0x00016C, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetChildrenCount_ReturnValue2) == 0x000170, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetChildrenCount_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Greater_IntInt_ReturnValue2) == 0x000174, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_bLinkedAccountNeedsPurchase) == 0x000175, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_bLinkedAccountNeedsPurchase' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_CheckNetworkError_ReturnValue) == 0x000176, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_CheckNetworkError_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_CheckNetworkError_ReturnValue2) == 0x000177, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_CheckNetworkError_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_Result) == 0x000178, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_ResultName) == 0x000180, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, Temp_int_Array_Index_Variable) == 0x000188, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_Reason) == 0x000190, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Array_Get_Item) == 0x0001A8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_bShow) == 0x0001B0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_bShow' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_Tile) == 0x0001B8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_Tile' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_Body) == 0x0001D0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_Body' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate3) == 0x0001E8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_BooleanOR_ReturnValue) == 0x0001F8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_ErrorText) == 0x000200, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_ErrorText' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000218, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue4) == 0x000220, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000228, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Create_ReturnValue) == 0x000230, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsLoggedIn_ReturnValue2) == 0x000238, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsLoggedIn_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate4) == 0x000240, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_WebWidget) == 0x000250, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_WebWidget' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_CloseWebLogin_bWasClosed) == 0x000258, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_CloseWebLogin_bWasClosed' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsBROnly_ReturnValue2) == 0x000259, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsBROnly_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_PlayedBefore) == 0x00025A, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_PlayedBefore' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_StartManualLogin_ReturnValue2) == 0x00025B, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_StartManualLogin_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_Button) == 0x000260, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_ChosenCredential) == 0x000268, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_ChosenCredential' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_SwitchEnum2_CmpSuccess) == 0x000269, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_Platform) == 0x00026A, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_Platform' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.HandleEpicAccountForward
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_HandleEpicAccountForward final
{
public:
	EFortLoginAccountType                         Platform;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_HandleEpicAccountForward) == 0x000001, "Wrong alignment on LoginScreen_C_HandleEpicAccountForward");
static_assert(sizeof(LoginScreen_C_HandleEpicAccountForward) == 0x000001, "Wrong size on LoginScreen_C_HandleEpicAccountForward");
static_assert(offsetof(LoginScreen_C_HandleEpicAccountForward, Platform) == 0x000000, "Member 'LoginScreen_C_HandleEpicAccountForward::Platform' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.HandleCredentialSelected
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_HandleCredentialSelected final
{
public:
	EFortLoginAccountType                         ChosenCredential;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_HandleCredentialSelected) == 0x000001, "Wrong alignment on LoginScreen_C_HandleCredentialSelected");
static_assert(sizeof(LoginScreen_C_HandleCredentialSelected) == 0x000001, "Wrong size on LoginScreen_C_HandleCredentialSelected");
static_assert(offsetof(LoginScreen_C_HandleCredentialSelected, ChosenCredential) == 0x000000, "Member 'LoginScreen_C_HandleCredentialSelected::ChosenCredential' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.TempBackEvent
// 0x0008 (0x0008 - 0x0000)
struct LoginScreen_C_TempBackEvent final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_TempBackEvent) == 0x000008, "Wrong alignment on LoginScreen_C_TempBackEvent");
static_assert(sizeof(LoginScreen_C_TempBackEvent) == 0x000008, "Wrong size on LoginScreen_C_TempBackEvent");
static_assert(offsetof(LoginScreen_C_TempBackEvent, Button) == 0x000000, "Member 'LoginScreen_C_TempBackEvent::Button' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.HandlePlayedBeforeSelected
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_HandlePlayedBeforeSelected final
{
public:
	bool                                          PlayedBefore;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_HandlePlayedBeforeSelected) == 0x000001, "Wrong alignment on LoginScreen_C_HandlePlayedBeforeSelected");
static_assert(sizeof(LoginScreen_C_HandlePlayedBeforeSelected) == 0x000001, "Wrong size on LoginScreen_C_HandlePlayedBeforeSelected");
static_assert(offsetof(LoginScreen_C_HandlePlayedBeforeSelected, PlayedBefore) == 0x000000, "Member 'LoginScreen_C_HandlePlayedBeforeSelected::PlayedBefore' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnWebLoginDisplay
// 0x0008 (0x0008 - 0x0000)
struct LoginScreen_C_OnWebLoginDisplay final
{
public:
	class UWidget*                                WebWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_OnWebLoginDisplay) == 0x000008, "Wrong alignment on LoginScreen_C_OnWebLoginDisplay");
static_assert(sizeof(LoginScreen_C_OnWebLoginDisplay) == 0x000008, "Wrong size on LoginScreen_C_OnWebLoginDisplay");
static_assert(offsetof(LoginScreen_C_OnWebLoginDisplay, WebWidget) == 0x000000, "Member 'LoginScreen_C_OnWebLoginDisplay::WebWidget' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnLoggedOutWithError
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_OnLoggedOutWithError final
{
public:
	class FText                                   ErrorText;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_OnLoggedOutWithError) == 0x000008, "Wrong alignment on LoginScreen_C_OnLoggedOutWithError");
static_assert(sizeof(LoginScreen_C_OnLoggedOutWithError) == 0x000018, "Wrong size on LoginScreen_C_OnLoggedOutWithError");
static_assert(offsetof(LoginScreen_C_OnLoggedOutWithError, ErrorText) == 0x000000, "Member 'LoginScreen_C_OnLoggedOutWithError::ErrorText' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnShowLoginMessage
// 0x0038 (0x0038 - 0x0000)
struct LoginScreen_C_OnShowLoginMessage final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_247E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Tile;                                              // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Body;                                              // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_OnShowLoginMessage) == 0x000008, "Wrong alignment on LoginScreen_C_OnShowLoginMessage");
static_assert(sizeof(LoginScreen_C_OnShowLoginMessage) == 0x000038, "Wrong size on LoginScreen_C_OnShowLoginMessage");
static_assert(offsetof(LoginScreen_C_OnShowLoginMessage, bShow) == 0x000000, "Member 'LoginScreen_C_OnShowLoginMessage::bShow' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnShowLoginMessage, Tile) == 0x000008, "Member 'LoginScreen_C_OnShowLoginMessage::Tile' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnShowLoginMessage, Body) == 0x000020, "Member 'LoginScreen_C_OnShowLoginMessage::Body' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnPostLoginLogoutComplete
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_OnPostLoginLogoutComplete final
{
public:
	class FText                                   Reason;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_OnPostLoginLogoutComplete) == 0x000008, "Wrong alignment on LoginScreen_C_OnPostLoginLogoutComplete");
static_assert(sizeof(LoginScreen_C_OnPostLoginLogoutComplete) == 0x000018, "Wrong size on LoginScreen_C_OnPostLoginLogoutComplete");
static_assert(offsetof(LoginScreen_C_OnPostLoginLogoutComplete, Reason) == 0x000000, "Member 'LoginScreen_C_OnPostLoginLogoutComplete::Reason' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnNeedsPurchaseOrAccountLinking
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_OnNeedsPurchaseOrAccountLinking final
{
public:
	bool                                          bLinkedAccountNeedsPurchase;                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_OnNeedsPurchaseOrAccountLinking) == 0x000001, "Wrong alignment on LoginScreen_C_OnNeedsPurchaseOrAccountLinking");
static_assert(sizeof(LoginScreen_C_OnNeedsPurchaseOrAccountLinking) == 0x000001, "Wrong size on LoginScreen_C_OnNeedsPurchaseOrAccountLinking");
static_assert(offsetof(LoginScreen_C_OnNeedsPurchaseOrAccountLinking, bLinkedAccountNeedsPurchase) == 0x000000, "Member 'LoginScreen_C_OnNeedsPurchaseOrAccountLinking::bLinkedAccountNeedsPurchase' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.PushContentWidgetInternal
// 0x0010 (0x0010 - 0x0000)
struct LoginScreen_C_PushContentWidgetInternal final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContentPushState                      State;                                             // 0x0008(0x0003)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(LoginScreen_C_PushContentWidgetInternal) == 0x000008, "Wrong alignment on LoginScreen_C_PushContentWidgetInternal");
static_assert(sizeof(LoginScreen_C_PushContentWidgetInternal) == 0x000010, "Wrong size on LoginScreen_C_PushContentWidgetInternal");
static_assert(offsetof(LoginScreen_C_PushContentWidgetInternal, Widget) == 0x000000, "Member 'LoginScreen_C_PushContentWidgetInternal::Widget' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_PushContentWidgetInternal, State) == 0x000008, "Member 'LoginScreen_C_PushContentWidgetInternal::State' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.AccountLinking_LinkingFailed
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_AccountLinking_LinkingFailed final
{
public:
	class FText                                   FailReason;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(LoginScreen_C_AccountLinking_LinkingFailed) == 0x000008, "Wrong alignment on LoginScreen_C_AccountLinking_LinkingFailed");
static_assert(sizeof(LoginScreen_C_AccountLinking_LinkingFailed) == 0x000018, "Wrong size on LoginScreen_C_AccountLinking_LinkingFailed");
static_assert(offsetof(LoginScreen_C_AccountLinking_LinkingFailed, FailReason) == 0x000000, "Member 'LoginScreen_C_AccountLinking_LinkingFailed::FailReason' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.AccountLinking_PushStatus
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_AccountLinking_PushStatus final
{
public:
	class FText                                   StatusText;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(LoginScreen_C_AccountLinking_PushStatus) == 0x000008, "Wrong alignment on LoginScreen_C_AccountLinking_PushStatus");
static_assert(sizeof(LoginScreen_C_AccountLinking_PushStatus) == 0x000018, "Wrong size on LoginScreen_C_AccountLinking_PushStatus");
static_assert(offsetof(LoginScreen_C_AccountLinking_PushStatus, StatusText) == 0x000000, "Member 'LoginScreen_C_AccountLinking_PushStatus::StatusText' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.HandleEulaResponse
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_HandleEulaResponse final
{
public:
	bool                                          Accepted;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_HandleEulaResponse) == 0x000001, "Wrong alignment on LoginScreen_C_HandleEulaResponse");
static_assert(sizeof(LoginScreen_C_HandleEulaResponse) == 0x000001, "Wrong size on LoginScreen_C_HandleEulaResponse");
static_assert(offsetof(LoginScreen_C_HandleEulaResponse, Accepted) == 0x000000, "Member 'LoginScreen_C_HandleEulaResponse::Accepted' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnPatchingComplete
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_OnPatchingComplete final
{
public:
	bool                                          bProceed;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_OnPatchingComplete) == 0x000001, "Wrong alignment on LoginScreen_C_OnPatchingComplete");
static_assert(sizeof(LoginScreen_C_OnPatchingComplete) == 0x000001, "Wrong size on LoginScreen_C_OnPatchingComplete");
static_assert(offsetof(LoginScreen_C_OnPatchingComplete, bProceed) == 0x000000, "Member 'LoginScreen_C_OnPatchingComplete::bProceed' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnEulaAvailable
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_OnEulaAvailable final
{
public:
	class FText                                   EulaText;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_OnEulaAvailable) == 0x000008, "Wrong alignment on LoginScreen_C_OnEulaAvailable");
static_assert(sizeof(LoginScreen_C_OnEulaAvailable) == 0x000018, "Wrong size on LoginScreen_C_OnEulaAvailable");
static_assert(offsetof(LoginScreen_C_OnEulaAvailable, EulaText) == 0x000000, "Member 'LoginScreen_C_OnEulaAvailable::EulaText' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnLoginFailed
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_OnLoginFailed final
{
public:
	class FText                                   Reason;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_OnLoginFailed) == 0x000008, "Wrong alignment on LoginScreen_C_OnLoginFailed");
static_assert(sizeof(LoginScreen_C_OnLoginFailed) == 0x000018, "Wrong size on LoginScreen_C_OnLoginFailed");
static_assert(offsetof(LoginScreen_C_OnLoginFailed, Reason) == 0x000000, "Member 'LoginScreen_C_OnLoginFailed::Reason' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.HandleOnStartLogin
// 0x0028 (0x0028 - 0x0000)
struct LoginScreen_C_HandleOnStartLogin final
{
public:
	class FString                                 LoginEmail;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LoginPassword;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EExternalAccountType                          Account_Type;                                      // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_HandleOnStartLogin) == 0x000008, "Wrong alignment on LoginScreen_C_HandleOnStartLogin");
static_assert(sizeof(LoginScreen_C_HandleOnStartLogin) == 0x000028, "Wrong size on LoginScreen_C_HandleOnStartLogin");
static_assert(offsetof(LoginScreen_C_HandleOnStartLogin, LoginEmail) == 0x000000, "Member 'LoginScreen_C_HandleOnStartLogin::LoginEmail' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_HandleOnStartLogin, LoginPassword) == 0x000010, "Member 'LoginScreen_C_HandleOnStartLogin::LoginPassword' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_HandleOnStartLogin, Account_Type) == 0x000020, "Member 'LoginScreen_C_HandleOnStartLogin::Account_Type' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnExitState
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_OnExitState final
{
public:
	EFortUIState                                  NextUIState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_OnExitState) == 0x000001, "Wrong alignment on LoginScreen_C_OnExitState");
static_assert(sizeof(LoginScreen_C_OnExitState) == 0x000001, "Wrong size on LoginScreen_C_OnExitState");
static_assert(offsetof(LoginScreen_C_OnExitState, NextUIState) == 0x000000, "Member 'LoginScreen_C_OnExitState::NextUIState' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnEnterState
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_OnEnterState final
{
public:
	EFortUIState                                  PreviousUIState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_OnEnterState) == 0x000001, "Wrong alignment on LoginScreen_C_OnEnterState");
static_assert(sizeof(LoginScreen_C_OnEnterState) == 0x000001, "Wrong size on LoginScreen_C_OnEnterState");
static_assert(offsetof(LoginScreen_C_OnEnterState, PreviousUIState) == 0x000000, "Member 'LoginScreen_C_OnEnterState::PreviousUIState' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.DialogResult_B952A8754B3836D2151B4981F531542E
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_247F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E) == 0x000008, "Wrong alignment on LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E");
static_assert(sizeof(LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E) == 0x000010, "Wrong size on LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E");
static_assert(offsetof(LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E, Result) == 0x000000, "Member 'LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E::Result' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E, ResultName) == 0x000008, "Member 'LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E::ResultName' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.ShowSignInWindow
// 0x0030 (0x0030 - 0x0000)
struct LoginScreen_C_ShowSignInWindow final
{
public:
	bool                                          DirectSignin;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2480[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Email, const class FString& Password, EExternalAccountType InAccountType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USignInWidget_C*                        CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_ShowSignInWindow) == 0x000008, "Wrong alignment on LoginScreen_C_ShowSignInWindow");
static_assert(sizeof(LoginScreen_C_ShowSignInWindow) == 0x000030, "Wrong size on LoginScreen_C_ShowSignInWindow");
static_assert(offsetof(LoginScreen_C_ShowSignInWindow, DirectSignin) == 0x000000, "Member 'LoginScreen_C_ShowSignInWindow::DirectSignin' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowSignInWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'LoginScreen_C_ShowSignInWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowSignInWindow, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'LoginScreen_C_ShowSignInWindow::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowSignInWindow, CallFunc_Create_ReturnValue) == 0x000020, "Member 'LoginScreen_C_ShowSignInWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowSignInWindow, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'LoginScreen_C_ShowSignInWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.ShowStatusWindow
// 0x0070 (0x0070 - 0x0000)
struct LoginScreen_C_ShowStatusWindow final
{
public:
	class FText                                   StatusText;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   LocalStatusText;                                   // 0x0018(0x0018)(Edit, BlueprintVisible)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2481[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStatusWidget_C*                        CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_ShowStatusWindow) == 0x000008, "Wrong alignment on LoginScreen_C_ShowStatusWindow");
static_assert(sizeof(LoginScreen_C_ShowStatusWindow) == 0x000070, "Wrong size on LoginScreen_C_ShowStatusWindow");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, StatusText) == 0x000000, "Member 'LoginScreen_C_ShowStatusWindow::StatusText' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, LocalStatusText) == 0x000018, "Member 'LoginScreen_C_ShowStatusWindow::LocalStatusText' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, CallFunc_GetVisibility_ReturnValue) == 0x000030, "Member 'LoginScreen_C_ShowStatusWindow::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000038, "Member 'LoginScreen_C_ShowStatusWindow::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'LoginScreen_C_ShowStatusWindow::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'LoginScreen_C_ShowStatusWindow::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, CallFunc_Create_ReturnValue) == 0x000060, "Member 'LoginScreen_C_ShowStatusWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'LoginScreen_C_ShowStatusWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.ShowAccountLinkingWindow
// 0x00A0 (0x00A0 - 0x0000)
struct LoginScreen_C_ShowAccountLinkingWindow final
{
public:
	bool                                          InLinkedAccountNeedsPurchase;                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2482[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_GetPlatformDisplayName_ReturnValue;       // 0x0018(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FText FailReason)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FText StatusText)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccountLinkingWindow_C*                CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccountLinkingWindow_C*                K2Node_DynamicCast_AsAccount_Linking_Window;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_ShowAccountLinkingWindow) == 0x000008, "Wrong alignment on LoginScreen_C_ShowAccountLinkingWindow");
static_assert(sizeof(LoginScreen_C_ShowAccountLinkingWindow) == 0x0000A0, "Wrong size on LoginScreen_C_ShowAccountLinkingWindow");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, InLinkedAccountNeedsPurchase) == 0x000000, "Member 'LoginScreen_C_ShowAccountLinkingWindow::InLinkedAccountNeedsPurchase' has a wrong offset!");
