#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuScreen_Commando

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MenuScreen_Commando.MenuScreen_Commando_C
// 0x0498 (0x08D8 - 0x0440)
class UMenuScreen_Commando_C final : public UFrontendAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F70AA5C441806953E84736BA8BC1318A; // 0x0448(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_476FB3144FF01CDECEC25D9FCA0BF170; // 0x0490(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_78BB02D34BB0CD13E52B729CD15EC48B; // 0x04D8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_30CEFFAA4FD7F57FD5A6EDB40D31DE9D; // 0x0520(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ECCC70F04489C85C49B82FB532A3D3A9; // 0x0590(0x0070)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_A3E599E943E9B22B3BC78EA28C49C57B; // 0x0600(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CDEB41CC42B9DE30260861A50A7F4D48; // 0x06E0(0x0070)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_0FF63B634F69D86C980667A0EF7099ED; // 0x0750(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_E4328FA745CE2162C4FC048495DF6B7C; // 0x07F0(0x00B8)()
	UMulticastDelegateProperty_                   MenuScreenDispatcher;                              // 0x08A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HasBeenSelected;                                   // 0x08B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D6[0x3];                                     // 0x08B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OffsetTranslate;                                   // 0x08BC(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OffsetRotate;                                      // 0x08C8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void MenuScreenDispatcher__DelegateSignature();
	void ExecuteUbergraph_MenuScreen_Commando(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_LeftB();
	void AnimNotify_playFacialAnim();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MenuScreen_Commando_AnimGraphNode_BlendListByEnum_A3E599E943E9B22B3BC78EA28C49C57B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MenuScreen_Commando_AnimGraphNode_ModifyBone_E4328FA745CE2162C4FC048495DF6B7C();
	void UserFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MenuScreen_Commando_C">();
	}
	static class UMenuScreen_Commando_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenuScreen_Commando_C>();
	}
};
static_assert(alignof(UMenuScreen_Commando_C) == 0x000008, "Wrong alignment on UMenuScreen_Commando_C");
static_assert(sizeof(UMenuScreen_Commando_C) == 0x0008D8, "Wrong size on UMenuScreen_Commando_C");
static_assert(offsetof(UMenuScreen_Commando_C, UberGraphFrame) == 0x000440, "Member 'UMenuScreen_Commando_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Commando_C, AnimGraphNode_Root_F70AA5C441806953E84736BA8BC1318A) == 0x000448, "Member 'UMenuScreen_Commando_C::AnimGraphNode_Root_F70AA5C441806953E84736BA8BC1318A' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Commando_C, AnimGraphNode_LocalToComponentSpace_476FB3144FF01CDECEC25D9FCA0BF170) == 0x000490, "Member 'UMenuScreen_Commando_C::AnimGraphNode_LocalToComponentSpace_476FB3144FF01CDECEC25D9FCA0BF170' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Commando_C, AnimGraphNode_ComponentToLocalSpace_78BB02D34BB0CD13E52B729CD15EC48B) == 0x0004D8, "Member 'UMenuScreen_Commando_C::AnimGraphNode_ComponentToLocalSpace_78BB02D34BB0CD13E52B729CD15EC48B' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Commando_C, AnimGraphNode_Slot_30CEFFAA4FD7F57FD5A6EDB40D31DE9D) == 0x000520, "Member 'UMenuScreen_Commando_C::AnimGraphNode_Slot_30CEFFAA4FD7F57FD5A6EDB40D31DE9D' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Commando_C, AnimGraphNode_SequencePlayer_ECCC70F04489C85C49B82FB532A3D3A9) == 0x000590, "Member 'UMenuScreen_Commando_C::AnimGraphNode_SequencePlayer_ECCC70F04489C85C49B82FB532A3D3A9' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Commando_C, AnimGraphNode_BlendListByEnum_A3E599E943E9B22B3BC78EA28C49C57B) == 0x000600, "Member 'UMenuScreen_Commando_C::AnimGraphNode_BlendListByEnum_A3E599E943E9B22B3BC78EA28C49C57B' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Commando_C, AnimGraphNode_SequencePlayer_CDEB41CC42B9DE30260861A50A7F4D48) == 0x0006E0, "Member 'UMenuScreen_Commando_C::AnimGraphNode_SequencePlayer_CDEB41CC42B9DE30260861A50A7F4D48' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Commando_C, AnimGraphNode_LegIK_0FF63B634F69D86C980667A0EF7099ED) == 0x000750, "Member 'UMenuScreen_Commando_C::AnimGraphNode_LegIK_0FF63B634F69D86C980667A0EF7099ED' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Commando_C, AnimGraphNode_ModifyBone_E4328FA745CE2162C4FC048495DF6B7C) == 0x0007F0, "Member 'UMenuScreen_Commando_C::AnimGraphNode_ModifyBone_E4328FA745CE2162C4FC048495DF6B7C' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Commando_C, MenuScreenDispatcher) == 0x0008A8, "Member 'UMenuScreen_Commando_C::MenuScreenDispatcher' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Commando_C, HasBeenSelected) == 0x0008B8, "Member 'UMenuScreen_Commando_C::HasBeenSelected' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Commando_C, OffsetTranslate) == 0x0008BC, "Member 'UMenuScreen_Commando_C::OffsetTranslate' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Commando_C, OffsetRotate) == 0x0008C8, "Member 'UMenuScreen_Commando_C::OffsetRotate' has a wrong offset!");

}

