#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenuSetting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function OptionsMenuSetting.OptionsMenuSetting_C.SettingValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuSetting_C_SettingValueChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_SettingValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on OptionsMenuSetting_C_SettingValueChanged__DelegateSignature");
static_assert(sizeof(OptionsMenuSetting_C_SettingValueChanged__DelegateSignature) == 0x000004, "Wrong size on OptionsMenuSetting_C_SettingValueChanged__DelegateSignature");
static_assert(offsetof(OptionsMenuSetting_C_SettingValueChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'OptionsMenuSetting_C_SettingValueChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.ExecuteUbergraph_OptionsMenuSetting
// 0x0248 (0x0248 - 0x0000)
struct OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A8[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A9[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable3;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36AA[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable5;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36AB[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable3;                              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable4;                              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36AC[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* Widget)>    K2Node_Event_Callback;                             // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bExpanded;                            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36AD[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InIndexInList;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelected;                            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36AE[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent2;                          // 0x0068(0x0068)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00D8(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0110(0x0068)()
	float                                         K2Node_ComponentBoundEvent_Value3;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value2;                 // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0180(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor2;                    // 0x0190(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue2;                    // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue3;                    // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36AF[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Value;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B0[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_InData;                               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        K2Node_Event_OwningList;                           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B1[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSettingInfo*                       K2Node_DynamicCast_AsFort_Setting_Info;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36B2[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select2_Default;                            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select3_Default;                            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select4_Default;                            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36B3[0x2];                                     // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B4[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           CallFunc_GetSettingDisplayNames_ReturnValue;       // 0x01F8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Variable5;                               // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36B5[0x3];                                     // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select5_Default;                            // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36B6[0x3];                                     // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select6_Default;                            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B7[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0230(0x0018)()
};
static_assert(alignof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting");
static_assert(sizeof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting) == 0x000248, "Wrong size on OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, EntryPoint) == 0x000000, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::EntryPoint' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_float_Variable) == 0x000004, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_float_Variable2) == 0x000008, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_bool_Variable) == 0x00000C, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_int_Variable) == 0x000010, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_int_Variable2) == 0x000014, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_bool_Variable2) == 0x000018, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_int_Variable3) == 0x00001C, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_int_Variable4) == 0x000020, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_bool_Variable3) == 0x000024, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_int_Variable5) == 0x000028, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_int_Variable6) == 0x00002C, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_bool_Variable4) == 0x000030, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_float_Variable3) == 0x000034, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_float_Variable4) == 0x000038, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_float_Variable4' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_Callback) == 0x000040, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_Callback' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_bExpanded) == 0x000050, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_bExpanded' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_InIndexInList) == 0x000054, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_InIndexInList' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_bSelected) == 0x000058, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_bSelected' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_MakeLiteralName_ReturnValue) == 0x000060, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_MouseEvent2) == 0x000068, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_MouseEvent2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_MyGeometry) == 0x0000D8, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_MouseEvent) == 0x000110, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_ComponentBoundEvent_Value3) == 0x000178, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_ComponentBoundEvent_Value3' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_ComponentBoundEvent_Value2) == 0x00017C, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_ComponentBoundEvent_Value2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_MakeStruct_LinearColor) == 0x000180, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_MakeStruct_LinearColor2) == 0x000190, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_MakeStruct_LinearColor2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_GetValue_ReturnValue) == 0x0001A0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_GetValue_ReturnValue2) == 0x0001A4, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_GetValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_GetValue_ReturnValue3) == 0x0001A8, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_GetValue_ReturnValue3' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001AC, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_ComponentBoundEvent_Value) == 0x0001B0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_InData) == 0x0001B8, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_InData' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Event_OwningList) == 0x0001C0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Event_OwningList' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001C8, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_DynamicCast_AsFort_Setting_Info) == 0x0001D0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_DynamicCast_AsFort_Setting_Info' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Select_Default) == 0x0001DC, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Select2_Default) == 0x0001E0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Select3_Default) == 0x0001E4, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Select4_Default) == 0x0001E8, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001EC, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x0001ED, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0001F0, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_GetSettingDisplayNames_ReturnValue) == 0x0001F8, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_GetSettingDisplayNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_bool_Variable5) == 0x000208, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Select5_Default) == 0x00020C, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, Temp_bool_Variable6) == 0x000210, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_Select6_Default) == 0x000214, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_ComponentBoundEvent_Button2) == 0x000218, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000220, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, K2Node_ComponentBoundEvent_Button) == 0x000228, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting, CallFunc_Conv_FloatToText_ReturnValue) == 0x000230, "Member 'OptionsMenuSetting_C_ExecuteUbergraph_OptionsMenuSetting::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.BndEvt__ButtonRight_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuSetting_C_BndEvt__ButtonRight_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_BndEvt__ButtonRight_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_BndEvt__ButtonRight_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(OptionsMenuSetting_C_BndEvt__ButtonRight_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenuSetting_C_BndEvt__ButtonRight_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(OptionsMenuSetting_C_BndEvt__ButtonRight_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'OptionsMenuSetting_C_BndEvt__ButtonRight_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuSetting_C_BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(OptionsMenuSetting_C_BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenuSetting_C_BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(OptionsMenuSetting_C_BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'OptionsMenuSetting_C_BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.SetData
// 0x0010 (0x0010 - 0x0000)
struct OptionsMenuSetting_C_SetData final
{
public:
	class UObject*                                InData;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        OwningList;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_SetData) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_SetData");
static_assert(sizeof(OptionsMenuSetting_C_SetData) == 0x000010, "Wrong size on OptionsMenuSetting_C_SetData");
static_assert(offsetof(OptionsMenuSetting_C_SetData, InData) == 0x000000, "Member 'OptionsMenuSetting_C_SetData::InData' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_SetData, OwningList) == 0x000008, "Member 'OptionsMenuSetting_C_SetData::OwningList' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.BndEvt__TextRotator_K2Node_ComponentBoundEvent_20_OnRotated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuSetting_C_BndEvt__TextRotator_K2Node_ComponentBoundEvent_20_OnRotated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_BndEvt__TextRotator_K2Node_ComponentBoundEvent_20_OnRotated__DelegateSignature) == 0x000004, "Wrong alignment on OptionsMenuSetting_C_BndEvt__TextRotator_K2Node_ComponentBoundEvent_20_OnRotated__DelegateSignature");
static_assert(sizeof(OptionsMenuSetting_C_BndEvt__TextRotator_K2Node_ComponentBoundEvent_20_OnRotated__DelegateSignature) == 0x000004, "Wrong size on OptionsMenuSetting_C_BndEvt__TextRotator_K2Node_ComponentBoundEvent_20_OnRotated__DelegateSignature");
static_assert(offsetof(OptionsMenuSetting_C_BndEvt__TextRotator_K2Node_ComponentBoundEvent_20_OnRotated__DelegateSignature, Value) == 0x000000, "Member 'OptionsMenuSetting_C_BndEvt__TextRotator_K2Node_ComponentBoundEvent_20_OnRotated__DelegateSignature::Value' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'OptionsMenuSetting_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.OnMouseEnter
// 0x00A0 (0x00A0 - 0x0000)
struct OptionsMenuSetting_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsMenuSetting_C_OnMouseEnter) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_OnMouseEnter");
static_assert(sizeof(OptionsMenuSetting_C_OnMouseEnter) == 0x0000A0, "Wrong size on OptionsMenuSetting_C_OnMouseEnter");
static_assert(offsetof(OptionsMenuSetting_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'OptionsMenuSetting_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'OptionsMenuSetting_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.OnMouseLeave
// 0x0068 (0x0068 - 0x0000)
struct OptionsMenuSetting_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsMenuSetting_C_OnMouseLeave) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_OnMouseLeave");
static_assert(sizeof(OptionsMenuSetting_C_OnMouseLeave) == 0x000068, "Wrong size on OptionsMenuSetting_C_OnMouseLeave");
static_assert(offsetof(OptionsMenuSetting_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'OptionsMenuSetting_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenuSetting_C_SetSelected final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuSetting_C_SetSelected) == 0x000001, "Wrong alignment on OptionsMenuSetting_C_SetSelected");
static_assert(sizeof(OptionsMenuSetting_C_SetSelected) == 0x000001, "Wrong size on OptionsMenuSetting_C_SetSelected");
static_assert(offsetof(OptionsMenuSetting_C_SetSelected, bSelected) == 0x000000, "Member 'OptionsMenuSetting_C_SetSelected::bSelected' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.SetIndexInList
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuSetting_C_SetIndexInList final
{
public:
	int32                                         InIndexInList;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_SetIndexInList) == 0x000004, "Wrong alignment on OptionsMenuSetting_C_SetIndexInList");
static_assert(sizeof(OptionsMenuSetting_C_SetIndexInList) == 0x000004, "Wrong size on OptionsMenuSetting_C_SetIndexInList");
static_assert(offsetof(OptionsMenuSetting_C_SetIndexInList, InIndexInList) == 0x000000, "Member 'OptionsMenuSetting_C_SetIndexInList::InIndexInList' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.SetExpanded
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenuSetting_C_SetExpanded final
{
public:
	bool                                          bExpanded;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuSetting_C_SetExpanded) == 0x000001, "Wrong alignment on OptionsMenuSetting_C_SetExpanded");
static_assert(sizeof(OptionsMenuSetting_C_SetExpanded) == 0x000001, "Wrong size on OptionsMenuSetting_C_SetExpanded");
static_assert(offsetof(OptionsMenuSetting_C_SetExpanded, bExpanded) == 0x000000, "Member 'OptionsMenuSetting_C_SetExpanded::bExpanded' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.RegisterOnClicked
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) OptionsMenuSetting_C_RegisterOnClicked final
{
public:
	TDelegate<void(class UUserWidget* Widget)>    Callback;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
};
static_assert(alignof(OptionsMenuSetting_C_RegisterOnClicked) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_RegisterOnClicked");
static_assert(sizeof(OptionsMenuSetting_C_RegisterOnClicked) == 0x000010, "Wrong size on OptionsMenuSetting_C_RegisterOnClicked");
static_assert(offsetof(OptionsMenuSetting_C_RegisterOnClicked, Callback) == 0x000000, "Member 'OptionsMenuSetting_C_RegisterOnClicked::Callback' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.Center on Widget
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuSetting_C_Center_on_Widget final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_Center_on_Widget) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_Center_on_Widget");
static_assert(sizeof(OptionsMenuSetting_C_Center_on_Widget) == 0x000008, "Wrong size on OptionsMenuSetting_C_Center_on_Widget");
static_assert(offsetof(OptionsMenuSetting_C_Center_on_Widget, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'OptionsMenuSetting_C_Center_on_Widget::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.OnFocusReceived
// 0x01D0 (0x01D0 - 0x0000)
struct OptionsMenuSetting_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B8[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0108(0x00B8)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36B9[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue2;      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_OnFocusReceived) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_OnFocusReceived");
static_assert(sizeof(OptionsMenuSetting_C_OnFocusReceived) == 0x0001D0, "Wrong size on OptionsMenuSetting_C_OnFocusReceived");
static_assert(offsetof(OptionsMenuSetting_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'OptionsMenuSetting_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'OptionsMenuSetting_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'OptionsMenuSetting_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_OnFocusReceived, CallFunc_GetUINavigationManager_ReturnValue) == 0x0000F8, "Member 'OptionsMenuSetting_C_OnFocusReceived::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_OnFocusReceived, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000100, "Member 'OptionsMenuSetting_C_OnFocusReceived::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000108, "Member 'OptionsMenuSetting_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_OnFocusReceived, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001C0, "Member 'OptionsMenuSetting_C_OnFocusReceived::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_OnFocusReceived, CallFunc_GetUINavigationManager_ReturnValue2) == 0x0001C8, "Member 'OptionsMenuSetting_C_OnFocusReceived::CallFunc_GetUINavigationManager_ReturnValue2' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.Update Setting
// 0x0038 (0x0038 - 0x0000)
struct OptionsMenuSetting_C_Update_Setting final
{
public:
	class UCommonTextBlock*                       Tooltip_Text_Block;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSettingValue_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36BA[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0020(0x0018)()
};
static_assert(alignof(OptionsMenuSetting_C_Update_Setting) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_Update_Setting");
static_assert(sizeof(OptionsMenuSetting_C_Update_Setting) == 0x000038, "Wrong size on OptionsMenuSetting_C_Update_Setting");
static_assert(offsetof(OptionsMenuSetting_C_Update_Setting, Tooltip_Text_Block) == 0x000000, "Member 'OptionsMenuSetting_C_Update_Setting::Tooltip_Text_Block' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_Update_Setting, CallFunc_MakeLiteralName_ReturnValue) == 0x000008, "Member 'OptionsMenuSetting_C_Update_Setting::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_Update_Setting, CallFunc_GetSettingValue_ReturnValue) == 0x000010, "Member 'OptionsMenuSetting_C_Update_Setting::CallFunc_GetSettingValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_Update_Setting, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'OptionsMenuSetting_C_Update_Setting::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_Update_Setting, CallFunc_FTrunc_ReturnValue) == 0x000018, "Member 'OptionsMenuSetting_C_Update_Setting::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_Update_Setting, CallFunc_Conv_FloatToText_ReturnValue) == 0x000020, "Member 'OptionsMenuSetting_C_Update_Setting::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.UpdateSize
// 0x0138 (0x0138 - 0x0000)
struct OptionsMenuSetting_C_UpdateSize final
{
public:
	struct FVector2D                              LargeSize;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              SmallSize;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBROnly_ReturnValue;                     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBROnly_ReturnValue2;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              K2Node_Select_Default;                             // 0x001C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36BB[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable2;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select2_Default;                            // 0x0030(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36BC[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select3_Default;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0048(0x0078)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush2;                     // 0x00C0(0x0078)()
};
static_assert(alignof(OptionsMenuSetting_C_UpdateSize) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_UpdateSize");
static_assert(sizeof(OptionsMenuSetting_C_UpdateSize) == 0x000138, "Wrong size on OptionsMenuSetting_C_UpdateSize");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, LargeSize) == 0x000000, "Member 'OptionsMenuSetting_C_UpdateSize::LargeSize' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, SmallSize) == 0x000008, "Member 'OptionsMenuSetting_C_UpdateSize::SmallSize' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, Temp_class_Variable) == 0x000010, "Member 'OptionsMenuSetting_C_UpdateSize::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, Temp_bool_Variable) == 0x000018, "Member 'OptionsMenuSetting_C_UpdateSize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, Temp_bool_Variable2) == 0x000019, "Member 'OptionsMenuSetting_C_UpdateSize::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, CallFunc_IsBROnly_ReturnValue) == 0x00001A, "Member 'OptionsMenuSetting_C_UpdateSize::CallFunc_IsBROnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, CallFunc_IsBROnly_ReturnValue2) == 0x00001B, "Member 'OptionsMenuSetting_C_UpdateSize::CallFunc_IsBROnly_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, K2Node_Select_Default) == 0x00001C, "Member 'OptionsMenuSetting_C_UpdateSize::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, Temp_class_Variable2) == 0x000028, "Member 'OptionsMenuSetting_C_UpdateSize::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, K2Node_Select2_Default) == 0x000030, "Member 'OptionsMenuSetting_C_UpdateSize::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, Temp_bool_Variable3) == 0x000038, "Member 'OptionsMenuSetting_C_UpdateSize::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, K2Node_Select3_Default) == 0x000040, "Member 'OptionsMenuSetting_C_UpdateSize::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, K2Node_MakeStruct_SlateBrush) == 0x000048, "Member 'OptionsMenuSetting_C_UpdateSize::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(OptionsMenuSetting_C_UpdateSize, K2Node_MakeStruct_SlateBrush2) == 0x0000C0, "Member 'OptionsMenuSetting_C_UpdateSize::K2Node_MakeStruct_SlateBrush2' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.GetData
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuSetting_C_GetData final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_GetData) == 0x000008, "Wrong alignment on OptionsMenuSetting_C_GetData");
static_assert(sizeof(OptionsMenuSetting_C_GetData) == 0x000008, "Wrong size on OptionsMenuSetting_C_GetData");
static_assert(offsetof(OptionsMenuSetting_C_GetData, ReturnValue) == 0x000000, "Member 'OptionsMenuSetting_C_GetData::ReturnValue' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.IsItemExpanded
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenuSetting_C_IsItemExpanded final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuSetting_C_IsItemExpanded) == 0x000001, "Wrong alignment on OptionsMenuSetting_C_IsItemExpanded");
static_assert(sizeof(OptionsMenuSetting_C_IsItemExpanded) == 0x000001, "Wrong size on OptionsMenuSetting_C_IsItemExpanded");
static_assert(offsetof(OptionsMenuSetting_C_IsItemExpanded, ReturnValue) == 0x000000, "Member 'OptionsMenuSetting_C_IsItemExpanded::ReturnValue' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.DoesItemHaveChildren
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuSetting_C_DoesItemHaveChildren final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_DoesItemHaveChildren) == 0x000004, "Wrong alignment on OptionsMenuSetting_C_DoesItemHaveChildren");
static_assert(sizeof(OptionsMenuSetting_C_DoesItemHaveChildren) == 0x000004, "Wrong size on OptionsMenuSetting_C_DoesItemHaveChildren");
static_assert(offsetof(OptionsMenuSetting_C_DoesItemHaveChildren, ReturnValue) == 0x000000, "Member 'OptionsMenuSetting_C_DoesItemHaveChildren::ReturnValue' has a wrong offset!");

// Function OptionsMenuSetting.OptionsMenuSetting_C.GetIndentLevel
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuSetting_C_GetIndentLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSetting_C_GetIndentLevel) == 0x000004, "Wrong alignment on OptionsMenuSetting_C_GetIndentLevel");
static_assert(sizeof(OptionsMenuSetting_C_GetIndentLevel) == 0x000004, "Wrong size on OptionsMenuSetting_C_GetIndentLevel");
static_assert(offsetof(OptionsMenuSetting_C_GetIndentLevel, ReturnValue) == 0x000000, "Member 'OptionsMenuSetting_C_GetIndentLevel::ReturnValue' has a wrong offset!");

}

