#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Parent_BuildingPropActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DayPhaseFloats_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Parent_BuildingPropActor.Parent_BuildingPropActor_C
// 0x00D0 (0x0F20 - 0x0E50)
class AParent_BuildingPropActor_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E50(0x0008)(Transient, DuplicateTransient)
	bool                                          DebugWind;                                         // 0x0E58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4233[0x7];                                     // 0x0E59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             IntenseWindMaterialsForPreview;                    // 0x0E60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             OriginalMaterials;                                 // 0x0E70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UStaticMeshComponent*                   Wind_Intensity_Debug_Mesh;                         // 0x0E80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Debug_TempMaterial;                                // 0x0E88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Debug_Wind_Intensity;                              // 0x0E90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DebugWindYaw;                                      // 0x0E94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDayPhaseFloats                        Light_Intensity_Over_Time_of_Day_;                 // 0x0E98(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FDayPhaseFloats                        Emissive_Intensity_Over_Time_of_Day;               // 0x0EA8(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         CodeControlled_NumberOfMaterials;                  // 0x0EB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4234[0x4];                                     // 0x0EBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   CodeControlled_EmissiveColor;                      // 0x0EC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                 CodeControlled_LightConeOpacity;                   // 0x0ED0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          Animate_Emissive_and_Lights_Over_Time;             // 0x0EE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_4235[0x3];                                     // 0x0EE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Day_Phase_Transition_Length;                       // 0x0EE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable_TOD_Lights_and_Material_Emissive_Values;   // 0x0EE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active; // 0x0EE9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4236[0x6];                                     // 0x0EEA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            AlternateShadowStaticMesh;                         // 0x0EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_An_Alternate_Shadow_Mesh_When_The_Light_is_Off_; // 0x0EF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4237[0x3];                                     // 0x0EF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Volumetric_Light_Scattering_Intensity;             // 0x0EFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cast_Volumetric_Shadows;                           // 0x0F00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Animate_Lights_With_A_Curve_Minus_Disables_time_of_day_light_controls; // 0x0F01(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4238[0x6];                                     // 0x0F02(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            LightAnimationCurve;                               // 0x0F08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CodeControlled_Animation_Curve_Animation_Length;   // 0x0F10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate_Mesh_MID_Emissive_Value_with_a_Curve_Minus_Disables_time_of_day_light_controls; // 0x0F14(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4239[0x3];                                     // 0x0F15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Random_Time_Scale_Percent;                         // 0x0F18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CodeControlled_CurrentTimeLength;                  // 0x0F1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Parent_BuildingPropActor(int32 EntryPoint);
	void Loop_Animation_Curve();
	void OnBounceAnimationUpdate(const struct FFortBounceData& Data);
	void ReceiveBeginPlay();
	void OnDayPhaseChanged(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void UserConstructionScript();
	void Set_Light_parameters(float Previous_to_Current_Day_Phase_Alpha);
	void Set__MID_Values_For_Lights();
	void Add_to_TOD_Light_Array(class ULightComponent*& NewItem);
	void Call_Animation_Curve_Again();
	void GetTimeOfDayBlueprintDefaultVariables(struct FTimeOfDayBlueprintDefaultVariables* OutVariables);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Parent_BuildingPropActor_C">();
	}
	static class AParent_BuildingPropActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParent_BuildingPropActor_C>();
	}
};
static_assert(alignof(AParent_BuildingPropActor_C) == 0x000008, "Wrong alignment on AParent_BuildingPropActor_C");
static_assert(sizeof(AParent_BuildingPropActor_C) == 0x000F20, "Wrong size on AParent_BuildingPropActor_C");
static_assert(offsetof(AParent_BuildingPropActor_C, UberGraphFrame) == 0x000E50, "Member 'AParent_BuildingPropActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, DebugWind) == 0x000E58, "Member 'AParent_BuildingPropActor_C::DebugWind' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, IntenseWindMaterialsForPreview) == 0x000E60, "Member 'AParent_BuildingPropActor_C::IntenseWindMaterialsForPreview' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, OriginalMaterials) == 0x000E70, "Member 'AParent_BuildingPropActor_C::OriginalMaterials' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Wind_Intensity_Debug_Mesh) == 0x000E80, "Member 'AParent_BuildingPropActor_C::Wind_Intensity_Debug_Mesh' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Debug_TempMaterial) == 0x000E88, "Member 'AParent_BuildingPropActor_C::Debug_TempMaterial' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Debug_Wind_Intensity) == 0x000E90, "Member 'AParent_BuildingPropActor_C::Debug_Wind_Intensity' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, DebugWindYaw) == 0x000E94, "Member 'AParent_BuildingPropActor_C::DebugWindYaw' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Light_Intensity_Over_Time_of_Day_) == 0x000E98, "Member 'AParent_BuildingPropActor_C::Light_Intensity_Over_Time_of_Day_' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Emissive_Intensity_Over_Time_of_Day) == 0x000EA8, "Member 'AParent_BuildingPropActor_C::Emissive_Intensity_Over_Time_of_Day' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, CodeControlled_NumberOfMaterials) == 0x000EB8, "Member 'AParent_BuildingPropActor_C::CodeControlled_NumberOfMaterials' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, CodeControlled_EmissiveColor) == 0x000EC0, "Member 'AParent_BuildingPropActor_C::CodeControlled_EmissiveColor' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, CodeControlled_LightConeOpacity) == 0x000ED0, "Member 'AParent_BuildingPropActor_C::CodeControlled_LightConeOpacity' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Animate_Emissive_and_Lights_Over_Time) == 0x000EE0, "Member 'AParent_BuildingPropActor_C::Animate_Emissive_and_Lights_Over_Time' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Day_Phase_Transition_Length) == 0x000EE4, "Member 'AParent_BuildingPropActor_C::Day_Phase_Transition_Length' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Disable_TOD_Lights_and_Material_Emissive_Values) == 0x000EE8, "Member 'AParent_BuildingPropActor_C::Disable_TOD_Lights_and_Material_Emissive_Values' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active) == 0x000EE9, "Member 'AParent_BuildingPropActor_C::Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, AlternateShadowStaticMesh) == 0x000EF0, "Member 'AParent_BuildingPropActor_C::AlternateShadowStaticMesh' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Use_An_Alternate_Shadow_Mesh_When_The_Light_is_Off_) == 0x000EF8, "Member 'AParent_BuildingPropActor_C::Use_An_Alternate_Shadow_Mesh_When_The_Light_is_Off_' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Volumetric_Light_Scattering_Intensity) == 0x000EFC, "Member 'AParent_BuildingPropActor_C::Volumetric_Light_Scattering_Intensity' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Cast_Volumetric_Shadows) == 0x000F00, "Member 'AParent_BuildingPropActor_C::Cast_Volumetric_Shadows' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Animate_Lights_With_A_Curve_Minus_Disables_time_of_day_light_controls) == 0x000F01, "Member 'AParent_BuildingPropActor_C::Animate_Lights_With_A_Curve_Minus_Disables_time_of_day_light_controls' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, LightAnimationCurve) == 0x000F08, "Member 'AParent_BuildingPropActor_C::LightAnimationCurve' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, CodeControlled_Animation_Curve_Animation_Length) == 0x000F10, "Member 'AParent_BuildingPropActor_C::CodeControlled_Animation_Curve_Animation_Length' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Animate_Mesh_MID_Emissive_Value_with_a_Curve_Minus_Disables_time_of_day_light_controls) == 0x000F14, "Member 'AParent_BuildingPropActor_C::Animate_Mesh_MID_Emissive_Value_with_a_Curve_Minus_Disables_time_of_day_light_controls' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, Random_Time_Scale_Percent) == 0x000F18, "Member 'AParent_BuildingPropActor_C::Random_Time_Scale_Percent' has a wrong offset!");
static_assert(offsetof(AParent_BuildingPropActor_C, CodeControlled_CurrentTimeLength) == 0x000F1C, "Member 'AParent_BuildingPropActor_C::CodeControlled_CurrentTimeLength' has a wrong offset!");

}

