#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayedBeforeSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayedBeforeSelect.PlayedBeforeSelect_C
// 0x0038 (0x0418 - 0x03E0)
class UPlayedBeforeSelect_C final : public UFortPlayedBeforeSelect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      IconTextButton_C_0;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      IconTextButton_C_1;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       TitleImage;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayedBeforeSelect(int32 EntryPoint);
	void OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayedBeforeSelect_C">();
	}
	static class UPlayedBeforeSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayedBeforeSelect_C>();
	}
};
static_assert(alignof(UPlayedBeforeSelect_C) == 0x000008, "Wrong alignment on UPlayedBeforeSelect_C");
static_assert(sizeof(UPlayedBeforeSelect_C) == 0x000418, "Wrong size on UPlayedBeforeSelect_C");
static_assert(offsetof(UPlayedBeforeSelect_C, UberGraphFrame) == 0x0003E0, "Member 'UPlayedBeforeSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayedBeforeSelect_C, Intro) == 0x0003E8, "Member 'UPlayedBeforeSelect_C::Intro' has a wrong offset!");
static_assert(offsetof(UPlayedBeforeSelect_C, CommonTextBlock_0) == 0x0003F0, "Member 'UPlayedBeforeSelect_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UPlayedBeforeSelect_C, CommonTextBlock_1) == 0x0003F8, "Member 'UPlayedBeforeSelect_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UPlayedBeforeSelect_C, IconTextButton_C_0) == 0x000400, "Member 'UPlayedBeforeSelect_C::IconTextButton_C_0' has a wrong offset!");
static_assert(offsetof(UPlayedBeforeSelect_C, IconTextButton_C_1) == 0x000408, "Member 'UPlayedBeforeSelect_C::IconTextButton_C_1' has a wrong offset!");
static_assert(offsetof(UPlayedBeforeSelect_C, TitleImage) == 0x000410, "Member 'UPlayedBeforeSelect_C::TitleImage' has a wrong offset!");

}

