#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedirectToEpicAccount

#include "Basic.hpp"


namespace SDK::Params
{

// Function RedirectToEpicAccount.RedirectToEpicAccount_C.ExecuteUbergraph_RedirectToEpicAccount
// 0x0030 (0x0030 - 0x0000)
struct RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E73[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNewAccountWarning_C*                   CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEpicAccountForwardingEnabled;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount) == 0x000008, "Wrong alignment on RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount");
static_assert(sizeof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount) == 0x000030, "Wrong size on RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount");
static_assert(offsetof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount, EntryPoint) == 0x000000, "Member 'RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount::EntryPoint' has a wrong offset!");
static_assert(offsetof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount, CallFunc_Create_ReturnValue) == 0x000020, "Member 'RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount, K2Node_Event_bEpicAccountForwardingEnabled) == 0x000028, "Member 'RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount::K2Node_Event_bEpicAccountForwardingEnabled' has a wrong offset!");

// Function RedirectToEpicAccount.RedirectToEpicAccount_C.OnSetSwitcher
// 0x0001 (0x0001 - 0x0000)
struct RedirectToEpicAccount_C_OnSetSwitcher final
{
public:
	bool                                          bEpicAccountForwardingEnabled;                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RedirectToEpicAccount_C_OnSetSwitcher) == 0x000001, "Wrong alignment on RedirectToEpicAccount_C_OnSetSwitcher");
static_assert(sizeof(RedirectToEpicAccount_C_OnSetSwitcher) == 0x000001, "Wrong size on RedirectToEpicAccount_C_OnSetSwitcher");
static_assert(offsetof(RedirectToEpicAccount_C_OnSetSwitcher, bEpicAccountForwardingEnabled) == 0x000000, "Member 'RedirectToEpicAccount_C_OnSetSwitcher::bEpicAccountForwardingEnabled' has a wrong offset!");

// Function RedirectToEpicAccount.RedirectToEpicAccount_C.BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

}

