#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SignInWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SignInWidget.SignInWidget_C
// 0x0040 (0x0460 - 0x0420)
class USignInWidget_C final : public UFortSignInWidget
{
public:
	class UNamedSlot*                             ButtonSlot;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       CommonLazyImage_0;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ContentBox;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Description;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEmergencyNoticeWidget_C*               EmergencyNoticeWidget;                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    LoginInputAction;                                  // 0x0450(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SignInWidget_C">();
	}
	static class USignInWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignInWidget_C>();
	}
};
static_assert(alignof(USignInWidget_C) == 0x000008, "Wrong alignment on USignInWidget_C");
static_assert(sizeof(USignInWidget_C) == 0x000460, "Wrong size on USignInWidget_C");
static_assert(offsetof(USignInWidget_C, ButtonSlot) == 0x000420, "Member 'USignInWidget_C::ButtonSlot' has a wrong offset!");
static_assert(offsetof(USignInWidget_C, CommonLazyImage_0) == 0x000428, "Member 'USignInWidget_C::CommonLazyImage_0' has a wrong offset!");
static_assert(offsetof(USignInWidget_C, ContentBox) == 0x000430, "Member 'USignInWidget_C::ContentBox' has a wrong offset!");
static_assert(offsetof(USignInWidget_C, Description) == 0x000438, "Member 'USignInWidget_C::Description' has a wrong offset!");
static_assert(offsetof(USignInWidget_C, EmergencyNoticeWidget) == 0x000440, "Member 'USignInWidget_C::EmergencyNoticeWidget' has a wrong offset!");
static_assert(offsetof(USignInWidget_C, Title) == 0x000448, "Member 'USignInWidget_C::Title' has a wrong offset!");
static_assert(offsetof(USignInWidget_C, LoginInputAction) == 0x000450, "Member 'USignInWidget_C::LoginInputAction' has a wrong offset!");

}

