#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlateRemote

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class SlateRemote.SlateRemoteSettings
// 0x0028 (0x0050 - 0x0028)
class USlateRemoteSettings final : public UObject
{
public:
	bool                                          EnableRemoteServer;                                // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22D0[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EditorServerEndpoint;                              // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameServerEndpoint;                                // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SlateRemoteSettings">();
	}
	static class USlateRemoteSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateRemoteSettings>();
	}
};
static_assert(alignof(USlateRemoteSettings) == 0x000008, "Wrong alignment on USlateRemoteSettings");
static_assert(sizeof(USlateRemoteSettings) == 0x000050, "Wrong size on USlateRemoteSettings");
static_assert(offsetof(USlateRemoteSettings, EnableRemoteServer) == 0x000028, "Member 'USlateRemoteSettings::EnableRemoteServer' has a wrong offset!");
static_assert(offsetof(USlateRemoteSettings, EditorServerEndpoint) == 0x000030, "Member 'USlateRemoteSettings::EditorServerEndpoint' has a wrong offset!");
static_assert(offsetof(USlateRemoteSettings, GameServerEndpoint) == 0x000040, "Member 'USlateRemoteSettings::GameServerEndpoint' has a wrong offset!");

}

