#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialPanel.SocialPanel_C
// 0x0028 (0x0428 - 0x0400)
class USocialPanel_C final : public UFortSocialMenuPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UScaleBox*                              ScaleBoxContent;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxContent;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    InputClose;                                        // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_SocialPanel(int32 EntryPoint);
	void Construct();
	void InitializeInput();
	void HandleAction_Close(bool* Passthrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialPanel_C">();
	}
	static class USocialPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPanel_C>();
	}
};
static_assert(alignof(USocialPanel_C) == 0x000008, "Wrong alignment on USocialPanel_C");
static_assert(sizeof(USocialPanel_C) == 0x000428, "Wrong size on USocialPanel_C");
static_assert(offsetof(USocialPanel_C, UberGraphFrame) == 0x000400, "Member 'USocialPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialPanel_C, ScaleBoxContent) == 0x000408, "Member 'USocialPanel_C::ScaleBoxContent' has a wrong offset!");
static_assert(offsetof(USocialPanel_C, SizeBoxContent) == 0x000410, "Member 'USocialPanel_C::SizeBoxContent' has a wrong offset!");
static_assert(offsetof(USocialPanel_C, InputClose) == 0x000418, "Member 'USocialPanel_C::InputClose' has a wrong offset!");

}

