#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplashScreenWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SplashScreenWidget.SplashScreenWidget_C
// 0x0040 (0x0440 - 0x0400)
class USplashScreenWidget_C final : public UFortSplashScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       InputPromptIdle;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    GamepadActionWidget;                               // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       GamepadInputText;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       I_BattleRoyale;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       I_Fortnite;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MobileInputText;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MouseInputText;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_SplashScreenWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SplashScreenWidget_C">();
	}
	static class USplashScreenWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USplashScreenWidget_C>();
	}
};
static_assert(alignof(USplashScreenWidget_C) == 0x000008, "Wrong alignment on USplashScreenWidget_C");
static_assert(sizeof(USplashScreenWidget_C) == 0x000440, "Wrong size on USplashScreenWidget_C");
static_assert(offsetof(USplashScreenWidget_C, UberGraphFrame) == 0x000400, "Member 'USplashScreenWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, InputPromptIdle) == 0x000408, "Member 'USplashScreenWidget_C::InputPromptIdle' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, GamepadActionWidget) == 0x000410, "Member 'USplashScreenWidget_C::GamepadActionWidget' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, GamepadInputText) == 0x000418, "Member 'USplashScreenWidget_C::GamepadInputText' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, I_BattleRoyale) == 0x000420, "Member 'USplashScreenWidget_C::I_BattleRoyale' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, I_Fortnite) == 0x000428, "Member 'USplashScreenWidget_C::I_Fortnite' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MobileInputText) == 0x000430, "Member 'USplashScreenWidget_C::MobileInputText' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MouseInputText) == 0x000438, "Member 'USplashScreenWidget_C::MouseInputText' has a wrong offset!");

}

