#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabAccount

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TabAccount.TabAccount_C.ExecuteUbergraph_TabAccount
// 0x00F8 (0x00F8 - 0x0000)
struct TabAccount_C_ExecuteUbergraph_TabAccount final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F34[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_NewTooltipText;         // 0x0010(0x0018)()
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F35[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F36[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAccountLinkingUIURL_ReturnValue;       // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShowWebURL_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F37[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F38[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F39[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F3A[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F3B[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0098(0x0018)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue2;                     // 0x00D0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue2;           // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAccount_C_ExecuteUbergraph_TabAccount) == 0x000008, "Wrong alignment on TabAccount_C_ExecuteUbergraph_TabAccount");
static_assert(sizeof(TabAccount_C_ExecuteUbergraph_TabAccount) == 0x0000F8, "Wrong size on TabAccount_C_ExecuteUbergraph_TabAccount");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, EntryPoint) == 0x000000, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::EntryPoint' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, K2Node_ComponentBoundEvent_NewTooltipText) == 0x000010, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::K2Node_ComponentBoundEvent_NewTooltipText' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000028, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000030, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, K2Node_ComponentBoundEvent_Button3) == 0x000038, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000040, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_GetAccountLinkingUIURL_ReturnValue) == 0x000048, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_GetAccountLinkingUIURL_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_ShowWebURL_ReturnValue) == 0x000058, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_ShowWebURL_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_Len_ReturnValue) == 0x00005C, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_GetUINavigationManager_ReturnValue) == 0x000068, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_GetContext_ReturnValue2) == 0x000078, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue) == 0x000080, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, K2Node_ComponentBoundEvent_Button2) == 0x000088, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_BooleanAND_ReturnValue) == 0x000090, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_GetText_ReturnValue) == 0x000098, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_GetContext_ReturnValue3) == 0x0000B0, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B8, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, K2Node_ComponentBoundEvent_Button) == 0x0000C8, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_GetText_ReturnValue2) == 0x0000D0, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_GetText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_ExecuteUbergraph_TabAccount, CallFunc_Conv_TextToString_ReturnValue2) == 0x0000E8, "Member 'TabAccount_C_ExecuteUbergraph_TabAccount::CallFunc_Conv_TextToString_ReturnValue2' has a wrong offset!");

// Function TabAccount.TabAccount_C.BndEvt__CopyCustomerIDButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TabAccount_C_BndEvt__CopyCustomerIDButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAccount_C_BndEvt__CopyCustomerIDButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TabAccount_C_BndEvt__CopyCustomerIDButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TabAccount_C_BndEvt__CopyCustomerIDButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TabAccount_C_BndEvt__CopyCustomerIDButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TabAccount_C_BndEvt__CopyCustomerIDButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TabAccount_C_BndEvt__CopyCustomerIDButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TabAccount.TabAccount_C.BndEvt__CopyEpicAccountIDButton_K2Node_ComponentBoundEvent_56_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TabAccount_C_BndEvt__CopyEpicAccountIDButton_K2Node_ComponentBoundEvent_56_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAccount_C_BndEvt__CopyEpicAccountIDButton_K2Node_ComponentBoundEvent_56_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TabAccount_C_BndEvt__CopyEpicAccountIDButton_K2Node_ComponentBoundEvent_56_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TabAccount_C_BndEvt__CopyEpicAccountIDButton_K2Node_ComponentBoundEvent_56_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TabAccount_C_BndEvt__CopyEpicAccountIDButton_K2Node_ComponentBoundEvent_56_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TabAccount_C_BndEvt__CopyEpicAccountIDButton_K2Node_ComponentBoundEvent_56_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TabAccount_C_BndEvt__CopyEpicAccountIDButton_K2Node_ComponentBoundEvent_56_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TabAccount.TabAccount_C.BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TabAccount_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAccount_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TabAccount_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TabAccount_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TabAccount_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TabAccount_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TabAccount_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TabAccount.TabAccount_C.BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct TabAccount_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature final
{
public:
	class FText                                   NewTooltipText;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(TabAccount_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature) == 0x000008, "Wrong alignment on TabAccount_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature");
static_assert(sizeof(TabAccount_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature) == 0x000018, "Wrong size on TabAccount_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature");
static_assert(offsetof(TabAccount_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature, NewTooltipText) == 0x000000, "Member 'TabAccount_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature::NewTooltipText' has a wrong offset!");

// Function TabAccount.TabAccount_C.Initialize Data
// 0x00A0 (0x00A0 - 0x0000)
struct TabAccount_C_Initialize_Data final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTencentBuild_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F3C[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTencentId_ReturnValue;                 // 0x0008(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F3D[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0038(0x0028)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugStringForUniqueId_ReturnValue;    // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F3E[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortAccountLinkingUIConfig                   CallFunc_GetAccountLinkingUIConfig_ReturnValue;    // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F3F[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select2_Default;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAccount_C_Initialize_Data) == 0x000008, "Wrong alignment on TabAccount_C_Initialize_Data");
static_assert(sizeof(TabAccount_C_Initialize_Data) == 0x0000A0, "Wrong size on TabAccount_C_Initialize_Data");
static_assert(offsetof(TabAccount_C_Initialize_Data, Temp_bool_Variable) == 0x000000, "Member 'TabAccount_C_Initialize_Data::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, CallFunc_IsTencentBuild_ReturnValue) == 0x000001, "Member 'TabAccount_C_Initialize_Data::CallFunc_IsTencentBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, CallFunc_GetTencentId_ReturnValue) == 0x000008, "Member 'TabAccount_C_Initialize_Data::CallFunc_GetTencentId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'TabAccount_C_Initialize_Data::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000028, "Member 'TabAccount_C_Initialize_Data::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TabAccount_C_Initialize_Data::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, CallFunc_GetGameAccountId_ReturnValue) == 0x000038, "Member 'TabAccount_C_Initialize_Data::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, CallFunc_GetDebugStringForUniqueId_ReturnValue) == 0x000060, "Member 'TabAccount_C_Initialize_Data::CallFunc_GetDebugStringForUniqueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, Temp_byte_Variable) == 0x000070, "Member 'TabAccount_C_Initialize_Data::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'TabAccount_C_Initialize_Data::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, Temp_byte_Variable2) == 0x000090, "Member 'TabAccount_C_Initialize_Data::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, Temp_bool_Variable2) == 0x000091, "Member 'TabAccount_C_Initialize_Data::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, K2Node_Select_Default) == 0x000092, "Member 'TabAccount_C_Initialize_Data::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, CallFunc_GetAccountLinkingUIConfig_ReturnValue) == 0x000093, "Member 'TabAccount_C_Initialize_Data::CallFunc_GetAccountLinkingUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000094, "Member 'TabAccount_C_Initialize_Data::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Initialize_Data, K2Node_Select2_Default) == 0x000098, "Member 'TabAccount_C_Initialize_Data::K2Node_Select2_Default' has a wrong offset!");

// Function TabAccount.TabAccount_C.Fire Enter Live Stream Analytic
// 0x0050 (0x0050 - 0x0000)
struct TabAccount_C_Fire_Enter_Live_Stream_Analytic final
{
public:
	struct FFortAnalyticsEventAttribute           CallFunc_Build_Player_Id_Analytic_Attribute_ReturnValue; // 0x0000(0x0020)()
	struct FFortAnalyticsEventAttribute           CallFunc_Build_Player_Name_Analytic_Attribute_ReturnValue; // 0x0020(0x0020)()
	TArray<struct FFortAnalyticsEventAttribute>   K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(TabAccount_C_Fire_Enter_Live_Stream_Analytic) == 0x000008, "Wrong alignment on TabAccount_C_Fire_Enter_Live_Stream_Analytic");
static_assert(sizeof(TabAccount_C_Fire_Enter_Live_Stream_Analytic) == 0x000050, "Wrong size on TabAccount_C_Fire_Enter_Live_Stream_Analytic");
static_assert(offsetof(TabAccount_C_Fire_Enter_Live_Stream_Analytic, CallFunc_Build_Player_Id_Analytic_Attribute_ReturnValue) == 0x000000, "Member 'TabAccount_C_Fire_Enter_Live_Stream_Analytic::CallFunc_Build_Player_Id_Analytic_Attribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Fire_Enter_Live_Stream_Analytic, CallFunc_Build_Player_Name_Analytic_Attribute_ReturnValue) == 0x000020, "Member 'TabAccount_C_Fire_Enter_Live_Stream_Analytic::CallFunc_Build_Player_Name_Analytic_Attribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Fire_Enter_Live_Stream_Analytic, K2Node_MakeArray_Array) == 0x000040, "Member 'TabAccount_C_Fire_Enter_Live_Stream_Analytic::K2Node_MakeArray_Array' has a wrong offset!");

// Function TabAccount.TabAccount_C.Build Player Name Analytic Attribute
// 0x0098 (0x0098 - 0x0000)
struct TabAccount_C_Build_Player_Name_Analytic_Attribute final
{
public:
	struct FFortAnalyticsEventAttribute           ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F40[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0038(0x0028)(HasGetValueTypeHash)
	class UFortRegisteredPlayerInfo*              CallFunc_GetPlayerInfoFromUniqueID_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFortAnalyticsEventAttribute           CallFunc_ConstructAnalyticsAttribute_ReturnValue;  // 0x0078(0x0020)()
};
static_assert(alignof(TabAccount_C_Build_Player_Name_Analytic_Attribute) == 0x000008, "Wrong alignment on TabAccount_C_Build_Player_Name_Analytic_Attribute");
static_assert(sizeof(TabAccount_C_Build_Player_Name_Analytic_Attribute) == 0x000098, "Wrong size on TabAccount_C_Build_Player_Name_Analytic_Attribute");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, ReturnValue) == 0x000000, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000028, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, CallFunc_GetGameAccountId_ReturnValue) == 0x000038, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, CallFunc_GetPlayerInfoFromUniqueID_ReturnValue) == 0x000060, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::CallFunc_GetPlayerInfoFromUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, CallFunc_GetPlayerName_ReturnValue) == 0x000068, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, CallFunc_ConstructAnalyticsAttribute_ReturnValue) == 0x000078, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::CallFunc_ConstructAnalyticsAttribute_ReturnValue' has a wrong offset!");

// Function TabAccount.TabAccount_C.Build Player Id Analytic Attribute
// 0x0090 (0x0090 - 0x0000)
struct TabAccount_C_Build_Player_Id_Analytic_Attribute final
{
public:
	struct FFortAnalyticsEventAttribute           ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F41[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0038(0x0028)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugStringForUniqueId_ReturnValue;    // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFortAnalyticsEventAttribute           CallFunc_ConstructAnalyticsAttribute_ReturnValue;  // 0x0070(0x0020)()
};
static_assert(alignof(TabAccount_C_Build_Player_Id_Analytic_Attribute) == 0x000008, "Wrong alignment on TabAccount_C_Build_Player_Id_Analytic_Attribute");
static_assert(sizeof(TabAccount_C_Build_Player_Id_Analytic_Attribute) == 0x000090, "Wrong size on TabAccount_C_Build_Player_Id_Analytic_Attribute");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, ReturnValue) == 0x000000, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000028, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, CallFunc_GetGameAccountId_ReturnValue) == 0x000038, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, CallFunc_GetDebugStringForUniqueId_ReturnValue) == 0x000060, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::CallFunc_GetDebugStringForUniqueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, CallFunc_ConstructAnalyticsAttribute_ReturnValue) == 0x000070, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::CallFunc_ConstructAnalyticsAttribute_ReturnValue' has a wrong offset!");

// Function TabAccount.TabAccount_C.InitializeWebsiteConfiguration
// 0x0088 (0x0088 - 0x0000)
struct TabAccount_C_InitializeWebsiteConfiguration final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F42[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0020(0x0018)()
	bool                                          CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F43[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAccountLinkingUIURL_ReturnValue;       // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortAccountLinkingUIConfig                   CallFunc_GetAccountLinkingUIConfig_ReturnValue;    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select2_Default;                            // 0x0070(0x0018)()
};
static_assert(alignof(TabAccount_C_InitializeWebsiteConfiguration) == 0x000008, "Wrong alignment on TabAccount_C_InitializeWebsiteConfiguration");
static_assert(sizeof(TabAccount_C_InitializeWebsiteConfiguration) == 0x000088, "Wrong size on TabAccount_C_InitializeWebsiteConfiguration");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, Temp_bool_Variable) == 0x000000, "Member 'TabAccount_C_InitializeWebsiteConfiguration::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, Temp_byte_Variable) == 0x000001, "Member 'TabAccount_C_InitializeWebsiteConfiguration::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, Temp_byte_Variable2) == 0x000002, "Member 'TabAccount_C_InitializeWebsiteConfiguration::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, Temp_bool_Variable2) == 0x000003, "Member 'TabAccount_C_InitializeWebsiteConfiguration::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, Temp_text_Variable) == 0x000008, "Member 'TabAccount_C_InitializeWebsiteConfiguration::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, Temp_text_Variable2) == 0x000020, "Member 'TabAccount_C_InitializeWebsiteConfiguration::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue) == 0x000038, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_GetAccountLinkingUIURL_ReturnValue) == 0x000040, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_GetAccountLinkingUIURL_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_Len_ReturnValue) == 0x000068, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_Greater_IntInt_ReturnValue) == 0x00006C, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_GetAccountLinkingUIConfig_ReturnValue) == 0x00006D, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_GetAccountLinkingUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00006E, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, K2Node_Select_Default) == 0x00006F, "Member 'TabAccount_C_InitializeWebsiteConfiguration::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, K2Node_Select2_Default) == 0x000070, "Member 'TabAccount_C_InitializeWebsiteConfiguration::K2Node_Select2_Default' has a wrong offset!");

// Function TabAccount.TabAccount_C.GetTencentId
// 0x0048 (0x0048 - 0x0000)
struct TabAccount_C_GetTencentId final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTencentIdString_ReturnValue;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(TabAccount_C_GetTencentId) == 0x000008, "Wrong alignment on TabAccount_C_GetTencentId");
static_assert(sizeof(TabAccount_C_GetTencentId) == 0x000048, "Wrong size on TabAccount_C_GetTencentId");
static_assert(offsetof(TabAccount_C_GetTencentId, ReturnValue) == 0x000000, "Member 'TabAccount_C_GetTencentId::ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_GetTencentId, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'TabAccount_C_GetTencentId::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_GetTencentId, CallFunc_GetTencentIdString_ReturnValue) == 0x000020, "Member 'TabAccount_C_GetTencentId::CallFunc_GetTencentIdString_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_GetTencentId, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'TabAccount_C_GetTencentId::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

