#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabAccount

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TabAccount.TabAccount_C
// 0x0088 (0x02A8 - 0x0220)
class UTabAccount_C final : public UFortAccountOptions
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       AccountLinkText;                                   // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderBonusesBottomEdge;                           // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_5;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  ConfigurationSwitcher;                             // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CopyCustomerIDButton;                              // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CopyEpicAccountIDButton;                           // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DefaultConfigurationBox;                           // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       EpicId;                                            // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortTwitchLogin_C*                     FortTwitchLogin;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RailId;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StaticURLText;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TencentRailInfoHBox;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TooltipTextBox;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      URLButton;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           WebsiteConfigurationBox;                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TabAccount(int32 EntryPoint);
	void BndEvt__CopyCustomerIDButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CopyEpicAccountIDButton_K2Node_ComponentBoundEvent_56_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature(const class FText& NewTooltipText);
	void Construct();
	void CenterOnTab();
	void UpdateOptionsTab();
	void Update_Data();
	void Initialize_Data();
	void Fire_Enter_Live_Stream_Analytic();
	struct FFortAnalyticsEventAttribute Build_Player_Name_Analytic_Attribute();
	struct FFortAnalyticsEventAttribute Build_Player_Id_Analytic_Attribute();
	void InitializeWebsiteConfiguration();
	class FText GetTencentId();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TabAccount_C">();
	}
	static class UTabAccount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTabAccount_C>();
	}
};
static_assert(alignof(UTabAccount_C) == 0x000008, "Wrong alignment on UTabAccount_C");
static_assert(sizeof(UTabAccount_C) == 0x0002A8, "Wrong size on UTabAccount_C");
static_assert(offsetof(UTabAccount_C, UberGraphFrame) == 0x000220, "Member 'UTabAccount_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, AccountLinkText) == 0x000228, "Member 'UTabAccount_C::AccountLinkText' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, BorderBonusesBottomEdge) == 0x000230, "Member 'UTabAccount_C::BorderBonusesBottomEdge' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, CommonBorder_5) == 0x000238, "Member 'UTabAccount_C::CommonBorder_5' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, ConfigurationSwitcher) == 0x000240, "Member 'UTabAccount_C::ConfigurationSwitcher' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, CopyCustomerIDButton) == 0x000248, "Member 'UTabAccount_C::CopyCustomerIDButton' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, CopyEpicAccountIDButton) == 0x000250, "Member 'UTabAccount_C::CopyEpicAccountIDButton' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, DefaultConfigurationBox) == 0x000258, "Member 'UTabAccount_C::DefaultConfigurationBox' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, EpicId) == 0x000260, "Member 'UTabAccount_C::EpicId' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, FortTwitchLogin) == 0x000268, "Member 'UTabAccount_C::FortTwitchLogin' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, Image_0) == 0x000270, "Member 'UTabAccount_C::Image_0' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, RailId) == 0x000278, "Member 'UTabAccount_C::RailId' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, StaticURLText) == 0x000280, "Member 'UTabAccount_C::StaticURLText' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, TencentRailInfoHBox) == 0x000288, "Member 'UTabAccount_C::TencentRailInfoHBox' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, TooltipTextBox) == 0x000290, "Member 'UTabAccount_C::TooltipTextBox' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, URLButton) == 0x000298, "Member 'UTabAccount_C::URLButton' has a wrong offset!");
static_assert(offsetof(UTabAccount_C, WebsiteConfigurationBox) == 0x0002A0, "Member 'UTabAccount_C::WebsiteConfigurationBox' has a wrong offset!");

}

