#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeddyBear_GliderChute_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TeddyBear_GliderChute_AnimBP.TeddyBear_GliderChute_AnimBP_C
// 0x0698 (0x0A60 - 0x03C8)
class UTeddyBear_GliderChute_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2DD0[0x8];                                     // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_7B9AB6174CBF26DCFE8C85B4699432FF; // 0x03D8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_C0AEB3F64E8B4C932B0DDDBEBCD5C7D6; // 0x0420(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2BAC07B641AB7C2328B5EE88BFCEEFEA; // 0x0490(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D05B993342F5390C7313AD9D0D74582B; // 0x0510(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_348F4FFD4315B58B782EF5842C63FA31; // 0x0590(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_062A292B4AA69A68FA1F1FB0F23938A7; // 0x0610(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2C843D954470688C6682499E445E913C; // 0x0690(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_90D829684F53C5C1DF19C6B84109020A; // 0x0700(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B61792C5413AAA333931119E94040F61; // 0x0748(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_18A861B44C61E1EFE22D70B93E8D009A; // 0x07B8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8957D07F4189CEB7EEA42EBBAEABA5B7; // 0x0800(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_81F1F9E547DEDAECE5F9958F98A5E99C; // 0x0928(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_68A674AE4D6D6FC437A3D28D8A1B5733; // 0x0970(0x00E0)()
	bool                                          IsParachuteOpen;                                   // 0x0A50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DD1[0x3];                                     // 0x0A51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AimPitch;                                          // 0x0A54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeployAnimRate;                                    // 0x0A58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkydiveYaw;                                        // 0x0A5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TeddyBear_GliderChute_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_TransitionResult_2BAC07B641AB7C2328B5EE88BFCEEFEA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_BlendSpacePlayer_8957D07F4189CEB7EEA42EBBAEABA5B7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_SequencePlayer_B61792C5413AAA333931119E94040F61();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_TransitionResult_D05B993342F5390C7313AD9D0D74582B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_TransitionResult_062A292B4AA69A68FA1F1FB0F23938A7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_TransitionResult_348F4FFD4315B58B782EF5842C63FA31();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TeddyBear_GliderChute_AnimBP_C">();
	}
	static class UTeddyBear_GliderChute_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeddyBear_GliderChute_AnimBP_C>();
	}
};
static_assert(alignof(UTeddyBear_GliderChute_AnimBP_C) == 0x000010, "Wrong alignment on UTeddyBear_GliderChute_AnimBP_C");
static_assert(sizeof(UTeddyBear_GliderChute_AnimBP_C) == 0x000A60, "Wrong size on UTeddyBear_GliderChute_AnimBP_C");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, UberGraphFrame) == 0x0003D0, "Member 'UTeddyBear_GliderChute_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AnimGraphNode_Root_7B9AB6174CBF26DCFE8C85B4699432FF) == 0x0003D8, "Member 'UTeddyBear_GliderChute_AnimBP_C::AnimGraphNode_Root_7B9AB6174CBF26DCFE8C85B4699432FF' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AnimGraphNode_Slot_C0AEB3F64E8B4C932B0DDDBEBCD5C7D6) == 0x000420, "Member 'UTeddyBear_GliderChute_AnimBP_C::AnimGraphNode_Slot_C0AEB3F64E8B4C932B0DDDBEBCD5C7D6' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AnimGraphNode_TransitionResult_2BAC07B641AB7C2328B5EE88BFCEEFEA) == 0x000490, "Member 'UTeddyBear_GliderChute_AnimBP_C::AnimGraphNode_TransitionResult_2BAC07B641AB7C2328B5EE88BFCEEFEA' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AnimGraphNode_TransitionResult_D05B993342F5390C7313AD9D0D74582B) == 0x000510, "Member 'UTeddyBear_GliderChute_AnimBP_C::AnimGraphNode_TransitionResult_D05B993342F5390C7313AD9D0D74582B' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AnimGraphNode_TransitionResult_348F4FFD4315B58B782EF5842C63FA31) == 0x000590, "Member 'UTeddyBear_GliderChute_AnimBP_C::AnimGraphNode_TransitionResult_348F4FFD4315B58B782EF5842C63FA31' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AnimGraphNode_TransitionResult_062A292B4AA69A68FA1F1FB0F23938A7) == 0x000610, "Member 'UTeddyBear_GliderChute_AnimBP_C::AnimGraphNode_TransitionResult_062A292B4AA69A68FA1F1FB0F23938A7' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AnimGraphNode_SequencePlayer_2C843D954470688C6682499E445E913C) == 0x000690, "Member 'UTeddyBear_GliderChute_AnimBP_C::AnimGraphNode_SequencePlayer_2C843D954470688C6682499E445E913C' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AnimGraphNode_StateResult_90D829684F53C5C1DF19C6B84109020A) == 0x000700, "Member 'UTeddyBear_GliderChute_AnimBP_C::AnimGraphNode_StateResult_90D829684F53C5C1DF19C6B84109020A' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AnimGraphNode_SequencePlayer_B61792C5413AAA333931119E94040F61) == 0x000748, "Member 'UTeddyBear_GliderChute_AnimBP_C::AnimGraphNode_SequencePlayer_B61792C5413AAA333931119E94040F61' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AnimGraphNode_StateResult_18A861B44C61E1EFE22D70B93E8D009A) == 0x0007B8, "Member 'UTeddyBear_GliderChute_AnimBP_C::AnimGraphNode_StateResult_18A861B44C61E1EFE22D70B93E8D009A' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AnimGraphNode_BlendSpacePlayer_8957D07F4189CEB7EEA42EBBAEABA5B7) == 0x000800, "Member 'UTeddyBear_GliderChute_AnimBP_C::AnimGraphNode_BlendSpacePlayer_8957D07F4189CEB7EEA42EBBAEABA5B7' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AnimGraphNode_StateResult_81F1F9E547DEDAECE5F9958F98A5E99C) == 0x000928, "Member 'UTeddyBear_GliderChute_AnimBP_C::AnimGraphNode_StateResult_81F1F9E547DEDAECE5F9958F98A5E99C' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AnimGraphNode_StateMachine_68A674AE4D6D6FC437A3D28D8A1B5733) == 0x000970, "Member 'UTeddyBear_GliderChute_AnimBP_C::AnimGraphNode_StateMachine_68A674AE4D6D6FC437A3D28D8A1B5733' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, IsParachuteOpen) == 0x000A50, "Member 'UTeddyBear_GliderChute_AnimBP_C::IsParachuteOpen' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, AimPitch) == 0x000A54, "Member 'UTeddyBear_GliderChute_AnimBP_C::AimPitch' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, DeployAnimRate) == 0x000A58, "Member 'UTeddyBear_GliderChute_AnimBP_C::DeployAnimRate' has a wrong offset!");
static_assert(offsetof(UTeddyBear_GliderChute_AnimBP_C, SkydiveYaw) == 0x000A5C, "Member 'UTeddyBear_GliderChute_AnimBP_C::SkydiveYaw' has a wrong offset!");

}

