#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_Player_Campfire

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.ExecuteUbergraph_Trap_Floor_Player_Campfire
// 0x0670 (0x0670 - 0x0000)
struct Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E0[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0010(0x0080)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue2;       // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E1[0x8];                                     // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam2;               // 0x00B0(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E2[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam3;               // 0x0140(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x01D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue3;       // 0x01E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue4;       // 0x01EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E3[0x8];                                     // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam4;               // 0x0200(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam5;               // 0x0280(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam6;               // 0x0300(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam7;               // 0x0380(0x0080)(IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E4[0x4];                                     // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0408(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22E5[0x1];                                     // 0x041B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x041C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0428(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0434(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x0448(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22E6[0x3];                                     // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0458(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x0464(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0478(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E7[0x4];                                     // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType2;                // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E8[0x6];                                     // 0x0492(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters2;               // 0x0498(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E9[0x6];                                     // 0x0552(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0558(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22EA[0x2];                                     // 0x0612(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue3;     // 0x0614(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue4;     // 0x0628(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0634(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22EB[0x4];                                     // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_Event_Pawn;                                 // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22EC[0x3];                                     // 0x0651(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x065C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22ED[0x3];                                     // 0x065D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0660(0x0008)(NoDestructor)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire) == 0x000010, "Wrong alignment on Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire) == 0x000670, "Wrong size on Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, EntryPoint) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam) == 0x000010, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000090, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_VectorVector_ReturnValue2) == 0x00009C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam2) == 0x0000B0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_BreakVector_X) == 0x000130, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_BreakVector_Y) == 0x000134, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_BreakVector_Z) == 0x000138, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam3) == 0x000140, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001C0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0001C4, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_MakeVector_ReturnValue) == 0x0001C8, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_MakeVector_ReturnValue2) == 0x0001D4, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_VectorVector_ReturnValue3) == 0x0001E0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_VectorVector_ReturnValue4) == 0x0001EC, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_VectorVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam4) == 0x000200, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam5) == 0x000280, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam6) == 0x000300, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam7) == 0x000380, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam7' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, Temp_float_Variable) == 0x000400, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeArray_Array) == 0x000408, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000418, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_IsDedicatedServer_ReturnValue) == 0x000419, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_HasAuthority_ReturnValue) == 0x00041A, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00041C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000428, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000434, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000440, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x000448, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_IsValid_ReturnValue) == 0x000454, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000458, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x000464, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000470, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x000478, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000488, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_IsValid_ReturnValue2) == 0x000490, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_GameplayCueEvent_EventType2) == 0x000491, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_GameplayCueEvent_EventType2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_GameplayCueEvent_Parameters2) == 0x000498, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_GameplayCueEvent_Parameters2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_SwitchEnum_CmpSuccess) == 0x000550, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_GameplayCueEvent_EventType) == 0x000551, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_GameplayCueEvent_Parameters) == 0x000558, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_SwitchEnum2_CmpSuccess) == 0x000610, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_IsValid_ReturnValue3) == 0x000611, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetComponentLocation_ReturnValue3) == 0x000614, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetComponentLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000620, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetComponentLocation_ReturnValue4) == 0x000628, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetComponentLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000634, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_VSize_ReturnValue) == 0x000640, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_Pawn) == 0x000648, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000650, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000654, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_FTrunc_ReturnValue) == 0x000658, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_SwitchEnum3_CmpSuccess) == 0x00065C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_SetTimer_ReturnValue) == 0x000660, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.TriggerLaunchEffects
// 0x0008 (0x0008 - 0x0000)
struct Trap_Floor_Player_Campfire_C_TriggerLaunchEffects final
{
public:
	class AFortPlayerPawnAthena*                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_TriggerLaunchEffects) == 0x000008, "Wrong alignment on Trap_Floor_Player_Campfire_C_TriggerLaunchEffects");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_TriggerLaunchEffects) == 0x000008, "Wrong size on Trap_Floor_Player_Campfire_C_TriggerLaunchEffects");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_TriggerLaunchEffects, Pawn) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_TriggerLaunchEffects::Pawn' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x00C0 (0x00C0 - 0x0000)
struct Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22EE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000008, "Wrong alignment on Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x0000C0, "Wrong size on Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000008, "Member 'Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.GameplayCue.Abilities.Activation.Traps.ReloadBegin
// 0x00C0 (0x00C0 - 0x0000)
struct Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22EF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin) == 0x000008, "Wrong alignment on Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin) == 0x0000C0, "Wrong size on Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin, EventType) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin, Parameters) == 0x000008, "Member 'Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin::Parameters' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.HealTicks
// 0x0110 (0x0110 - 0x0000)
struct Trap_Floor_Player_Campfire_C_HealTicks final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22F1[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22F2[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22F3[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F4[0xE];                                     // 0x0062(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue2;      // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22F5[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_BoxOverlapActors_OutActors;               // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BoxOverlapActors_ReturnValue;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F6[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F7[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F8[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPointInBoxWithTransform_ReturnValue;    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F9[0x2];                                     // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue3;     // 0x00FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPointInBoxWithTransform_ReturnValue2;   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_HealTicks) == 0x000010, "Wrong alignment on Trap_Floor_Player_Campfire_C_HealTicks");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_HealTicks) == 0x000110, "Wrong size on Trap_Floor_Player_Campfire_C_HealTicks");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, Temp_object_Variable) == 0x000048, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000058, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_EvaluateCurveTableRow_OutXY) == 0x00005C, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000060, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, K2Node_SwitchEnum_CmpSuccess) == 0x000061, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_K2_GetComponentToWorld_ReturnValue2) == 0x000070, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_K2_GetComponentToWorld_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A0, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_BoxOverlapActors_OutActors) == 0x0000B0, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_BoxOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_BoxOverlapActors_ReturnValue) == 0x0000C0, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_BoxOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_Add_IntInt_ReturnValue2) == 0x0000C4, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0000D0, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_Array_Length_ReturnValue) == 0x0000DC, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x0000E0, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x0000EC, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_IsDead_ReturnValue) == 0x0000F8, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_IsPointInBoxWithTransform_ReturnValue) == 0x0000F9, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_IsPointInBoxWithTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_K2_GetComponentLocation_ReturnValue3) == 0x0000FC, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_K2_GetComponentLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_IsPointInBoxWithTransform_ReturnValue2) == 0x000108, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_IsPointInBoxWithTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000109, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.InitCampfireEffects
// 0x0010 (0x0010 - 0x0000)
struct Trap_Floor_Player_Campfire_C_InitCampfireEffects final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22FA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_InitCampfireEffects) == 0x000004, "Wrong alignment on Trap_Floor_Player_Campfire_C_InitCampfireEffects");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_InitCampfireEffects) == 0x000010, "Wrong size on Trap_Floor_Player_Campfire_C_InitCampfireEffects");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_InitCampfireEffects, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_InitCampfireEffects::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_InitCampfireEffects, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'Trap_Floor_Player_Campfire_C_InitCampfireEffects::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.GetFireLocationAndRotation
// 0x0060 (0x0060 - 0x0000)
struct Trap_Floor_Player_Campfire_C_GetFireLocationAndRotation final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_GetFireLocationAndRotation) == 0x000010, "Wrong alignment on Trap_Floor_Player_Campfire_C_GetFireLocationAndRotation");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_GetFireLocationAndRotation) == 0x000060, "Wrong size on Trap_Floor_Player_Campfire_C_GetFireLocationAndRotation");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GetFireLocationAndRotation, ReturnValue) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_GetFireLocationAndRotation::ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GetFireLocationAndRotation, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'Trap_Floor_Player_Campfire_C_GetFireLocationAndRotation::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");

}

