#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WebLogin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WebLogin.WebLogin_C
// 0x0038 (0x03F8 - 0x03C0)
class UWebLogin_C final : public UCommonActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(Transient, DuplicateTransient)
	class UCircularThrobber*                      Throbber;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                WebContent;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    BackAction;                                        // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	UMulticastDelegateProperty_                   OnLoginDialogDismissed;                            // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BindDelegates();
	void Dismiss();
	void Display(class UWidget* WebWidget);
	void ExecuteUbergraph_WebLogin(int32 EntryPoint);
	void HandleBack();
	void OnActivated();
	void OnLoginDialogDismissed__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WebLogin_C">();
	}
	static class UWebLogin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWebLogin_C>();
	}
};
static_assert(alignof(UWebLogin_C) == 0x000008, "Wrong alignment on UWebLogin_C");
static_assert(sizeof(UWebLogin_C) == 0x0003F8, "Wrong size on UWebLogin_C");
static_assert(offsetof(UWebLogin_C, UberGraphFrame) == 0x0003C0, "Member 'UWebLogin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWebLogin_C, Throbber) == 0x0003C8, "Member 'UWebLogin_C::Throbber' has a wrong offset!");
static_assert(offsetof(UWebLogin_C, WebContent) == 0x0003D0, "Member 'UWebLogin_C::WebContent' has a wrong offset!");
static_assert(offsetof(UWebLogin_C, BackAction) == 0x0003D8, "Member 'UWebLogin_C::BackAction' has a wrong offset!");
static_assert(offsetof(UWebLogin_C, OnLoginDialogDismissed) == 0x0003E8, "Member 'UWebLogin_C::OnLoginDialogDismissed' has a wrong offset!");

}

